var all = {"data":[
[1.1,
0.71,
0.79,
0.68,
0.77,
0.82,
0.57,
0.99,
1.69,
0.87,
1,
0.54,
0.84,
0.87,
0.57,
1.03,
0.84,
0.73,
0.7,
0.66,
0.66,
1.02,
2.02,
0.57,
0.63,
0.56,
0.38,
0.54,
0.46,
0.78],

[0.14,
0.16,
0.24,
0.16,
0.13,
0.11,
0.16,
0.09,
0.1,
0.15,
0.19,
0.11,
0.1,
0.1,
0.11,
0.11,
0.15,
0.14,
0.16,
0.12,
0.08,
0.13,
0.09,
0.12,
0.17,
0.16,
0.12,
0.16,
0.1,
0.08],

[357.96,
330.53,
215.36,
234.92,
464.76,
372.29,
302.02,
792.42,
2565.36,
275.02,
306.62,
269.61,
1407.79,
1583.18,
455.16,
340.24,
347.84,
14124.27,
481.21,
413.67,
1324.72,
256.24,
57970.65,
472.32,
359.26,
266.24,
346.15,
364.25,
39814.06,
54625.96
],

[2.403,
2.641,
2.842,
2.375,
2.459,
2.154,
2.37,
2.429,
2.47,
2.505,
3.38,
2.163,
2.296,
2.625,
2.291,
2.732,
3.259,
2.65,
3.072,
2.593,
2.085,
2.661,
2.572,
2.599,
3.063,
3.474,
2.841,
2.732,
1.852,
2.305 ],

[95.07,
93.42,
95.07,
87.12,
87.67,
94.52,
87.67,
98.63,
100,
83.01,
95.62,
86.85,
86.85,
98.63,
83.84,
84.38,
100,
88.77,
83.56,
88.22,
91.23,
75.62,
78.36,
90.96,
86.58,
66.85,
96.16,
91.23,
87.67,
92.33],

[1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
[1.1,
0.71,
0.79,
0.68,
0.77,
0.82,
0.57,
0.99,
1.69,
0.87,
1,
0.54,
0.84,
0.87,
0.57,
1.03,
0.84,
0.73,
0.7,
0.66,
0.66,
1.02,
2.02,
0.57,
0.63,
0.56,
0.38,
0.54,
0.46,
0.78],
[0.1540,0.1136,0.1896,0.1088,0.1001,0.0902,0.0912,0.0891,0.1690,0.1305,0.1900,0.0594,0.0840,0.0870,0.0627,0.1133,0.1260,0.1022,0.1120,0.0792,0.0528,0.1326,0.1818,0.0684,0.1071,0.0896,0.0456,0.0864,0.0460,0.0624,],
[0.1926,0.1702,0.1554,0.1885,0.1577,0.1523,0.1396,0.1127,0.1053,0.1154,0.0712,0.1171,0.1053,0.0811,0.0937,0.0781,0.0552,0.0723,0.0662,0.0699,0.0789,0.0745,0.0744,0.0635,0.0528,0.0560,0.0439,0.0481,0.0616,0.0329,],
[0.4628,0.4496,0.4418,0.4477,0.3878,0.3280,0.3308,0.2738,0.2600,0.2891,0.2405,0.2533,0.2418,0.2129,0.2147,0.2133,0.1800,0.1915,0.2034,0.1814,0.1644,0.1984,0.1914,0.1649,0.1617,0.1945,0.1248,0.1315,0.1141,0.0758,],
[0.44,
0.42,
0.42,
0.39,
0.34,
0.31,
0.29,
0.27,
0.26,
0.24,
0.23,
0.22,
0.21,
0.21,
0.18,
0.18,
0.18,
0.17,
0.17,
0.16,
0.15,
0.15,
0.15,
0.15,
0.14,
0.13,
0.12,
0.12,
0.1,
0.07
]],
"provinces":["江西","湖南","内蒙古","河南","山东","吉林","河北","福建","海南","安徽","贵州","黑龙江","江苏","广东","湖北","山西","云南","重庆","陕西","四川","浙江","新疆","北京","辽宁","青海","甘肃","广西","宁夏","天津","上海"],
"years":["就业与物价指数","房价承担指数","人均个人所得税","城乡收入差距指数","空气质量达二级比例","幸福指数=就业与物价指数×房价承担指数×税收负担指数×城乡收入差距指数×空气质量指数","就业与物价指数","就业与物价指数×房价承担指数","就业与物价指数×房价承担指数×税收负担指数","就业与物价指数×房价承担指数×税收负担指数×城乡收入差距指数","就业与物价指数×房价承担指数×税收负担指数×城乡收入差距指数×空气质量指数"]};

option = {
	timeline: {
		axisType: 'category',
		autoPlay: true,
		playInterval: 5000,
		data: all.years
	},
	options: [{
			title: {
				text: all.years[0] ,
				left: 'center'
			},
			tooltip: {
				trigger: 'axis'
			},
			toolbox: {
				show: true,
				orient: 'vertical',
				x: 'right',
				y: 'center',
				feature: {
					mark: {
						show: true
					},
					dataView: {
						show: true,
						readOnly: false
					},
					magicType: {
						show: true,
						type: ['line', 'bar']
					},
					restore: {
						show: true
					},
					saveAsImage: {
						show: true
					}
				}
			},
			calculable: true,
			grid: {
				y: 100,
				y2: 100
			},
			xAxis: [{
				type: 'category',
				axisLabel: {
					interval: 0
				},
				data: all.provinces
			}],
			yAxis: [{
				type: 'value',
				name: '数值'
			}],
			series: [{
				name: '',
				type: 'bar',
				markLine: {
					symbol: ['arrow', 'none'],
					symbolSize: [4, 2],
					itemStyle: {
						normal: {
							lineStyle: {
								color: 'orange'
							},
							barBorderColor: 'orange',
							label: {
								position: 'left',
								formatter: function (params) {
									return Math.round(params.value);
								},
								textStyle: {
									color: 'orange'
								}
							}
						}
					},
			
				},
				data: all.data[0]
			}]
		},
		{
			title: {
				text: all.years[1] 
			},
			series: [{
				data: all.data[1]
			}]
		},
		{
			title: {
				text: all.years[2] 
			},
			series: [{
				data: all.data[2]
			}]
		},
		{
			title: {
				text: all.years[3] 
			},
			series: [{
				data: all.data[3]
			}]
		},
		{
			title: {
				text: all.years[4] 
			},
			series: [{
				data: all.data[4]
			}]
		},
		{
			title: {
				text: all.years[5]
			},
			series: [{
				data: all.data[5]
			}]
		},
		{
			title: {
				text: all.years[6] 
			},
			series: [{
				data: all.data[6]
			}]
		},
		{
			title: {
				text: all.years[7]
			},
			series: [{
				data: all.data[7]
			}]
		},
		{
			title: {
				text: all.years[8]
			},
			series: [{
				data: all.data[8]
			}]
		},
		{
			title: {
				text: all.years[9] 
			},
			series: [{
				data: all.data[9]
			}]
		},
		{
			title: {
				text: all.years[10] 
			},
			series: [{
				data: all.data[10]
			}]
		}
		
	]
};
