var set1 = [
    ['商品', '评价得分', '满意度', '评论数'],
    ['商品13', 2.69, 0.37, 180],
    ['商品15', 2.76, 0.42, 331],
    ['商品6', 2.78, 0.67, 222],
    ['商品8', 2.94, 0.71, 328],
    ['商品3', 2.95, 0.02, 588],
    ['商品10', 2.95, 0.7, 170],
    ['商品2', 2.97, 0.82, 324],
    ['商品9', 2.98, 0.85, 294],
    ['商品16', 2.98, 0.52, 405],
    ['商品12', 3.03, 0.24, 317],
    ['商品5', 3.07, 0.92, 348],
    ['商品1', 3.11, 0.91, 360],
    ['商品7', 3.12, 0.46, 256],
    ['商品4', 3.14, 0.68, 512],
    ['商品14', 3.18, 0.57, 291],
    ['商品11', 3.26, 0.48, 213]
];

option = {
    // backgroundColor:'#fff',
    grid: {
        top: 32,
        left: 48,
        right: 56,
        bottom: 24,
    },
    dataset: {
        source: set1
    },
    legend: {
        left: 16,
        top: 0,
    },
    yAxis: {
       name: '平均分值'
    },
    xAxis: {
        name:'满意度'
    },
    series: [
        {
            type:'scatter',
            encode:{
                x:[1],
                y:[2]
            }
        }, 
        
    ]
};
myChart.resize({
    width: 536,
    height: 320
})