$.get('https://hujinbo.oss-cn-shenzhen.aliyuncs.com/tmp/china.json', function (geoJson) {
    echarts.registerMap('china', geoJson);

    myChart.setOption({
        mapSelect: {
            areaCode: [],
            granularity: 'country',
        },
        geo: [
            {
                map: 'china',
                roam: true,
                label: {
                    show: true,
                    color: '#555555',
                },
                itemStyle: {
                    areaColor: '#e6e8ea',
                    borderColor: '#fff',
                },
                emphasis: {
                    label: {
                        show: true,
                        color: '#555555',
                    },
                    itemStyle: {
                        areaColor: '#e6e8ea',
                        borderColor: '#fff',
                    },
                },
            },
        ],
        visualMap: {
            min: 58,
            max: 6300,
            calculable: true,
            splitNumber: 5,
            show: true,
            inRange: {
                color: ['#0099cc', '#0099ff'],
            },
            type: 'continuous',
            text: null,
        },
        series: {
            map: 'china',
            type: 'heatmap',
            coordinateSystem: 'geo',
            encode: {
                lng: 1,
                lat: 2,
                x: 0,
                y: 3,
            },
            pointSize: 20,
            blurSize: 20,
        },
        dataset: [
            {
                dimensions: ['province', 'lng', 'lat', 'l_tmp'],
                source: [
                    ['province', 'lng', 'lat', 'l_tmp'],
                    ['浙江', 120.153576, 30.287459, 2703],
                    ['西藏', 91.132212, 29.660361, 320],
                    ['北京', 116.405285, 39.904989, 167],
                    ['广西', 108.320004, 22.82402, 4249],
                    ['广东', 113.280637, 23.125178, 6036],
                    ['山西', 112.549248, 37.857014, 1714],
                    ['台湾', 121.509062, 25.044332, 898],
                    ['黑龙江', 126.642464, 45.756967, 501],
                    ['福建', 119.306239, 26.075302, 3033],
                    ['香港', 114.173355, 22.320048, 293],
                    ['河南', 113.665412, 34.757975, 3231],
                    ['青海', 101.778916, 36.623178, 58],
                    ['内蒙古', 111.670801, 40.818311, 594],
                    ['河北', 114.502461, 38.045474, 1757],
                    ['海南', 110.33119, 20.031971, 6204],
                    ['重庆', 106.504962, 29.533155, 212],
                    ['安徽', 117.283042, 31.86119, 3464],
                    ['新疆', 87.617733, 43.792818, 1632],
                    ['澳门', 113.54909, 22.198951, 258],
                    ['湖南', 112.982279, 28.19409, 3044],
                    ['吉林', 125.3245, 43.886841, 507],
                    ['四川', 104.065735, 30.659462, 4338],
                    ['宁夏', 106.278179, 38.46637, 550],
                    ['天津', 117.190182, 39.125596, 280],
                    ['江西', 115.892151, 28.676493, 3110],
                    ['贵州', 106.713478, 26.578343, 955],
                    ['辽宁', 123.429096, 41.796767, 1680],
                    ['江苏', 118.767413, 32.041544, 2834],
                    ['陕西', 108.948024, 34.263161, 1785],
                    ['上海', 121.472644, 31.231706, 220],
                    ['湖北', 114.298572, 30.584355, 2911],
                    ['山东', 117.000923, 36.675807, 3234],
                    ['甘肃', 103.823557, 36.058039, 1444],
                    ['云南', 102.712251, 25.040609, 3352],
                ],
            },
        ],
    });
});
