option = {
    title: {
        text: '2018-2019年10月全国猪产品价格走势图',
        left: '38%',
        right: '15%',
        bottom: '90%'
    },
    tooltip : {
        trigger: 'axis'
    },
    legend: {
        data:['仔猪销售价格（20公斤）','母猪销售价格（50公斤）','鲜猪肉超市价格（带皮后腿肉）','鲜猪肉集市价格（带皮后腿肉）'],
        left: '25%',
        right: '15%',
        bottom: '80%'
    },
    toolbox: {
        feature: {
            saveAsImage: {}
        }
    },
    grid: {
        left: '3%',
        right: '4%',
        bottom: '3%',
        containLabel: true
    },
    xAxis : [
        {
            type : 'category',
            boundaryGap : false,
            data : ['2018年1月','2018年2月','2018年3月','2018年4月','2018年5月','2018年6月','2018年7月','2018年8月','2018年9月','2018年10月','2018年11月','2018年12月','2019年1月','2019年2月','2019年3月','2019年4月','2019年5月','2019年6月','2019年7月','2019年8月','2019年9月','2019年10月']
        }
    ],
    yAxis : [
        {
            type : 'value'
        }
    ],
    series : [
        {
            name:'仔猪销售价格（20公斤）',
            type:'line',
            stack: '价格',
            label: {
                normal: {
                    show: true,
                    position: 'top'
                }
            },
            areaStyle: {normal: {}},
            data:[28.23, 27.62, 25.67, 24, 22.6, 22.75,23.01,24.4,24.92,24.38,23.5,22.87,22.13,23.71,28.63,33.37,34.01,35.44,38.29,43.1,51.14,62.08]
        },
        {
            name:'母猪销售价格（50公斤）',
            type:'line',
            stack: '价格',
            label: {
                normal: {
                    show: true,
                    position: 'top'
                }
            },
            areaStyle: {normal: {}},
            data:[33.75,33.7,32.53,31.3,30.27,29.99,29.9,29.89,30.24,30.16,29.92,29.36,28.77,28.84,30.22,31.99, , , , , , ]
        },
        {
            name:'鲜猪肉超市价格（带皮后腿肉）',
            type:'line',
            stack: '价格',
            label: {
                normal: {
                    show: true,
                    position: 'top'
                }
            },
            areaStyle: {normal: {}},
            data:[25.24, 25.17, 23.71, 21.99,20.75,20.78,21.32,39.27,41.37,41.14,41.76,41.75,41.69,41.44,41.91,42.45,42.23,42.85,44.6,49.52,57.87,64.09]
        },
        {
            name:'鲜猪肉集市价格（带皮后腿肉）',
            type:'line',
            stack: '价格',
            label: {
                normal: {
                    show: true,
                    position: 'top'
                }
            },
            areaStyle: {normal: {}},
            data:[26.1,26.25,24.88,23.11,22.08,22.04,22.4,32.76,33.07,37.45,38.78,38.42,38.4,38.82,38.45,38.94,39.09,39.99,41.97,47.34,54.76,61.79]
        },
    ]
};
