var uploadedDataURL = 'https://cdn.jsdelivr.net/gh/SHJ33/EchartsMapJson@master/json/province/hebei.json';

var dataV = [
    { name: '河北医科大学第二医院', value: [114.488673,38.064447,1],},
    { name: '河北省人民医院', value: [114.472023,38.064649,1],},
    { name: '石家庄现代中医血液肾病医院', value: [114.57895,38.061112,1],},
    { name: '河北仁德口腔医院', value: [114.568026,38.049089,1],},
    { name: '河北中医肝病医院', value: [114.597027,38.16367,1],},
    { name: '石家庄市中医院', value: [114.478806,38.050003,1],},
    { name: '石家庄明瀚医院', value: [114.501995,38.097416,1],},
    { name: '唐山市工人医院', value: [118.192642,39.635097,1],},
    { name: '石家庄爱尔眼科医院', value: [114.483294,38.032093,1],},
    { name: '石家庄糖尿病医院', value: [114.688743,38.040155,1],},
    { name: '圣禄嘉妇产医院', value: [114.46097,38.000081,1],},
    { name: '石家庄爱眼医院', value: [114.488695,38.049382,1],},
    { name: '石家庄市桥西区口腔医院', value: [114.48335,38.046753,1],},
    { name: '石家庄霍文发中医骨伤医院', value: [114.485041,38.031863,1],},
    { name: '石家庄市第八医院', value: [114.42603,38.056994,1],},
    { name: '石家庄和协口腔医院', value: [114.452034,38.041157,1],},
    { name: '石家庄庭瑞中医精神康复医院', value: [114.391406,38.067751,1],},
    { name: '石家庄中冀康复医院', value: [114.483104,38.024075,1],},
    { name: '河北省优抚医院', value: [114.468618,38.056507,1],},
    { name: '石家庄市第二医院', value: [114.47697,38.052536,1],},
    { name: '石家庄真仁中医钩活术总医院', value: [114.484462,38.104441,1],},
    { name: '石家庄市新华区杜北乡卫生院', value: [114.44429,38.132608,1],},
    { name: '石家庄市新华区赵陵铺镇卫生院', value: [114.489951,38.101809,1],},
    { name: '石家庄市新华区大郭镇卫生院', value: [114.41203,38.085278,1],},
    { name: '河北省生殖医院', value: [114.4693,38.085656,1],},
    { name: '冀中能源井陉矿业集团有限公司总医院', value: [114.073297,38.070468,1],},
    { name: '衡水市人民医院', value: [115.699925,37.737768,1],},
    { name: '石家庄市井陉矿区医院', value: [114.073297,38.070468,1],},
    { name: '石家庄眼科医院', value: [114.613896,38.054964,1],},
    { name: '石家庄港大妇产医院', value: [114.540162,38.038098,1],},
    { name: '石家庄长城中西医结合医院', value: [114.60986,38.050595,1],},
    { name: '石家庄平安医院', value: [114.509597,37.997689,1],},
    { name: '河北省老年病医院', value: [114.524673,38.029889,1],},
    { name: '河北工程大学附属医院', value: [114.507673,36.625206,1],},
    { name: '石家庄金冠中医骨病医院', value: [114.654767,38.022978,1],},
    { name: '河北友爱医院', value: [114.561796,38.035462,1],},
    { name: '河北省眼科医院', value: [114.531981,37.09908,1],},
    { name: '石家庄京冀康复医院', value: [114.540185,38.039108,1],},
    { name: '石家庄市藁城中西医结合医院', value: [114.832498,38.02584,1],},
    { name: '京东誉美中西医结合肾病医院', value: [116.816923,39.966512,1],},
    { name: '开滦总医院', value: [118.205552,39.631827,1],},
    { name: '石家庄市栾城人民医院', value: [114.65902,37.89258,1],},
    { name: '石家庄市栾城区精神病医院', value: [114.64785,37.896854,1],},
    { name: '井陉县中医院', value: [114.146978,38.037621,1],},
    { name: '正定县妇幼保健计划生育服务中心', value: [114.562055,38.150715,1],},
    { name: '河北省儿童医院', value: [114.554158,38.040675,1],},
    { name: '赞皇县中医医院', value: [114.384839,37.66647,1],},
    { name: '无极血康中医医院', value: [114.956807,38.246318,1],},
    { name: '无极人和医院', value: [114.990582,38.17356,1],},
    { name: '河北医科大学第四医院', value: [114.51556,38.05574,1],},
    { name: '平山县人民医院', value: [114.182666,38.26858,1],},
    { name: '河北省沧州中西医结合医院', value: [116.842122,38.299282,1],},
    { name: '保定市第二医院', value: [115.46595,38.878897,1],},
    { name: '河北省胸科医院', value: [114.524818,38.095093,1],},
    { name: '唐山南湖医院', value: [118.186208,39.625599,1],},
    { name: '晋州市人民医院', value: [115.076403,38.038543,1],},
    { name: '保定市第一中医院', value: [115.496581,38.864002,1],},
    { name: '唐山市工人医院集团康复医院', value: [118.195006,39.642679,1],},
    { name: '河北省民政总医院', value: [114.481684,37.089854,1],},
    { name: '开滦（集团）有限责任公司唐家庄医院', value: [118.477571,39.748195,1],},
    { name: '唐山市丰南区医院', value: [118.101312,39.589617,1],},
    { name: '唐山市妇幼保健院', value: [118.147545,39.593057,1],},
    { name: '唐山市丰润区中医医院', value: [118.121383,39.833995,1],},
    { name: '河北中西医结合儿童医院', value: [114.476786,38.037947,1],},
    { name: '河北医科大学第一医院', value: [114.559384,38.022797,1],},
    { name: '承德市中心医院', value: [117.939165,40.988108,1],},
    { name: '滦南县医院', value: [118.704529,39.513904,1],},
    { name: '乐亭县医院', value: [118.911714,39.432975,1],},
    { name: '秦皇岛市中医医院', value: [119.561808,39.93748,1],},
    { name: '保定市妇幼保健院', value: [115.511264,38.922928,1],},
    { name: '河北生殖妇产医院', value: [114.466767,38.026065,1],},
    { name: '冀中能源邢台矿业集团有限责任公司总医院', value: [114.473891,37.071648,1],},
    { name: '中国科学院大学附属华北医院', value: [116.104676,38.694252,1],},
    { name: '遵化市第二医院', value: [117.974691,40.205119,1],},
    { name: '秦皇岛市第三医院', value: [119.622723,39.959092,1],},
    { name: '河北医科大学口腔医院', value: [114.542765,38.049257,1],},
    { name: '滦州市中医医院', value: [118.700222,39.729718,1],},
    { name: '秦皇岛军工医院', value: [119.587727,39.961482,1],},
    { name: '广阳区妇幼保健院', value: [116.702031,39.533407,1],},
    { name: '秦皇岛市工人医院', value: [119.772664,40.0026,1],},
    { name: '河北燕达陆道培医院', value: [116.799644,39.942444,1],},
    { name: '邯郸市中心医院', value: [114.54117,36.627256,1],},
    { name: '邯郸市第一医院', value: [114.497261,36.625659,1],},
    { name: '廊坊市人民医院', value: [116.716713,39.52299,1],},
    { name: '邯郸市华安医院', value: [114.467931,36.615281,1],},
    { name: '邯郸市妇幼保健院', value: [114.511819,36.606599,1],},
    { name: '邯郸市第二医院', value: [114.491925,36.602204,1],},
    { name: '冀中能源峰峰集团有限公司总医院', value: [114.213401,36.425346,1],},
    { name: '邯郸市中医院', value: [114.505989,36.60819,1],},
    { name: '邯郸市永年区妇幼保健院', value: [114.501541,36.774684,1],},
    { name: '唐山市协和医院', value: [118.155639,39.630869,1],},
    { name: '临漳县妇幼保健院', value: [114.616114,36.351698,1],},
    { name: '石家庄市第一医院', value: [114.53335,38.045812,1],},
    { name: '河北北方学院附属第一医院', value: [114.896406,40.833387,1],},
    { name: '河北燕达医院', value: [116.799644,39.942444,1],},
    { name: '邢台市人民医院', value: [114.506412,37.075648,1],},
    { name: '滦州市人民医院', value: [118.699382,39.745547,1],},
    { name: '魏县妇幼保健院', value: [114.936052,36.348321,1],},
    { name: '武安市妇幼保健院', value: [114.209728,36.698133,1],},
    { name: '保定市第一医院', value: [115.494938,38.871926,1],},
    { name: '邢台医学高等专科学校第二附属医院', value: [114.46857,37.097319,1],},
    { name: '三河市妇幼保健院', value: [117.084282,39.991206,1],},
    { name: '廊坊市第四人民医院', value: [116.408228,39.122967,1],},
    { name: '邢台市中医院', value: [114.579579,37.069639,1],},
    { name: '临城县人民医院', value: [114.549571,37.44464,1],},
    { name: '柏乡县中心医院', value: [114.689629,37.500386,1],},
    { name: '涿州市医院', value: [115.982765,39.491981,1],},
    { name: '沧州市人民医院', value: [116.870334,38.321578,1],},
    { name: '唐山中都白癜风医院', value: [118.128386,39.628798,1],},
    { name: '河北省中医院', value: [114.544015,38.050047,1],},
    { name: '张家口市第一医院', value: [114.879764,40.832746,1],},
    { name: '邢台市第九医院', value: [115.057358,37.22648,1],},
    { name: '河北大学附属医院', value: [115.52166,38.860056,1],},
    { name: '清河县中心医院', value: [115.683412,37.069386,1],},
    { name: '临西县中医院', value: [115.499626,36.877172,1],},
    { name: '石家庄市第三医院', value: [114.540537,38.045836,1],},
    { name: '秦皇岛市第一医院', value: [119.607654,39.944451,1],},
    { name: '邢台经济开发区医院', value: [114.582405,37.044118,1],},
    { name: '沙河市人民医院', value: [114.523929,36.862158,1],},
    { name: '保定新视眼科医院', value: [115.478979,38.895965,1],},
    { name: '邢台市第三医院', value: [114.469953,37.071043,1],},
    { name: '保定市优抚医院', value: [115.502239,38.868989,1],},
    { name: '河北医科大学第三医院', value: [114.474636,38.048597,1],},
    { name: '保定心脑血管病医院', value: [115.529692,38.853404,1],},
    { name: '保定市儿童医院', value: [115.512436,38.928101,1],},
    { name: '承德医学院附属医院', value: [117.941701,40.975976,1],},
    { name: '保定第七医院', value: [115.354843,38.945491,1],},
    { name: '保定市第二中心医院', value: [116.000499,39.492565,1],},
    { name: '保定市清苑区人民医院', value: [115.49426,38.769935,1],},
    { name: '保定市徐水区妇幼保健院', value: [115.63559,39.030617,1],},
    { name: '保定大午医院', value: [115.615767,39.080041,1],},
    { name: '唐山市中医医院', value: [118.19298,39.633366,1],},
    { name: '石家庄市第五医院', value: [114.515649,38.010552,1],},
    { name: '沧州市中心医院', value: [116.85278,38.317938,1],},
    { name: '容城县中医医院', value: [115.876333,39.047782,1],},
    { name: '唐山市人民医院', value: [118.218768,39.625741,1],},
    { name: '石家庄市妇产医院', value: [114.519893,38.048388,1],},
    { name: '华北理工大学附属医院', value: [118.184743,39.646611,1],},
    { name: '易县医院', value: [115.512643,39.357268,1],},
    { name: '顺平县医院', value: [115.14198,38.858084,1],},
    { name: '唐县人民医院', value: [114.985494,38.765886,1],},
    { name: '容城县妇幼保健院', value: [115.885134,39.067258,1],},
    { name: '涿州市妇幼医院', value: [115.973098,39.487281,1],},
    { name: '河北省第七人民医院', value: [114.946719,38.549638,1],},
    { name: '安国市妇幼保健院', value: [115.331282,38.428146,1],},
    { name: '河北省妇幼保健中心', value: [115.885134,39.067258,1],},
    { name: '秦皇岛市妇幼保健院', value: [119.59364,39.968075,1],},
    { name: '河北省尚义县医院', value: [113.978467,41.08296,1],},
    { name: '衡水市中医医院', value: [115.681425,37.736548,1],},
    { name: '蔚县人民医院', value: [114.604661,39.851066,1],},
    { name: '怀来同济医院', value: [115.540001,40.409202,1],},
    { name: '涿鹿县医院', value: [115.211104,40.382414,1],},
    { name: '河北省赤城县人民医院', value: [115.865427,40.886448,1],},
    { name: '廊坊市中医医院', value: [116.703559,39.541984,1],},
    { name: '邯郸市眼科医院', value: [114.490191,36.608243,1],},
    { name: '定州市人民医院', value: [114.99255,38.518705,1],},
    { name: '唐山市第二医院', value: [118.185868,39.655632,1],},
    { name: '兴隆县中医医院', value: [117.511339,40.424461,1],},
    { name: '丰宁满族自治县医院', value: [116.629407,41.24894,1],},
    { name: '围场满族蒙古族自治县中医院', value: [117.765672,41.951406,1],},
    { name: '承德围场大都医院', value: [117.771549,41.927888,1],},
    { name: '保定市第一中心医院', value: [115.518738,38.879407,1],},
    { name: '秦皇岛市第二医院', value: [119.176221,39.717547,1],},
    { name: '霸州市妇幼保健院', value: [116.404275,39.119672,1],},
    { name: '河北北方学院附属第二医院', value: [115.070372,40.622338,1],},
    { name: '沧州市传染病医院', value: [116.830024,38.321331,1],},
    { name: '献县中医医院', value: [116.118452,38.188224,1],},
    { name: '泊头市医院', value: [116.561275,38.08852,1],},
    { name: '泊头市第二医院', value: [116.288768,38.031004,1],},
    { name: '廊坊爱德堡医院', value: [116.690956,39.555499,1],},
    { name: '河北中石油中心医院', value: [116.729883,39.52581,1],},
    { name: '三河市燕郊二三医院', value: [116.829593,39.95992,1],},
    { name: '三河市燕郊人民医院', value: [116.81193,39.949895,1],},
    { name: '唐山中心医院', value: [118.144942,39.675146,1],},
    { name: '衡水市第二人民医院', value: [115.722736,37.725825,1],},
    { name: '衡水市妇幼保健院', value: [115.646519,37.727038,1],},
    { name: '辛集和平眼科医院', value: [115.243684,37.923757,1],},
    { name: '衡水市第六人民医院', value: [115.58552,37.553855,1],},
    { name: '武强县医院(武强县急救站)', value: [115.962616,38.047671,1],},
    { name: '唐山曹妃甸唐海中医医院', value: [118.466151,39.281658,1],},
]

$.get(uploadedDataURL, function (geoJson) {
    echarts.registerMap('hebei', geoJson);
    option = {
        tooltip: {
            trigger: 'item',
            show: true,
            enterable: true,
            textStyle:{
                fontSize:13,
                color: '#fff'
            },
            backgroundColor: 'rgba(0,2,89,0.8)',
            //formatter: '{b}<br />{c}',
            formatter: function (params) {
                var name = params.name;
                var value = params.value[2];
                var text = `${name}`;
                return text;
            },
        },
        geo3D: {
            map: 'hebei',
            show: true,
            //roam: true,
            zlevel: -10,
            boxWidth: 120,
            boxHeight:4.4,//4:没有bar. 30:有bar,bar最高度30，按比例分配高度
            boxDepth: 150,//地图倾斜度
            regionHeight:4,
            environment: new echarts.graphic.LinearGradient(0, 0, 0, 1, [{
                          offset: 0, color: '#00aaff' // 天空颜色
                        }, {
                          offset: 0.7, color: '#FFF' // 地面颜色
                        }, {
                          offset: 1, color: '#FFF' // 地面颜色
                        }], false),
            label: { // 标签的相关设置
                show: false,
            },
    
            itemStyle: {
                areaColor: '#6554C0',
                opacity: 1,
                borderWidth: 0.5,
                borderColor: '#A299DA'
            },
            emphasis: {
                label:{
                    show:false,
                },
                itemStyle: {
                    areaColor: '#61A4E4',
                    borderColor:'#88BAEA',
                    borderWidth:2,
                }
            },
            light: {
                main: {
                    intensity:1,
                    shadow: true,
                    shadowQuality: 'ultra',
                },
    
            },
            
            shading:'realistic',
            viewControl: {
                projection: 'perspective',//'orthographic',
                autoRotate: false,
                damping: 0,
                rotateSensitivity: 2,//旋转操作的灵敏度
                rotateMouseButton: 'left', //旋转操作使用的鼠标按键
                zoomSensitivity:2, //缩放操作的灵敏度
                panSensitivity:2, //平移操作的灵敏度
                panMouseButton: 'right', //平移操作使用的鼠标按键
                
                distance: 150, //默认视角距离主体的距离
                minDistance: 10,
                maxDistance: 300,
                minAlpha:30,
                maxAlpha:100,
                minBeta:-25,
                maxBeta:85,
                center:[-20,-25,0],
                animation: true,
                animationDurationUpdate: 1000,
                animationEasingUpdate: 'cubicInOut'
            },
        },
        
        series: [
           {type: 'scatter3D',
            coordinateSystem: 'geo3D',
            //zlevel: -10,
            symbol: 'circle',
            symbolSize: 6,
            data: dataV,
            itemStyle: { //坐标点颜色
                normal: {
                    show: true,
                    color: '#ffd730',
                    shadowBlur: 20,
                    shadowColor: '#fff'
                },
                emphasis: {
                    areaColor: '#f00'
                }
            },
            emphasis:{
                label:{
                    show:false,
                },
            },
        }]
    }
myChart.setOption(option);
});