//数据来源：国家统计局，本数据不包含香港，澳门，台湾地区

var uploadedDataURL = "/asset/get/s/data-1528971808162-BkOXf61WX.json";

var geoCoordMap = {
         '北京':[116.40 , 40.40 ],
         '天津':[117.04 , 39.52],
         '河北':[115.21 , 38.44],
         '山西':[111.95,37.65],
         '内蒙古':[112.17 , 42.81],
         '辽宁':[123.42 , 41.29],
         '吉林':[126.32 , 43.38],
         '黑龙江':[128.34 , 47.05],
         '上海':[121.46 , 31.28],
         '江苏':[120.26 , 32.54],
         '浙江':[120.15 , 29.28],
         '安徽':[117.28 , 31.86],
         '福建':[118.31 , 26.07],
         '江西':[115.89 , 27.97],
         '山东':[118.01 , 36.37],
         '河南':[113.46 , 34.25],
         '湖北':[112.29 , 30.98],
         '湖南':[112.08 , 27.79],
         '广东':[113.98 , 22.82],
         '广西':[108.67 , 23.68],
         '海南':[110.03 , 19.33],
         '重庆':[107.51 , 29.63],
         '四川':[103.36 , 30.65],
         '贵州':[106.91 , 26.67],
         '云南':[101.71 , 24.84],
         '西藏':[89.13 , 30.66],
         '陕西':[108.94 , 34.46],
         '甘肃':[103.82 , 36.05],
         '青海':[97.07 , 35.62],
         '宁夏':[106.27 , 36.76],
         '新疆': [86.61 , 40.79],
      }
      
//2000年数据
var d1 = {
        '北京':3161.66,
        '天津':1701.88,
        '河北':5043.96,
        '山西':1845.72,
        '内蒙古':1539.12,
        '辽宁':4669.06,
        '吉林':1951.51,
        '黑龙江':3151.4,
        '上海':4771.17,
        '江苏':8553.69,
        '浙江':6141.03,
        '安徽':2902.09,
        '福建':3764.54,
        '江西':2003.07,
        '山东':8337.47,
        '河南':5052.99,
        '湖北':3545.39,
        '湖南':3551.49,
        '广东':10741.25,
        '广西':2080.04,
        '海南':526.82,
        '重庆':1791,
        '四川':3928.2,
        '贵州':1029.92,
        '云南':2011.19,
        '西藏':117.8,
        '陕西':1804,
        '甘肃':1052.88,
        '青海':263.68,
        '宁夏':295.02,
        '新疆':1363.56,
};
//2001年数据
var d2 = {
        '北京':3707.96,
        '天津':1919.09,
        '河北':5516.76,
        '山西':2029.53,
        '内蒙古':1713.81,
        '辽宁':5033.08,
        '吉林':2120.35,
        '黑龙江':3390.1,
        '上海':5210.12,
        '江苏':9456.84,
        '浙江':6898.34,
        '安徽':3246.71,
        '福建':4072.85,
        '江西':2175.68,
        '山东':9195.04,
        '河南':5533.01,
        '湖北':3880.53,
        '湖南':3831.9,
        '广东':12039.25,
        '广西':2279.34,
        '海南':579.17,
        '重庆':1976.86,
        '四川':4293.49,
        '贵州':1133.27,
        '云南':2138.31,
        '西藏':139.16,
        '陕西':2010.62,
        '甘肃':1125.37,
        '青海':300.13,
        '宁夏':337.44,
        '新疆':1491.6,
};
//2002年数据
var d3 = {
        '北京':4315,
        '天津':2150.76,
        '河北':6018.28,
        '山西':2324.8,
        '内蒙古':1940.94,
        '辽宁':5458.22,
        '吉林':2348.54,
        '黑龙江':3637.2,
        '上海':5741.03,
        '江苏':10606.85,
        '浙江':8003.67,
        '安徽':3519.72,
        '福建':4467.55,
        '江西':2450.48,
        '山东':10275.5,
        '河南':6035.48,
        '湖北':4212.82,
        '湖南':4151.54,
        '广东':13502.42,
        '广西':2523.73,
        '海南':642.73,
        '重庆':2232.86,
        '四川':4725.01,
        '贵州':1243.43,
        '云南':2312.82,
        '西藏':162.04,
        '陕西':2253.39,
        '甘肃':1232.03,
        '青海':340.65,
        '宁夏':377.16,
        '新疆':1612.65,
};
//2003年数据
var d4 = {
        '北京':5007.21,
        '天津':2578.03,
        '河北':6921.29,
        '山西':2855.23,
        '内蒙古':2388.38,
        '辽宁':6002.54,
        '吉林':2662.08,
        '黑龙江':4057.4,
        '上海':6694.23,
        '江苏':12442.87,
        '浙江':9705.02,
        '安徽':3923.11,
        '福建':4983.67,
        '江西':2807.41,
        '山东':12078.15,
        '河南':6867.7,
        '湖北':4757.45,
        '湖南':4659.99,
        '广东':15844.64,
        '广西':2821.11,
        '海南':713.96,
        '重庆':2555.72,
        '四川':5333.09,
        '贵州':1426.34,
        '云南':2556.02,
        '西藏':185.09,
        '陕西':2587.72,
        '甘肃':1399.83,
        '青海':390.2,
        '宁夏':445.36,
        '新疆':1886.35,
};
//2004年数据
var d5 = {
        '北京':6033.21,
        '天津':3110.97,
        '河北':8477.63,
        '山西':3571.37,
        '内蒙古':3041.07,
        '辽宁':6672,
        '吉林':3122.01,
        '黑龙江':4750.6,
        '上海':8072.83,
        '江苏':15003.6,
        '浙江':11648.7,
        '安徽':4759.3,
        '福建':5763.35,
        '江西':3456.7,
        '山东':15021.84,
        '河南':8553.79,
        '湖北':5633.24,
        '湖南':5641.94,
        '广东':18864.62,
        '广西':3433.5,
        '海南':819.66,
        '重庆':3034.58,
        '四川':6379.63,
        '贵州':1677.8,
        '云南':3081.91,
        '西藏':220.34,
        '陕西':3175.58,
        '甘肃':1688.49,
        '青海':466.1,
        '宁夏':537.11,
        '新疆':2209.09,

};
//2005年数据
var d6 = {
        '北京':6969.52,
        '天津':3905.64,
        '河北':10012.11,
        '山西':4230.53,
        '内蒙古':3905.03,
        '辽宁':8047.26,
        '吉林':3620.27,
        '黑龙江':5513.7,
        '上海':9247.66,
        '江苏':18598.69,
        '浙江':13417.68,
        '安徽':5350.17,
        '福建':6554.69,
        '江西':4056.76,
        '山东':18366.87,
        '河南':10587.42,
        '湖北':6590.19,
        '湖南':6596.1,
        '广东':22557.37,
        '广西':3984.1,
        '海南':918.75,
        '重庆':3467.72,
        '四川':7385.1,
        '贵州':2005.42,
        '云南':3462.73,
        '西藏':248.8,
        '陕西':3933.72,
        '甘肃':1933.98,
        '青海':543.32,
        '宁夏':612.61,
        '新疆':2604.19,
};
//2006年数据
var d7 = {
        '北京':8117.78,
        '天津':4462.74,
        '河北':11467.6,
        '山西':4878.61,
        '内蒙古':4944.25,
        '辽宁':9304.52,
        '吉林':4275.12,
        '黑龙江':6211.8,
        '上海':10572.24,
        '江苏':21742.05,
        '浙江':15718.47,
        '安徽':6112.5,
        '福建':7583.85,
        '江西':4820.53,
        '山东':21900.19,
        '河南':12362.79,
        '湖北':7617.47,
        '湖南':7688.67,
        '广东':26587.76,
        '广西':4746.16,
        '海南':1065.67,
        '重庆':3907.23,
        '四川':8690.24,
        '贵州':2338.98,
        '云南':3988.14,
        '西藏':290.76,
        '陕西':4743.61,
        '甘肃':2277.35,
        '青海':648.5,
        '宁夏':725.9,
        '新疆':3045.26,
};
//2007年数据
var d8 = {
        '北京':9846.81,
        '天津':5252.76,
        '河北':13607.32,
        '山西':6024.45,
        '内蒙古':6423.18,
        '辽宁':11164.3,
        '吉林':5284.69,
        '黑龙江':7104,
        '上海':12494.01,
        '江苏':26018.48,
        '浙江':18753.73,
        '安徽':7360.92,
        '福建':9248.53,
        '江西':5800.25,
        '山东':25776.91,
        '河南':15012.46,
        '湖北':9333.4,
        '湖南':9439.6,
        '广东':31777.01,
        '广西':5823.41,
        '海南':1254.17,
        '重庆':4676.13,
        '四川':10562.39,
        '贵州':2884.11,
        '云南':4772.52,
        '西藏':341.43,
        '陕西':5757.29,
        '甘肃':2703.98,
        '青海':797.35,
        '宁夏':919.11,
        '新疆':3523.16,
};
//2008年数据
var d9 = {
        '北京':11115,
        '天津':6719.01,
        '河北':16011.97,
        '山西':7315.4,
        '内蒙古':8496.2,
        '辽宁':13668.58,
        '吉林':6426.1,
        '黑龙江':8314.37,
        '上海':14069.86,
        '江苏':30981.98,
        '浙江':21462.69,
        '安徽':8851.66,
        '福建':10823.01,
        '江西':6971.05,
        '山东':30933.28,
        '河南':18018.53,
        '湖北':11328.92,
        '湖南':11555,
        '广东':36796.71,
        '广西':7021,
        '海南':1503.06,
        '重庆':5793.66,
        '四川':12601.23,
        '贵州':3561.56,
        '云南':5692.12,
        '西藏':394.85,
        '陕西':7314.58,
        '甘肃':3166.82,
        '青海':1018.62,
        '宁夏':1203.92,
        '新疆':4183.21, 
};
//2009年数据
var d10 = {
        '北京':12153.03,
        '天津':7521.85,
        '河北':17235.48,
        '山西':7358.31,
        '内蒙古':9740.25,
        '辽宁':15212.49,
        '吉林':7278.75,
        '黑龙江':8587,
        '上海':15046.45,
        '江苏':34457.3,
        '浙江':22990.35,
        '安徽':10062.82,
        '福建':12236.53,
        '江西':7655.18,
        '山东':33896.65,
        '河南':19480.46,
        '湖北':12961.1,
        '湖南':13059.69,
        '广东':39482.56,
        '广西':7759.16,
        '海南':1654.21,
        '重庆':6530.01,
        '四川':14151.28,
        '贵州':3912.68,
        '云南':6169.75,
        '西藏':441.36,
        '陕西':8169.8,
        '甘肃':3387.56,
        '青海':1081.27,
        '宁夏':1353.31,
        '新疆':4277.05,     
};
//2010年数据
var d11 = {
        "北京":14113.58,
         '天津':9224.46,
         '河北':20394.26,
         '山西':9200.86,
         '内蒙古':11672,
         '辽宁':18457.27,
         '吉林':8667.58,
         '黑龙江':10368.6,
         "上海":17165.98,
         "江苏":41425.48,
         "浙江":27722.31,
         "安徽":12359.33,
         "福建":14737.12,
         '江西':9451.26,
         "山东":39169.92,
         "河南":23092.36,
         "湖北":15967.61,
         "湖南":16037.96,
         "广东":46013.06,
         '广西':9569.85,
         '海南':2064.5,
         '重庆':7925.58,
         "四川":17185.48,
         '贵州':4602.16,
         '云南':7224.18,
         '西藏':507.46,
         '陕西':10123.48,
         '甘肃':4120.75,
         '青海':1350.43,
         '宁夏':1689.65,
         '新疆':5437.47,
};
//2011年数据
var d12 = {
        "北京":16251.93,
         '天津':11307.28,
         '河北':24515.76,
         '山西':11237.55,
         '内蒙古':14359.88,
         '辽宁':22226.7,
         '吉林':10568.83,
         '黑龙江':12582,
         "上海":19195.69,
         "江苏":49110.27,
         "浙江":32318.85,
         "安徽":15300.65,
         "福建":17560.18,
         '江西':11702.82,
         "山东":45361.85,
         "河南":26931.03,
         "湖北":19632.26,
         "湖南":19669.56,
         "广东":53210.28,
         '广西':11720.87,
         '海南':2522.66,
         '重庆':10011.37,
         "四川":21026.68,
         '贵州':5701.84,
         '云南':8893.12,
         '西藏':605.83,
         '陕西':12512.3,
         '甘肃':5020.37,
         '青海':1670.44,
         '宁夏':2102.21,
         '新疆':6610.05,
};
//2012年数据
var d13 = {
        "北京":17879.4,
         '天津':12893.88,
         '河北':26575.01,
         '山西':12112.83,
         '内蒙古':15880.58,
         '辽宁':24846.43,
         '吉林':11939.24,
         '黑龙江':13691.58,
         "上海":20181.72,
         "江苏":54058.22,
         "浙江":34665.33,
         "安徽":17212.05,
         "福建":19701.78,
         '江西':12948.88,
         "山东":50013.24,
         "河南":29599.31,
         "湖北":22250.45,
         "湖南":22154.23,
         "广东":57067.92,
         '广西':13035.1,
         '海南':2855.54,
         '重庆':11409.6,
         "四川":23872.8,
         '贵州':6852.2,
         '云南':10309.47,
         '西藏':701.03,
         '陕西':14453.68,
         '甘肃':5650.2,
         '青海':1893.54,
         '宁夏':2341.29,
         '新疆':7505.31,
};
//2013年数据
var d14 = {
        '北京':19800.81,
        '天津':14442.01,
        '河北':28442.95,
        '山西':12665.25,
        '内蒙古':16916.5,
        '辽宁':27213.22,
        '吉林':13046.4,
        '黑龙江':14454.91,
        '上海':21818.15,
        '江苏':59753.37,
        '浙江':37756.59,
        '安徽':19229.34,
        '福建':21868.49,
        '江西':14410.19,
        '山东':55230.32,
        '河南':32191.3,
        '湖北':24791.83,
        '湖南':24621.67,
        '广东':62474.79,
        '广西':14449.9,
        '海南':3177.56,
        '重庆':12783.26,
        '四川':26392.07,
        '贵州':8086.86,
        '云南':11832.31,
        '西藏':815.67,
        '陕西':16205.45,
        '甘肃':6330.69,
        '青海':2122.06,
        '宁夏':2577.57,
        '新疆':8443.84,
};
//2014年数据
var d15 = {
        '北京':21330.83,
        '天津':15726.93,
        '河北':29421.15,
        '山西':12761.49,
        '内蒙古':17770.19,
        '辽宁':28626.58,
        '吉林':13803.14,
        '黑龙江':15039.38,
        '上海':23567.7,
        '江苏':65088.32,
        '浙江':40173.03,
        '安徽':20848.75,
        '福建':24055.76,
        '江西':15714.63,
        '山东':59426.59,
        '河南':34938.24,
        '湖北':27379.22,
        '湖南':27037.32,
        '广东':67809.85,
        '广西':15672.89,
        '海南':3500.72,
        '重庆':14262.6,
        '四川':28536.66,
        '贵州':9266.39,
        '云南':12814.59,
        '西藏':920.83,
        '陕西':17689.94,
        '甘肃':6836.82,
        '青海':2303.32,
        '宁夏':2752.1,
        '新疆':9273.46,
};
//2015年数据
var d16 = {
        '北京':23014.59,
        '天津':16538.19,
        '河北':29806.11,
        '山西':12766.49,
        '内蒙古':17831.51,
        '辽宁':28669.02,
        '吉林':14063.13,
        '黑龙江':15083.67,
        '上海':25123.45,
        '江苏':70116.38,
        '浙江':42886.49,
        '安徽':22005.63,
        '福建':25979.82,
        '江西':16723.78,
        '山东':63002.33,
        '河南':37002.16,
        '湖北':29550.19,
        '湖南':28902.21,
        '广东':72812.55,
        '广西':16803.12,
        '海南':3702.76,
        '重庆':15717.27,
        '四川':30053.1,
        '贵州':10502.56,
        '云南':13619.17,
        '西藏':1026.39,
        '陕西':18021.86,
        '甘肃':6790.32,
        '青海':2417.05,
        '宁夏':2911.77,
        '新疆':9324.8,
};
//2016年数据
var d17 = {
        '北京':25669.13,
        '天津':17885.39,
        '河北':32070.45,
        '山西':13050.41,
        '内蒙古':18128.1,
        '辽宁':22246.9,
        '吉林':14776.8,
        '黑龙江':15386.09,
        '上海':28178.65,
        '江苏':77388.28,
        '浙江':47251.36,
        '安徽':24407.62,
        '福建':28810.58,
        '江西':18499,
        '山东':68024.49,
        '河南':40471.79,
        '湖北':32665.38,
        '湖南':31551.37,
        '广东':80854.91,
        '广西':18317.64,
        '海南':4053.2,
        '重庆':17740.59,
        '四川':32934.54,
        '贵州':11776.73,
        '云南':14788.42,
        '西藏':1151.41,
        '陕西':19399.59,
        '甘肃':7200.37,
        '青海':2572.49,
        '宁夏':3168.59,
        '新疆':9649.7,
};
//2017年数据
var d18 = {
        '北京':28014.94,
        '天津':18549.19,
        '河北':34016.32,
        '山西':15528.42,
        '内蒙古':16096.21,
        '辽宁':23409.24,
        '吉林':14944.53,
        '黑龙江':15902.68,
        '上海':30632.99,
        '江苏':85869.76,
        '浙江':51768.26,
        '安徽':27018,
        '福建':32182.09,
        '江西':20006.31,
        '山东':72634.15,
        '河南':44552.83,
        '湖北':35478.09,
        '湖南':33902.96,
        '广东':89705.23,
        '广西':18523.26,
        '海南':4462.54,
        '重庆':19424.73,
        '四川':36980.22,
        '贵州':13540.83,
        '云南':16376.34,
        '西藏':1310.92,
        '陕西':21898.81,
        '甘肃':7459.9,
        '青海':2624.83,
        '宁夏':3443.56,
        '新疆':10881.96,
};
//2018年数据
var d19 = {
        '北京':33105.97,
        '天津':13362.92,
        '河北':32494.61,
        '山西':15958.13,
        '内蒙古':16140.76,
        '辽宁':23510.54,
        '吉林':11253.81,
        '黑龙江':12846.48,
        '上海':36011.82,
        '江苏':93207.55,
        '浙江':58002.84,
        '安徽':34010.91,
        '福建':38687.77,
        '江西':22716.51,
        '山东':66648.87,
        '河南':49935.9,
        '湖北':42021.95,
        '湖南':36329.68,
        '广东':99945.22,
        '广西':19627.81,
        '海南':4910.69,
        '重庆':21588.8,
        '四川':42902.1,
        '贵州':15353.21,
        '云南':20880.63,
        '西藏':1548.39,
        '陕西':23941.88,
        '甘肃':8104.07,
        '青海':2748,
        '宁夏':3510.21,
        '新疆':12809.39,
};
//2019年数据
var d20 = {
        '北京':35371.28,
        '天津':14104.28,
        '河北':35104.52,
        '山西':17026.68,
        '内蒙古':17212.53,
        '辽宁':24909.45,
        '吉林':11726.82,
        '黑龙江':13612.68,
        '上海':38155.32,
        '江苏':99631.52,
        '浙江':62351.74,
        '安徽':37113.98,
        '福建':42395,
        '江西':24757.5,
        '山东':71067.53,
        '河南':54259.2,
        '湖北':45828.31,
        '湖南':39752.12,
        '广东':107671.07,
        '广西':21237.14,
        '海南':5308.93,
        '重庆':23605.77,
        '四川':46615.82,
        '贵州':16769.34,
        '云南':23223.75,
        '西藏':1697.82,
        '陕西':25793.17,
        '甘肃':8718.3,
        '青海':2965.95,
        '宁夏':3748.48,
        '新疆':13597.11,
};



var colors = [
    ["#1DE9B6", "#fde8cd", "#04B9FF", "#5DBD32", "#FFC809", "#FB95D5", "#BDA29A", "#6E7074", "#E690D1", "#C4CCD3","#1DE9B6","#04B9FF", "#FFC809", "#FB95D5", "#C4CCD3","#1DE9B6","#04B9FF","#FFC809", "#FB95D5"],
    ["#37A2DA", "#fde8cd", "#32C5E9", "#5DBD32", "#FFDB5C", "#FF9F7F", "#FB7293", "#E062AE", "#546570", "#E7BCF3", "#9D96F5", "#8378EA", "#8378EA","#37A2DA", "#fde8cd", "#32C5E9", "#FFDB5C", "#FF9F7F", "#E7BCF3", "#9D96F5", "#8378EA"],
    ["#DD6B66", "#fde8cd", "#E69D87", "#8DC1A9", "#EA7E53", "#EEDD78", "#73A373", "#73B9BC", "#7289AB", "#91CA8C", "#F49F42", "#73A373", "#73B9BC", "#7289AB", "#91CA8C", "#F49F42","#DD6B66", "#E69D87", "#EA7E53", "#EEDD78"],
];
var colorIndex = 2;
$(function() {
    var year = ["2000","2001","2002","2003", "2004", "2005", "2006", "2007", "2008","2009","2010","2011","2012","2013", "2014", "2015", "2016", "2017", "2018","2019"];
    var mapData = [
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        []
    ];

    /*柱子Y名称*/
    var categoryData = [];
    var barData = [];

    for (var key in geoCoordMap) {
        mapData[0].push({
            "year": '2000',
            "name": key,
            "value": d1[key],
        });
        mapData[1].push({
            "year": '2001',
            "name": key,
            "value": d2[key],
        });
        mapData[2].push({
            "year": '2002',
            "name": key,
            "value": d3[key],
        });
        mapData[3].push({
            "year": '2003',
            "name": key,
            "value": d4[key],
        });
        mapData[4].push({
            "year": '2004',
            "name": key,
            "value": d5[key],
        });
        mapData[5].push({
            "year": '2005',
            "name": key,
            "value": d6[key],
        });
        mapData[6].push({
            "year": '2006',
            "name": key,
            "value": d7[key],
        });
        mapData[7].push({
            "year": '2007',
            "name": key,
            "value": d8[key],
        });
        mapData[8].push({
            "year": '2008',
            "name": key,
            "value": d9[key],
        });
        mapData[9].push({
            "year": '2009',
            "name": key,
            "value": d10[key],
        });
        mapData[10].push({
            "year": '2010',
            "name": key,
            "value": d11[key],
        });
        mapData[11].push({
            "year": '2011',
            "name": key,
            "value": d12[key],
        });
        mapData[12].push({
            "year": '2012',
            "name": key,
            "value": d13[key],
        });
        mapData[13].push({
            "year": '2013',
            "name": key,
            "value": d14[key],
        });
        mapData[14].push({
            "year": '2014',
            "name": key,
            "value": d15[key],
        });
        mapData[15].push({
            "year": '2015',
            "name": key,
            "value": d16[key],
        });
        mapData[16].push({
            "year": '2016',
            "name": key,
            "value": d17[key],
        });
        mapData[17].push({
            "year": '2017',
            "name": key,
            "value": d18[key],
        });
        mapData[18].push({
            "year": '2018',
            "name": key,
            "value": d19[key],
        });
        mapData[19].push({
            "year": '2019',
            "name": key,
            "value": d20[key],
        });
    }

    for (var i = 0; i < mapData.length; i++) {
        mapData[i].sort(function sortNumber(a, b) {
            return a.value - b.value
        });
        barData.push([]);
        categoryData.push([]);
        for (var j = 0; j < mapData[i].length; j++) {
            barData[i].push(mapData[i][j].value);
            categoryData[i].push(mapData[i][j].name);
        }
    }

    $.getJSON(uploadedDataURL, function(geoJson) {

        echarts.registerMap('china', geoJson);
        var convertData = function(data) {
            var res = [];
            for (var i = 0; i < data.length; i++) {
                var geoCoord = geoCoordMap[data[i].name];
                if (geoCoord) {
                    res.push({
                        name: data[i].name,
                        value: geoCoord.concat(data[i].value)
                    });
                }
            }
            return res;
        };
        optionXyMap01 = {
            timeline: {
                data: year,
                axisType: 'category',
                autoPlay: true,
                playInterval: 3000,
                left: '5%',
                right: '15%',
                bottom: '1%',
                width: '65%',
                label: {
                    normal: {
                        textStyle: {
                            color: '#ddd'
                        }
                    },
                    emphasis: {
                        textStyle: {
                            color: '#fff'
                        }
                    }
                },
                symbolSize: 10,
                lineStyle: {
                    color: '#555'
                },
                checkpointStyle: {
                    borderColor: '#777',
                    borderWidth: 2
                },
                controlStyle: {
                    showNextBtn: true,
                    showPrevBtn: true,
                    normal: {
                        color: '#666',
                        borderColor: '#666'
                    },
                    emphasis: {
                        color: '#aaa',
                        borderColor: '#aaa'
                    }
                },

            },
            baseOption: {
                animation: true,
                animationDuration: 1000,
                animationEasing: 'cubicInOut',
                animationDurationUpdate: 1000,
                animationEasingUpdate: 'cubicInOut',
                grid: {
                    right: '2%',
                    top: '15%',
                    bottom: '5%',
                    width: '20%'
                },
                tooltip: {
                    trigger: 'axis', // hover触发器
                    axisPointer: { // 坐标轴指示器，坐标轴触发有效
                        type: 'shadow', // 默认为直线，可选为：'line' | 'shadow'
                        shadowStyle: {
                            color: 'rgba(150,150,150,0.1)' //hover颜色
                        }
                    }
                },
                
                geo: {
                    show: true,
                    map: 'china',
                    roam: true,
                    zoom: 0.9,
                    center: [113.83531246, 34.0267395887],
                    label: {
                        emphasis: {
                            show: false
                        }
                    },
                    itemStyle: {
                        normal: {
                            borderColor: 'rgba(147, 235, 248, 1)',
                            borderWidth: 1,
                            areaColor: {
                                type: 'radial',
                                x: 0.5,
                                y: 0.5,
                                r: 0.8,
                                colorStops: [{
                                    offset: 0,
                                    color: 'rgba(147, 235, 248, 0)' // 0% 处的颜色
                                }, {
                                    offset: 1,
                                    color: 'rgba(147, 235, 248, .2)' // 100% 处的颜色
                                }],
                                globalCoord: false // 缺省为 false
                            },
                            shadowColor: 'rgba(128, 217, 248, 1)',
                            shadowOffsetX: -2,
                            shadowOffsetY: 2,
                            shadowBlur: 10
                        },
                        emphasis: {
                            areaColor: '#389BB7',
                            borderWidth: 0
                        }
                    }
                },
            },
            options: []

        };
        for (var n = 0; n < year.length; n++) {
            optionXyMap01.options.push({
                backgroundColor: '#013954',
                title:
                    [{
                            text: '2000~2019年中国各省GDP情况',
                            subtext:'（数据来源：国家统计局）',
                            left: '23%',
                            top: '7%',
                            textStyle: {
                                color: '#fff',
                                fontSize: 20
                            }
                        },
                        {
                            id: 'statistic',
                            text: year[n] + "数据统计情况",
                            left: '75%',
                            top: '8%',
                            textStyle: {
                                color: '#fff',
                                fontSize: 15
                            }
                            
                        },
                        {
                            text: '（单位：亿元）',
                            left: '93%',
                            top: '9%',
                            textStyle: {
                                color: '#fff',
                                fontSize: 7
                            }
                            
                        }
                    ],
                xAxis: {
                    type: 'value',
                    scale: true,
                    position: 'top',
                    min: 0,
                    max:110000,
                    boundaryGap: false,
                    splitNumber:4,
                    splitLine: {
                        show: false
                    },
                    axisLine: {
                        show: false
                    },
                    axisTick: {
                        show: false
                    },
                    axisLabel: {
                        margin: 2,
                        textStyle: {
                            color: '#aaa'
                        }
              
                    },
                },
                yAxis: {
                    type: 'category',
                    nameGap: 16,
                    axisLine: {
                        show: true,
                        lineStyle: {
                            color: '#ddd'
                        }
                    },
                    axisTick: {
                        show: false,
                        lineStyle: {
                            color: '#ddd'
                        }
                    },
                    axisLabel: {
                        interval: 0,
                        textStyle: {
                            color: '#ddd'
                        }
                    },
                    data: categoryData[n]
                },

                series: [
                    //地图
                    {
                        type: 'map',
                        map: 'china',
                        geoIndex: 0,
                        aspectScale: 0.75, //长宽比
                        showLegendSymbol: false, // 存在legend时显示
                        label: {
                            normal: {
                                show: false
                            },
                            emphasis: {
                                show: false,
                                textStyle: {
                                    color: '#fff'
                                }
                            }
                        },
                        roam: true,
                        itemStyle: {
                            normal: {
                                areaColor: '#031525',
                                borderColor: '#FFFFFF',
                            },
                            emphasis: {
                                areaColor: '#2B91B7'
                            }
                        },
                        animation: false,
                        data: mapData
                    },
                    //地图中闪烁的点
                    {
                        //  name: 'Top 5',
                        type: 'effectScatter',
                        coordinateSystem: 'geo',
                        data: convertData(mapData[n].sort(function(a, b) {
                            return b.value - a.value;
                        }).slice(0, 35)),
                        symbolSize: function(val) {
                            return val[2] / 6000;
                        },
                        showEffectOn: 'render',
                        rippleEffect: {
                            brushType: 'stroke'
                        },
                        hoverAnimation: true,
                        label: {
                            normal: {
                                formatter: '{b}',
                                position: 'right',
                                show: true
                            }
                        },
                        itemStyle: {
                            normal: {
                                color: colors[colorIndex][n],
                                shadowBlur: 10,
                                shadowColor: colors[colorIndex][n]
                            }
                        },
                        zlevel: 1
                    },
                    //柱状图
                    {
                        zlevel: 1.5,
                        type: 'bar',
                        barMaxWidth: 10,
                        symbol: 'none',
                        itemStyle: {
                            normal: {
                                color: colors[colorIndex][n]
                            }
                        },
                        data: barData[n]
                    }
                ]
            })
        }
        myChart.setOption(optionXyMap01);
    });
});

