/**
 * 参考资料：
 * 1、地铁线路图 » 全球世界国际地铁线路图_分类目录汇总：https://www.dir126.com/p/53
 * 2、中国地铁_百度百科：https://baike.baidu.com/item/%E4%B8%AD%E5%9B%BD%E5%9C%B0%E9%93%81/3465393
 * PS：仅根据参考资料总结，无法保证信息是否正确。
 */
var data = [{
    name: '北京',
    value: 100
}, {
    name: '上海',
    value: 100
}, {
    name: '广州',
    value: 100
}, {
    name: '深圳',
    value: 100
}, {
    name: '重庆',
    value: 100
}, {
    name: '天津',
    value: 100
}, {
    name: '石家庄',
    value: 100
}, {
    name: '南京',
    value: 100
}, {
    name: '成都',
    value: 100
}, {
    name: '沈阳',
    value: 100
}, {
    name: '杭州',
    value: 100
}, {
    name: '武汉',
    value: 100
}, {
    name: '长沙',
    value: 100
}, {
    name: '苏州',
    value: 100
}, {
    name: '大连',
    value: 100
}, {
    name: '长春',
    value: 100
}, {
    name: '西安',
    value: 100
}, {
    name: '昆明',
    value: 100
}, {
    name: '佛山',
    value: 100
}, {
    name: '哈尔滨',
    value: 100
}, {
    name: '郑州',
    value: 100
}, {
    name: '宁波',
    value: 100
}, {
    name: '无锡',
    value: 100
}, {
    name: '青岛',
    value: 100
}, {
    name: '南昌',
    value: 100
}, {
    name: '福州',
    value: 100
}, {
    name: '东莞',
    value: 100
}, {
    name: '南宁',
    value: 100
}, {
    name: '合肥',
    value: 100
}, {
    name: '厦门',
    value: 100
}, {
    name: '乌鲁木齐',
    value: 100
}, {
    name: '温州',
    value: 100
}, {
    name: '济南',
    value: 100
}, {
    name: '兰州',
    value: 100
}, {
    name: '呼和浩特',
    value: 100
}, {
    name: '徐州',
    value: 100
}, {
    name: '贵阳',
    value: 100
}, {
    name: '常州',
    value: 100
}, {
    name: '香港特别行政区',
    value: 100
}, {
    name: '澳门特别行政区',
    value: 100
}, {
    name: '台北',
    value: 100
}, {
    name: '高雄',
    value: 100
}, {
    name: '桃园',
    value: 100
}, {
    name: '伦敦',
    value: 100
}, {
    name: '墨尔本',
    value: 100
}, {
    name: '新加坡',
    value: 100
}, {
    name: '曼谷',
    value: 100
}, {
    name: '名古屋',
    value: 100
}, {
    name: '雅典',
    value: 100
}, {
    name: '纽约',
    value: 100
}, {
    name: '圣保罗',
    value: 100
}, {
    name: '开罗',
    value: 100
}, {
    name: '阿尔及尔',
    value: 100
}, {
    name: '横滨',
    value: 100
}, {
    name: '京都',
    value: 100
}, {
    name: '大阪',
    value: 100
}, {
    name: '东京',
    value: 100
}, {
    name: '釜山',
    value: 100
}, {
    name: '大邱',
    value: 100
}, {
    name: '大田',
    value: 100
}, {
    name: '光州',
    value: 100
}, {
    name: '首尔',
    value: 100
}, {
    name: '巴黎',
    value: 100
}, {
    name: '里约热内卢',
    value: 100
}, {
    name: '巴西利亚',
    value: 100
}, {
    name: '莫斯科',
    value: 100
}, {
    name: '马德里',
    value: 100
}, {
    name: '基辅',
    value: 100
}, {
    name: '法兰克福',
    value: 100
}, {
    name: '柏林',
    value: 100
}, {
    name: '巴塞罗那',
    value: 100
}, {
    name: '明斯克',
    value: 100
}, {
    name: '巴伦西亚',
    value: 100
}, {
    name: '里斯本',
    value: 100
}, {
    name: '汉诺威',
    value: 100
}, {
    name: '汉堡',
    value: 100
}, {
    name: '哥本哈根',
    value: 100
}, {
    name: '慕尼黑',
    value: 100
}, {
    name: '蒙特利尔',
    value: 100
}, {
    name: '维也纳',
    value: 100
}, {
    name: '斯德哥尔摩',
    value: 100
}, {
    name: '罗马',
    value: 100
}, {
    name: '鹿特丹',
    value: 100
}, {
    name: '安卡拉',
    value: 100
}, {
    name: '伊斯坦布尔',
    value: 100
}, {
    name: '布加勒斯特',
    value: 100
}, {
    name: '索菲亚',
    value: 100
}, {
    name: '华沙',
    value: 100
}, {
    name: '布达佩斯',
    value: 100
}, {
    name: '布拉格',
    value: 100
}, {
    name: '赫尔辛基',
    value: 100
}, {
    name: '奥斯陆',
    value: 100
}, {
    name: '布鲁塞尔',
    value: 100
}, {
    name: '孟买',
    value: 100
}, {
    name: '札幌',
    value: 100
}, {
    name: '神户',
    value: 100
}, {
    name: '福冈',
    value: 100
}, {
    name: '仙台',
    value: 100
}, {
    name: '仁川',
    value: 100
}, {
    name: '平壤',
    value: 100
}, {
    name: '吉隆坡',
    value: 100
}, {
    name: '马尼拉',
    value: 100
}, {
    name: '加尔各答', // 
    value: 100
}, {
    name: '古尔冈',
    value: 100
}, {
    name: '斋普尔',
    value: 100
}, {
    name: '金奈',
    value: 100
}, {
    name: '班加罗尔',
    value: 100
}, {
    name: '新德里',
    value: 100
}, {
    name: '阿拉木图',
    value: 100
}, {
    name: '塔什干',
    value: 100
}, {
    name: '埃里温',
    value: 100
}, {
    name: '巴库',
    value: 100
}, {
    name: '第比利斯',
    value: 100
}, {
    name: '大不里士',
    value: 100
}, {
    name: '设拉子',
    value: 100
}, {
    name: '马什哈德',
    value: 100
}, {
    name: '德黑兰',
    value: 100
}, {
    name: '伊斯法罕',
    value: 100
}, {
    name: '伊兹密尔',
    value: 100
}, {
    name: '布尔萨',
    value: 100
}, {
    name: '阿达纳',
    value: 100
}, {
    name: '迪拜',
    value: 100
}, {
    name: '海法',
    value: 100
}, {
    name: '约翰内斯堡',
    value: 100
}, {
    name: '悉尼',
    value: 100
}, {
    name: '都灵',
    value: 100
}, {
    name: '那不勒斯',
    value: 100
}, {
    name: '米兰',
    value: 100
}, {
    name: '热那亚',
    value: 100
}, {
    name: '卡塔尼亚',
    value: 100
}, {
    name: '布雷西亚',
    value: 100
}, {
    name: '塞维利亚',
    value: 100
}, {
    name: '帕尔马',
    value: 100
}, {
    name: '毕尔巴鄂',
    value: 100
}, {
    name: '洛桑',
    value: 100
}, {
    name: '图卢兹',
    value: 100
}, {
    name: '雷恩',
    value: 100
}, {
    name: '里昂',
    value: 100
}, {
    name: '里尔',
    value: 100
}, {
    name: '纽伦堡',
    value: 100
}, {
    name: '杜塞尔多夫',
    value: 100
}, {
    name: '科隆',
    value: 100
}, {
    name: '斯图加特',
    value: 100
}, {
    name: '伍珀塔尔',
    value: 100
}, {
    name: '阿姆斯特丹',
    value: 100
}, {
    name: '泰恩威尔',
    value: 100
}, {
    name: '格拉斯哥',
    value: 100
}, {
    name: '叶卡捷琳堡',
    value: 100
}, {
    name: '萨马拉',
    value: 100
}, {
    name: '圣彼得堡',
    value: 100
}, {
    name: '新西伯利亚',
    value: 100
}, {
    name: '下诺夫哥罗德',
    value: 100
}, {
    name: '喀山',
    value: 100
}, {
    name: '哈尔科夫',
    value: 100
}, {
    name: '第聂伯罗',
    value: 100
}, {
    name: '温哥华',
    value: 100
}, {
    name: '多伦多',
    value: 100
}, {
    name: '圣多明哥',
    value: 100
}, {
    name: '蒙特雷',
    value: 100
}, {
    name: '墨西哥城',
    value: 100
}, {
    name: '巴拿马城',
    value: 100
}, {
    name: '圣胡安',
    value: 100
}, {
    name: '芝加哥',
    value: 100
}, {
    name: '费城',
    value: 100
}, {
    name: '康登',
    value: 100
}, {
    name: '旧金山',
    value: 100
}, {
    name: '华盛顿',
    value: 100
}, {
    name: '波士顿',
    value: 100
}, {
    name: '克利夫兰',
    value: 100
}, {
    name: '洛杉矶',
    value: 100
}, {
    name: '布宜诺斯艾利斯',
    value: 100
}, {
    name: '勒西腓',
    value: 100
}, {
    name: '阿雷格里港',
    value: 100
}, {
    name: '贝洛奥里藏特',
    value: 100
}, {
    name: '萨尔瓦多',
    value: 100
}, {
    name: '康塞普西翁',
    value: 100
}, {
    name: '瓦尔帕莱索',
    value: 100
}, {
    name: '圣地亚哥',
    value: 100
}, {
    name: '麦德林',
    value: 100
}, {
    name: '利马',
    value: 100
}, {
    name: '加拉加斯',
    value: 100
}, {
    name: '洛斯特克斯',
    value: 100
}, {
    name: '马拉开波',
    value: 100
}
];
var geoCoordMap = {
    "马拉开波": [-71.7516457, 10.6757277],
    "洛斯特克斯": [-67.0593026, 10.3483982],
    "加拉加斯": [-67.0304551, 10.4683612],
    "利马": [-77.0243879, -11.996608],
    "麦德林": [-75.6512528, 6.2441988],
    "圣地亚哥": [-70.7142132, -33.4533624],
    "瓦尔帕莱索": [-71.6460682, -33.0507029],
    "康塞普西翁": [-73.1030862, -36.8262787],
    "萨尔瓦多": [-38.5598966, -12.9015868],
    "贝洛奥里藏特": [-44.1041388, -19.9026615],
    "阿雷格里港": [-51.2172295, -30.1087957],
    "勒西腓": [-35.0170507, -8.0873039],
    "布宜诺斯艾利斯": [-58.5733854, -34.6157437],
    "洛杉矶": [-118.2919293, 34.0201613],
    "克利夫兰": [-81.8459458, 41.497447],
    "波士顿": [-71.1103698, 42.3142647],
    "华盛顿": [-77.1546623, 38.8935128],
    "旧金山": [-122.5076405, 37.7576793],
    "康登": [-75.1182637, 39.9698475],
    "费城": [-75.2581191, 40.0024137],
    "芝加哥": [-87.8121558, 41.8333925],
    "圣胡安": [-66.1305136, 18.3892246],
    "巴拿马城": [-79.5932266, 9.0813885],
    "墨西哥城": [-99.2238164, 19.390519],
    "蒙特雷": [-100.4431842, 25.6487281],
    "圣多明哥": [-70.0170526, 18.4800103],
    "多伦多": [-79.6010405, 43.6565353],
    "温哥华": [-123.1939441, 49.2577143],
    "第聂伯罗": [34.8602718, 48.4622135],
    "哈尔科夫": [36.1457403, 49.994507],
    "喀山": [48.993122, 55.795183],
    "下诺夫哥罗德": [43.786662, 56.2926609],
    "新西伯利亚": [82.8692233, 54.969655],
    "圣彼得堡": [30.2302884, 59.9390094],
    "萨马拉": [50.117894, 53.2605796],
    "叶卡捷琳堡": [60.5747533, 56.8135772],
    "格拉斯哥": [-4.3725418, 55.8553807],
    "泰恩威尔": [-1.6793439, 54.9388936],
    "阿姆斯特丹": [4.7585391, 52.3545653],
    "伍珀塔尔": [7.0236826, 51.2418081],
    "斯图加特": [9.0371306, 48.7791242],
    "科隆": [6.8871374, 50.9573677],
    "杜塞尔多夫": [6.6742661, 51.2383711],
    "纽伦堡": [10.9929528, 49.436009],
    "里尔": [2.9771205, 50.6310465],
    "里昂": [4.7650807, 45.7579341],
    "雷恩": [-1.7584946, 48.1158943],
    "图卢兹": [1.3628007, 43.6006786],
    "洛桑": [6.5124099, 46.5283945],
    "毕尔巴鄂": [-2.9685839, 43.2633182],
    "帕尔马": [2.6107146, 39.5699316],
    "塞维利亚": [-6.0250988, 37.3753501],
    "布雷西亚": [10.1536385, 45.5435858],
    "卡塔尼亚": [15.0074774, 37.4906905],
    "热那亚": [8.7507467, 44.4468921],
    "米兰": [9.137647, 45.4626482],
    "那不勒斯": [14.1765619, 40.8539123],
    "都灵": [7.600049, 45.0701176],
    "悉尼": [151.1924823, -33.8679049],
    "约翰内斯堡": [27.9699836, -26.1715046],
    "海法": [34.9467353, 32.7996029],
    "迪拜": [55.0475453, 25.1750853],
    "阿达纳": [35.1479804, 36.9973327],
    "布尔萨": [28.8922034, 40.2215936],
    "伊兹密尔": [27.1396307, 38.4175917],
    "伊斯法罕": [51.5469389, 32.6622111],
    "德黑兰": [51.2097318, 35.6967329],
    "马什哈德": [59.4393715, 36.2975402],
    "设拉子": [52.4186778, 29.6240261],
    "大不里士": [46.1536396, 38.0802852],
    "第比利斯": [44.698767, 41.7323742],
    "巴库": [49.7148735, 40.394508],
    "埃里温": [44.348481, 40.153306],
    "塔什干": [69.1392808, 41.2825125],
    "阿拉木图": [76.7152517, 43.3104388],
    "新德里": [77.1688973, 28.6272181],
    "班加罗尔": [77.5507338, 12.9538477],
    "金奈": [79.9288061, 13.0473748],
    "斋普尔": [75.6504699, 26.8851417],
    "古尔冈": [76.9087455, 28.439793],
    "加尔各答": [88.3352566, 22.5471567],
    "马尼拉": [120.94454, 14.5964957],
    "吉隆坡": [101.5469, 3.1384965],
    "平壤": [125.6020255, 39.0290544],
    "仁川": [126.5342635, 37.4644673],
    "仙台": [140.7968595, 38.2702292],
    "福冈": [130.3172093, 33.5987303],
    "神户": [135.1206593, 34.69428],
    "札幌": [141.3004597, 43.0594286],
    "孟买": [72.8410974, 19.0821978],
    "布鲁塞尔": [4.30535, 50.8549541],
    "奥斯陆": [10.7450341, 59.9437806],
    "赫尔辛基": [24.9385031, 60.2098678],
    "布拉格": [14.3255395, 50.0595854],
    "布达佩斯": [18.9902182, 47.4811281],
    "华沙": [20.9810102, 52.2326063],
    "索菲亚": [23.283861, 42.6953468],
    "布加勒斯特": [25.9995522, 44.4377401],
    "伊斯坦布尔": [28.8830741, 41.0522909],
    "安卡拉": [32.7825716, 39.9030394],
    "鹿特丹": [4.3503223, 51.9278891],
    "罗马": [12.3959121, 41.909986],
    "斯德哥尔摩": [17.94197, 59.3260668],
    "维也纳": [16.3399752, 48.2205998],
    "蒙特利尔": [-73.5104916, 45.5576996],
    "慕尼黑": [11.601751, 48.1548256],
    "哥本哈根": [12.5237841, 55.6712474],
    "汉堡": [9.9476387, 53.5582446],
    "汉诺威": [9.7213875, 52.3795836],
    "里斯本": [-9.1302438, 38.7436057],
    "巴伦西亚": [-0.4015975, 39.5077012],
    "明斯克": [27.5395464, 53.8835622],
    "巴塞罗那": [2.0787274, 41.3947688],
    "柏林": [13.344548, 52.5065133],
    "法兰克福": [8.4964794, 50.1211277],
    "基辅": [30.5025051, 50.431699],
    "马德里": [-3.8196227, 40.4378698],
    "莫斯科": [37.5251062, 55.770748],
    "巴西利亚": [-48.0774468, -15.8217175],
    "里约热内卢": [-43.3261845, -22.913885],
    "巴黎": [2.2770198, 48.8588377],
    "首尔": [126.8494635, 37.5650172],
    "光州": [126.7737594, 35.1766798],
    "大田": [127.2487133, 36.3730182],
    "大邱": [128.4266132, 35.8796687],
    "釜山": [128.9317131, 35.1643694],
    "东京": [139.6012938, 35.6691074],
    "大阪": [135.4601304, 34.678395],
    "京都": [135.6909094, 35.0060799],
    "横滨": [139.5492094, 35.4619298],
    "阿尔及尔": [3.060065, 36.775348],
    "开罗": [31.243666, 30.048819],
    "圣保罗": [-46.6333824, -23.5506507],
    "纽约": [-73.987155, 40.730861],
    "雅典": [23.7279843, 37.9841493],
    "名古屋": [136.90448, 35.15792],
    "曼谷": [100.493087, 13.7542529],
    "新加坡": [103.8520359, 1.2904753],
    "墨尔本": [144.9631608, -37.81422],
    "伦敦": [-0.1276474, 51.5073219],
    "桃园": [121.213608, 24.982757],
    "台北": [121.52, 25.03],
    "高雄": [120.306839, 22.630576],
    "香港特别行政区": [114.172, 22.281],
    "澳门特别行政区": [113.551589, 22.19316],
    "海门": [121.15, 31.89],
    "鄂尔多斯": [109.781327, 39.608266],
    "招远": [120.38, 37.35],
    "舟山": [122.207216, 29.985295],
    "齐齐哈尔": [123.97, 47.33],
    "盐城": [120.13, 33.38],
    "赤峰": [118.87, 42.28],
    "青岛": [120.33, 36.07],
    "乳山": [121.52, 36.89],
    "金昌": [102.188043, 38.520089],
    "泉州": [118.58, 24.93],
    "莱西": [120.53, 36.86],
    "日照": [119.46, 35.42],
    "胶南": [119.97, 35.88],
    "南通": [121.05, 32.08],
    "拉萨": [91.11, 29.97],
    "云浮": [112.02, 22.93],
    "梅州": [116.1, 24.55],
    "文登": [122.05, 37.2],
    "上海": [121.48, 31.22],
    "攀枝花": [101.718637, 26.582347],
    "威海": [122.1, 37.5],
    "承德": [117.93, 40.97],
    "厦门": [118.1, 24.46],
    "汕尾": [115.375279, 22.786211],
    "潮州": [116.63, 23.68],
    "丹东": [124.37, 40.13],
    "太仓": [121.1, 31.45],
    "曲靖": [103.79, 25.51],
    "烟台": [121.39, 37.52],
    "福州": [119.3, 26.08],
    "瓦房店": [121.979603, 39.627114],
    "即墨": [120.45, 36.38],
    "抚顺": [123.97, 41.97],
    "玉溪": [102.52, 24.35],
    "张家口": [114.87, 40.82],
    "阳泉": [113.57, 37.85],
    "莱州": [119.942327, 37.177017],
    "湖州": [120.1, 30.86],
    "汕头": [116.69, 23.39],
    "昆山": [120.95, 31.39],
    "宁波": [121.56, 29.86],
    "湛江": [110.359377, 21.270708],
    "揭阳": [116.35, 23.55],
    "荣成": [122.41, 37.16],
    "连云港": [119.16, 34.59],
    "葫芦岛": [120.836932, 40.711052],
    "常熟": [120.74, 31.64],
    "东莞": [113.75, 23.04],
    "河源": [114.68, 23.73],
    "淮安": [119.15, 33.5],
    "泰州": [119.9, 32.49],
    "南宁": [108.33, 22.84],
    "营口": [122.18, 40.65],
    "惠州": [114.4, 23.09],
    "江阴": [120.26, 31.91],
    "蓬莱": [120.75, 37.8],
    "韶关": [113.62, 24.84],
    "嘉峪关": [98.289152, 39.77313],
    "广州": [113.23, 23.16],
    "延安": [109.47, 36.6],
    "太原": [112.53, 37.87],
    "清远": [113.01, 23.7],
    "中山": [113.38, 22.52],
    "昆明": [102.73, 25.04],
    "寿光": [118.73, 36.86],
    "盘锦": [122.070714, 41.119997],
    "长治": [113.08, 36.18],
    "深圳": [114.07, 22.62],
    "珠海": [113.52, 22.3],
    "宿迁": [118.3, 33.96],
    "咸阳": [108.72, 34.36],
    "铜川": [109.11, 35.09],
    "平度": [119.97, 36.77],
    "佛山": [113.11, 23.05],
    "海口": [110.35, 20.02],
    "江门": [113.06, 22.61],
    "章丘": [117.53, 36.72],
    "肇庆": [112.44, 23.05],
    "大连": [121.62, 38.92],
    "临汾": [111.5, 36.08],
    "吴江": [120.63, 31.16],
    "石嘴山": [106.39, 39.04],
    "沈阳": [123.38, 41.8],
    "苏州": [120.62, 31.32],
    "茂名": [110.88, 21.68],
    "嘉兴": [120.76, 30.77],
    "长春": [125.35, 43.88],
    "胶州": [120.03336, 36.264622],
    "银川": [106.27, 38.47],
    "张家港": [120.555821, 31.875428],
    "三门峡": [111.19, 34.76],
    "锦州": [121.15, 41.13],
    "南昌": [115.89, 28.68],
    "柳州": [109.4, 24.33],
    "三亚": [109.511909, 18.252847],
    "自贡": [104.778442, 29.33903],
    "吉林": [126.57, 43.87],
    "阳江": [111.95, 21.85],
    "泸州": [105.39, 28.91],
    "西宁": [101.74, 36.56],
    "宜宾": [104.56, 29.77],
    "呼和浩特": [111.65, 40.82],
    "成都": [104.06, 30.67],
    "大同": [113.3, 40.12],
    "镇江": [119.44, 32.2],
    "桂林": [110.28, 25.29],
    "张家界": [110.479191, 29.117096],
    "宜兴": [119.82, 31.36],
    "北海": [109.12, 21.49],
    "西安": [108.95, 34.27],
    "金坛": [119.56, 31.74],
    "东营": [118.49, 37.46],
    "牡丹江": [129.58, 44.6],
    "遵义": [106.9, 27.7],
    "绍兴": [120.58, 30.01],
    "扬州": [119.42, 32.39],
    "常州": [119.95, 31.79],
    "潍坊": [119.1, 36.62],
    "重庆": [106.54, 29.59],
    "台州": [121.420757, 28.656386],
    "南京": [118.78, 32.04],
    "滨州": [118.03, 37.36],
    "贵阳": [106.71, 26.57],
    "无锡": [120.29, 31.59],
    "本溪": [123.73, 41.3],
    "克拉玛依": [84.77, 45.59],
    "渭南": [109.5, 34.52],
    "马鞍山": [118.48, 31.56],
    "宝鸡": [107.15, 34.38],
    "焦作": [113.21, 35.24],
    "句容": [119.16, 31.95],
    "北京": [116.46, 39.92],
    "徐州": [117.2, 34.26],
    "衡水": [115.72, 37.72],
    "包头": [110, 40.58],
    "绵阳": [104.73, 31.48],
    "乌鲁木齐": [87.68, 43.77],
    "枣庄": [117.57, 34.86],
    "杭州": [120.19, 30.26],
    "淄博": [118.05, 36.78],
    "鞍山": [122.85, 41.12],
    "溧阳": [119.48, 31.43],
    "库尔勒": [86.06, 41.68],
    "安阳": [114.35, 36.1],
    "开封": [114.35, 34.79],
    "济南": [117, 36.65],
    "德阳": [104.37, 31.13],
    "温州": [120.65, 28.01],
    "九江": [115.97, 29.71],
    "邯郸": [114.47, 36.6],
    "临安": [119.72, 30.23],
    "兰州": [103.73, 36.03],
    "沧州": [116.83, 38.33],
    "临沂": [118.35, 35.05],
    "南充": [106.110698, 30.837793],
    "天津": [117.2, 39.13],
    "富阳": [119.95, 30.07],
    "泰安": [117.13, 36.18],
    "诸暨": [120.23, 29.71],
    "郑州": [113.65, 34.76],
    "哈尔滨": [126.63, 45.75],
    "聊城": [115.97, 36.45],
    "芜湖": [118.38, 31.33],
    "唐山": [118.02, 39.63],
    "平顶山": [113.29, 33.75],
    "邢台": [114.48, 37.05],
    "德州": [116.29, 37.45],
    "济宁": [116.59, 35.38],
    "荆州": [112.239741, 30.335165],
    "宜昌": [111.3, 30.7],
    "义乌": [120.06, 29.32],
    "丽水": [119.92, 28.45],
    "洛阳": [112.44, 34.7],
    "秦皇岛": [119.57, 39.95],
    "株洲": [113.16, 27.83],
    "石家庄": [114.48, 38.03],
    "莱芜": [117.67, 36.19],
    "常德": [111.69, 29.05],
    "保定": [115.48, 38.85],
    "湘潭": [112.91, 27.87],
    "金华": [119.64, 29.12],
    "岳阳": [113.09, 29.37],
    "长沙": [113, 28.21],
    "衢州": [118.88, 28.97],
    "廊坊": [116.7, 39.53],
    "菏泽": [115.480656, 35.23375],
    "合肥": [117.27, 31.86],
    "武汉": [114.31, 30.52],
    "大庆": [125.03, 46.58]
};
var convertData = function (data) {
    var res = [];
    for (var i = 0; i < data.length; i++) {
        var geoCoord = geoCoordMap[data[i].name];
        if (geoCoord) {
            res.push({
                name: data[i].name,
                value: geoCoord.concat(data[i].value)
            });
        }
    }
    return res;
};
var option = {
    title: {
        text: '地铁线路图',
        subtext: 'Subways on World Map',
        left: 'center'
    },
    tooltip: {
        trigger: 'item',
        formatter: (params) => {
            return params.name;
        }
    },
    bmap: {
        center: [104.114129, 37.550339], // 中国中心视角
        zoom: 5,
        roam: true,
        mapStyle: {
            styleJson: [
                {
                    "featureType": "water",
                    "elementType": "all",
                    "stylers": {
                        "color": "#72b8fe"
                    }
                },
                {
                    "featureType": "highway",
                    "elementType": "geometry.fill",
                    "stylers": {
                        "color": "#ffffff"
                    }
                },
                {
                    "featureType": "highway",
                    "elementType": "geometry.stroke",
                    "stylers": {
                        "color": "#bababa"
                    }
                },
                {
                    "featureType": "highway",
                    "elementType": "labels.text.fill",
                    "stylers": {
                        "color": "#767676"
                    }
                },
                {
                    "featureType": "highway",
                    "elementType": "labels.text.stroke",
                    "stylers": {
                        "color": "#ffffff"
                    }
                },
                // {
                //     "featureType": "land",
                //     "elementType": "all",
                //     "stylers": {
                //         "color": "#b8cb93"
                //     }
                // },
                {
                    "featureType": "subway",
                    "elementType": "geometry.stroke",
                    "stylers": {
                        "visibility": "off"
                    }
                },
                {
                    'featureType': 'subway',
                    'elementType': 'all',
                    'stylers': {
                        'visibility': 'on',
                        'weight': '3'
                    }
                }
            ]
        }
    },
    series: [
        {
            name: '',
            type: 'effectScatter',
            coordinateSystem: 'bmap',
            data: convertData(data),
            symbolSize: function (val) {
                return val[2] / 20;
            },
            showEffectOn: 'render',
            rippleEffect: {
                brushType: 'stroke'
            },
            hoverAnimation: true,
            label: {
                formatter: '{b}',
                position: 'right',
                fontWeight: 'bold',
                fontSize: 14,
                show: true
            },
            itemStyle: {
                normal: {
                    color: '#00008B',
                    shadowBlur: 0,
                    shadowColor: '#333'
                }
            },
            zlevel: 1
        }
    ],
    toolbox: {
        show: true,
        feature: {
            restore: {},
            dataView: {
                optionToContent: function (opt) {
                    console.log(opt);
                    var series = opt.series[0].data;
                    var table = '<table style="width:500px;text-align:center;"><tbody><tr><th>城市</th><th>经度</th><th>纬度</th></tr>';
                    series.forEach(function (item) {
                        table += '<tr><td>' + item.name + '</td><td>' + item.value[0] + '</td><td>' + item.value[1] + '</td></tr>';
                    });
                    table += '</tbody></table>';
                    return table;
                }
            }
        },
        iconStyle: {
            borderWidth: 2
        },
        emphasis: {
            iconStyle: {
                borderColor: '#f00'
            }
        }
    }
};
myChart.setOption(option);

myChart.on('click', function (params) {
    option.bmap.center = geoCoordMap[params.name];
    option.bmap.zoom = 12;
    myChart.setOption(option);
});

myChart.on('restore', function () {
    option.bmap.center = [104.114129, 37.550339];
    option.bmap.zoom = 5;
    myChart.setOption(option);
});
