option = {
    tooltip: {
        trigger: 'axis',
        axisPointer: { // 坐标轴指示器，坐标轴触发有效
            type: 'shadow' // 默认为直线，可选为：'line' | 'shadow'
        }
    },
    legend: {
        data: ['漫入', '漫出']
    },
    grid: {
        left: '3%',
        right: '4%',
        bottom: '3%',
        containLabel: true
    },
    xAxis: [{
        type: 'category',
        "axisLabel":{
    		interval: 0,
    		rotate:-50
    	},
        data: ['上海','云南','内蒙','北京','吉林','四川','天津','宁夏','安徽','山东','山西','广东','广西','新疆','江西','河北','河南','浙江','海南','湖北','湖南','甘肃','福建','西藏','贵州','辽宁','重庆','陕西','青海','黑龙江']

    }],
    yAxis: [{
        type: 'value',
        axisTick: {
            show: false
        },
    }],
    series: [
        {
            name: '漫入',
            type: 'line',
            lineStyle: {
                normal: {
                    color: '#9B2428'
                }
            },
            label: {
                normal: {
                    show: false
                }
            },
            data: [1292682,51903,42129,240729,81182,88775,55345,12121,735051,594560,117785,372733,53068,31866,67665,160145,673791,374571,11788,167483,75747,58085,64168,1766,53280,93607,58707,117371,12814,90704]
        },
        {
            name: '漫出',
            type: 'line',
            lineStyle: {
                normal: {
                    color: '#FFA559'
                }
            },
            label: {
                normal: {
                    show: false,
                }
            },
            data: [401232,119338,126946,251714,83704,221143,113344,20333,482310,420493,124852,557256,90880,146624,149128,269493,521286,580807,29596,225687,146181,71629,157869,7069,129882,124113,120429,154387,16293,83653]
        }
    ]
};