option = {
    legend: {
        data: ['系列1', '系列2']
    },
    parallelAxis: [
        {dim: 0, name: '系列1'},
        {dim: 1, name: '系列2'},
        {dim: 2, name: '系列3'},
        {
            dim: 3,
            name: '系列4',
            type: 'category',
            data: ['类别1', '类别2', '类别3', '类别4']
        }
    ],
    series: [{
        name: '系列1',
        type: 'parallel',
        data: [
            [12, 80, 82, '类别1'],
            [25, 85, 85, '类别2'],
            [30, 100, 90, '类别3'],
            [32, 120, 100, '类别4']
        ]
    }, {
        name: '系列2',
        type: 'parallel',
        data: [
            [10, 80, 77, '类别1'],
            [18, 90, 50, '类别2'],
            [23, 110, 80, '类别3'],
            [9, 100, 60, '类别4']
        ]
    }]
};
