option = {
    title: {
        text: '羡辙部落格的第一个年头'
    },
    yAxis: {
        interval: 0,
        data: [
          '2016 读书小结', 
          '读书，以消遣的名义', 
          '这可能是最简陋的 Minecraft 建筑', 
          '羡辙姐来拜年啦！',
          '微型小说 · 宝子姑娘',
          '微型小说 · 对策', 
          '微型小说 · 继承人', 
          '微型小说 · 生财之道', 
          '烧书，始皇之功也',
          '代码江湖救急（上）',
          '代码江湖救急（下）',
          '草坪读书随想',
          '微型小说 · 教训',
          '拍日出记',
          '节日快乐，姑娘们',
          '阿姨，来碗酒酿，会醉的那种',
          '最后的毕业，最初的就业',
          '青春作伴，何必读研',
          '第一期中国好问题',
          '第一期中国好问题颁奖典礼',
          '第二期中国好问题',
          '第二期中国好问题颁奖典礼',
          '最长情的告白',
          '再给我划一次难点好不好？',
          '羡辙入职记',
          '第一笔工资怎么花？',
          '来说说你眼中的羡辙',
          '我喜欢读书',
          '五千块 logo 的庐山真面目',
          '第三期中国好问题',
          '快意当前，适观而已',
          '羡辙读古文',
          '前端可视化的测试实践',
          '既然大家都很好奇……',
          '粽子节快乐',
          '过敏这件可大可小的事',
          '小提琴',
          '羡辙教你写情书',
          '遍身罗绮者，不是养蚕人',
          '改变历史的正义性与效用性讨论',
          '如何优雅地参加技术分享会？',
          '赏你一枚月饼',
          '饮料与书籍',
          '辙迹书摘（一）',
          '辙迹书摘（二）'
        ]
    },
    xAxis: [{
      name: '阅读量',
      nameGap: 25,
      nameLocation: 'end',
      axisTick: {
        show: false
      },
      axisLabel: {
        textStyle: {
          color: '#D0648A'
        }
      }
    }, {
      name: '赞赏金额',
      nameGap: 25,
      nameLocation: 'end',
      axisTick: {
        show: false
      },
      axisLabel: {
        textStyle: {
          color: '#22C3AA'
        }
      },
      splitLine: {
        show: false
      }
    }],
    series: [{
      name: '阅读量',
      type: 'line',
      lineStyle: {
        normal: {
          color: '#D0648A',
          width: 3
        }
      },
      itemStyle: {
        normal: {
          color: '#D0648A',
          borderWidth: 2
        }
      },
      symbolSize: 6,
      data:[701, 628, 386, 503, 292, 204, 187, 160, 284,
            467, 210, 342, 230, 421, 371, 570, 997, 788,
            383, 464, 425, 445, 504, 582, 847, 720, 579,
            683, 878, 414, 426, 392, 849, 930, 432, 552,
            578, 556, 384, 175, 767, 402, 572, 589, 373
           ]
    }, {
      name: '赞赏金额',
      type: 'bar',
      itemStyle: {
        normal: {
          color: '#22C3AA'
        }
      },
      data: ['-', '-', '-', '-', '-', '-', '-', '-', '-',
            '-', '-', '-', '-', '-', '-', '-', '-', '-',
            '-', '-', 23, 12, 9, 70.29, 68, 0, 0,
            0, 0, 5.2, 8, 50.52, 80, 0, 0, 12,
            2, 105.98, 0, 40.22, 20, 0, 78, 0, 0],
      xAxisIndex: 1
    }],
    legend: {
      data: ['赞赏金额', '阅读量'],
      top: 30
    },
    grid: {
      left: 200,
      top: 80,
      right: 75
    }
};