var date = ['2013——2014学年第一学期', '2013——2014学年第二学期',
            '2014——2015学年第一学期', '2014——2015学年第二学期', 
            '2014——2015学年第一学期', '2014——2015学年第二学期'，
            '2014——2015学年第一学期', '2014——2015学年第二学期'，
            '2014——2015学年第一学期', '2014——2015学年第二学期'，
            '2014——2015学年第一学期', '2014——2015学年第二学期'，];

options = [{
    title: {
        text: '创建/编辑/浏览图表数'
    },
    xAxis: {
        data: date
    },
    yAxis: [{}, {
        splitLine: {
            show: false
        }
    }, {
        show: false
    }],
    series: [{
        name: '创建图表',
        type: 'line',
        data: [84, 83, 74, 87, 72, 70, 76, 69, 75, 165, 82, 80, 66, 102, 74, 85, 72]
    }, {
        name: '修改图表',
        type: 'line',
        data: [1027, 1377, 1709, 1917, 1747, 1746, 1921, 1754, 1390, 1512, 1381, 1381, 1523, 2114, 2150, 2148, 1401],
        yAxisIndex: 2
    }, {
        name: '浏览图表',
        type: 'line',
        data: [27940, 38233, 44996, 49407, 51571, 52219, 61798, 58105, 44666, 47152, 45450, 43167, 47293, 72323, 77227, 90906, 57161], 
        yAxisIndex: 1
    }],
    legend: {
        show: true,
        data: ['创建图表', '修改图表', '浏览图表']
    },
    tooltip: {
        show: true,
        trigger: 'axis'
    }
}];