var geoCoordMap = {
    "上海市": [121.47, 31.23],
    "重庆市": [106.5, 29.54],
    "香港特别行政区": [114.17, 22.32],
    "澳门特别行政区": [113.54, 22.2],
    "天津市": [117.18, 39.12],
    "北京市": [116.4, 39.9],
    "巴彦淖尔市": [107.41, 40.76],
    "乌海市": [106.82, 39.67],
    "包头市": [109.83, 40.66],
    "呼伦贝尔市": [119.75, 49.21],
    "鄂尔多斯市": [109.98, 39.82],
    "阿拉善盟": [105.7, 38.84],
    "通辽市": [122.26, 43.62],
    "兴安盟": [122.06, 46.07],
    "锡林郭勒盟": [116.08, 43.94],
    "呼和浩特市": [111.66, 40.82],
    "赤峰市": [118.95, 42.27],
    "乌兰察布市": [113.11, 41.03],
    "三门峡市": [111.19, 34.78],
    "洛阳市": [112.43, 34.66],
    "许昌市": [113.82, 34.02],
    "南阳市": [112.54, 33.0],
    "漯河市": [114.02, 33.58],
    "信阳市": [114.07, 32.13],
    "驻马店市": [114.02, 32.98],
    "焦作市": [113.23, 35.24],
    "濮阳市": [115.04, 35.77],
    "济源市": [112.58, 35.09],
    "鹤壁市": [114.29, 35.75],
    "新乡市": [113.88, 35.3],
    "平顶山市": [113.3, 33.74],
    "周口市": [114.64, 33.62],
    "安阳市": [114.35, 36.1],
    "郑州市": [113.66, 34.76],
    "开封市": [114.34, 34.8],
    "商丘市": [115.64, 34.44],
    "肇庆市": [112.47, 23.05],
    "佛山市": [113.12, 23.03],
    "汕头市": [116.7, 23.37],
    "惠州市": [114.41, 23.08],
    "深圳市": [114.08, 22.55],
    "珠海市": [113.55, 22.23],
    "湛江市": [110.36, 21.28],
    "阳江市": [111.97, 21.86],
    "汕尾市": [115.36, 22.78],
    "潮州市": [116.63, 23.66],
    "江门市": [113.09, 22.59],
    "云浮市": [112.04, 22.93],
    "茂名市": [110.91, 21.66],
    "河源市": [114.69, 23.75],
    "梅州市": [116.11, 24.3],
    "东莞市": [113.74, 23.05],
    "揭阳市": [116.35, 23.55],
    "清远市": [113.05, 23.69],
    "韶关市": [113.59, 24.8],
    "广州市": [113.28, 23.13],
    "大兴安岭地区": [124.7, 52.33],
    "鹤岗市": [130.27, 47.33],
    "七台河市": [131.01, 45.77],
    "伊春市": [128.89, 47.72],
    "哈尔滨市": [126.64, 45.76],
    "齐齐哈尔市": [123.95, 47.34],
    "绥化市": [126.99, 46.64],
    "黑河市": [127.49, 50.25],
    "牡丹江市": [129.61, 44.58],
    "大庆市": [125.11, 46.59],
    "佳木斯市": [130.35, 46.81],
    "双鸭山市": [131.15, 46.64],
    "鸡西市": [130.97, 45.3],
    "北屯市": [87.82, 47.35],
    "双河市": [82.35, 44.84],
    "铁门关市": [85.5, 41.83],
    "博尔塔拉蒙古自治州": [82.07, 44.9],
    "和田地区": [79.92, 37.11],
    "塔城地区": [82.98, 46.75],
    "石河子市": [86.04, 44.3],
    "阿勒泰地区": [88.14, 47.85],
    "可克达拉市": [80.63, 43.68],
    "克拉玛依市": [84.87, 45.6],
    "昆玉市": [79.29, 37.21],
    "昌吉回族自治州": [87.3, 44.01],
    "乌鲁木齐市": [87.61, 43.79],
    "巴音郭楞蒙古自治州": [86.15, 41.77],
    "阿拉尔市": [81.28, 40.54],
    "五家渠市": [87.52, 44.17],
    "伊犁哈萨克自治州": [81.31, 43.92],
    "克孜勒苏柯尔克孜自治州": [76.17, 39.71],
    "喀什地区": [75.99, 39.47],
    "图木舒克市": [79.08, 39.87],
    "阿克苏地区": [80.26, 41.17],
    "哈密市": [93.51, 42.83],
    "吐鲁番市": [89.18, 42.95],
    "武汉市": [114.29, 30.59],
    "孝感市": [113.92, 30.93],
    "黄冈市": [114.87, 30.45],
    "荆门市": [112.2, 31.04],
    "十堰市": [110.78, 32.65],
    "宜昌市": [111.29, 30.71],
    "天门市": [113.16, 30.66],
    "襄阳市": [112.14, 32.04],
    "仙桃市": [113.45, 30.37],
    "潜江市": [112.89, 30.42],
    "荆州市": [112.23, 30.33],
    "随州市": [113.37, 31.72],
    "恩施土家族苗族自治州": [109.48, 30.29],
    "咸宁市": [114.32, 29.84],
    "神农架林区": [110.67, 31.75],
    "鄂州市": [114.89, 30.4],
    "黄石市": [115.07, 30.22],
    "大连市": [121.61, 38.91],
    "葫芦岛市": [120.85, 40.75],
    "丹东市": [124.38, 40.12],
    "锦州市": [121.13, 41.12],
    "阜新市": [121.64, 42.01],
    "沈阳市": [123.42, 41.79],
    "抚顺市": [123.92, 41.87],
    "营口市": [122.23, 40.67],
    "铁岭市": [123.84, 42.29],
    "盘锦市": [122.06, 41.12],
    "本溪市": [123.76, 41.3],
    "辽阳市": [123.18, 41.27],
    "鞍山市": [122.99, 41.11],
    "朝阳市": [120.45, 41.57],
    "烟台市": [121.39, 37.54],
    "青岛市": [120.35, 36.08],
    "威海市": [122.11, 37.51],
    "聊城市": [115.97, 36.46],
    "淄博市": [118.04, 36.81],
    "临沂市": [118.32, 35.07],
    "潍坊市": [119.1, 36.71],
    "滨州市": [118.01, 37.38],
    "日照市": [119.46, 35.43],
    "东营市": [118.66, 37.43],
    "泰安市": [117.12, 36.19],
    "菏泽市": [115.46, 35.25],
    "济宁市": [116.58, 35.42],
    "济南市": [117.0, 36.68],
    "枣庄市": [117.55, 34.86],
    "德州市": [116.3, 37.45],
    "连云港市": [119.17, 34.6],
    "南京市": [118.76, 32.04],
    "宿迁市": [118.27, 33.96],
    "南通市": [120.86, 32.02],
    "淮安市": [119.02, 33.6],
    "无锡市": [120.3, 31.58],
    "常州市": [119.94, 31.77],
    "苏州市": [120.62, 31.3],
    "徐州市": [117.18, 34.26],
    "扬州市": [119.42, 32.4],
    "泰州市": [119.91, 32.49],
    "盐城市": [120.13, 33.38],
    "镇江市": [119.45, 32.21],
    "商洛市": [109.93, 33.87],
    "西安市": [108.94, 34.26],
    "安康市": [109.02, 32.69],
    "汉中市": [107.02, 33.08],
    "铜川市": [108.97, 34.92],
    "榆林市": [109.74, 38.29],
    "咸阳市": [108.7, 34.33],
    "延安市": [109.49, 36.6],
    "渭南市": [109.5, 34.5],
    "宝鸡市": [107.14, 34.37],
    "六盘水市": [104.84, 26.59],
    "铜仁市": [109.19, 27.72],
    "遵义市": [106.93, 27.71],
    "黔南布依族苗族自治州": [107.51, 26.26],
    "毕节市": [105.28, 27.31],
    "黔东南苗族侗族自治州": [107.97, 26.59],
    "安顺市": [105.93, 26.25],
    "黔西南布依族苗族自治州": [104.9, 25.09],
    "贵阳市": [106.71, 26.58],
    "阿里地区": [80.1, 32.51],
    "林芝市": [94.36, 29.66],
    "那曲市": [92.06, 31.48],
    "山南市": [91.77, 29.24],
    "拉萨市": [91.13, 29.66],
    "昌都市": [97.18, 31.14],
    "日喀则市": [88.88, 29.27],
    "淮北市": [116.79, 33.97],
    "阜阳市": [115.81, 32.9],
    "马鞍山市": [118.5, 31.69],
    "铜陵市": [117.81, 30.93],
    "安庆市": [117.04, 30.51],
    "亳州市": [115.78, 33.87],
    "宣城市": [118.75, 30.95],
    "黄山市": [118.31, 29.71],
    "滁州市": [118.31, 32.31],
    "池州市": [117.48, 30.66],
    "芜湖市": [118.37, 31.33],
    "六安市": [116.5, 31.75],
    "合肥市": [117.28, 31.86],
    "淮南市": [117.01, 32.65],
    "宿州市": [116.98, 33.64],
    "蚌埠市": [117.36, 32.94],
    "福州市": [119.3, 26.08],
    "宁德市": [119.52, 26.66],
    "龙岩市": [117.02, 25.09],
    "南平市": [118.17, 26.64],
    "厦门市": [118.11, 24.49],
    "漳州市": [117.66, 24.51],
    "莆田市": [119.0, 25.43],
    "泉州市": [118.58, 24.91],
    "三明市": [117.63, 26.27],
    "衡阳市": [112.6, 26.9],
    "益阳市": [112.35, 28.57],
    "岳阳市": [113.13, 29.37],
    "娄底市": [112.0, 27.73],
    "张家界市": [110.47, 29.13],
    "常德市": [111.69, 29.04],
    "湘西土家族苗族自治州": [109.74, 28.32],
    "怀化市": [109.97, 27.55],
    "长沙市": [112.98, 28.2],
    "湘潭市": [112.94, 27.83],
    "郴州市": [113.03, 25.8],
    "永州市": [111.6, 26.44],
    "株洲市": [113.15, 27.84],
    "邵阳市": [111.46, 27.24],
    "白沙黎族自治县": [109.45, 19.23],
    "琼中黎族苗族自治县": [109.84, 19.04],
    "琼海市": [110.46, 19.25],
    "昌江黎族自治县": [109.05, 19.26],
    "屯昌县": [110.1, 19.36],
    "东方市": [108.65, 19.1],
    "定安县": [110.34, 19.69],
    "万宁市": [110.38, 18.8],
    "临高县": [109.68, 19.91],
    "五指山市": [109.51, 18.78],
    "乐东黎族自治县": [109.17, 18.75],
    "保亭黎族苗族自治县": [109.7, 18.64],
    "文昌市": [110.75, 19.61],
    "陵水黎族自治县": [110.03, 18.51],
    "三亚市": [109.5, 18.25],
    "三沙市": [112.34, 16.83],
    "澄迈县": [110.0, 19.74],
    "海口市": [110.33, 20.03],
    "海南藏族自治州": [100.62, 36.28],
    "海西蒙古族藏族自治州": [97.37, 37.37],
    "海东市": [102.1, 36.5],
    "果洛藏族自治州": [100.24, 34.48],
    "玉树藏族自治州": [97.01, 33.01],
    "黄南藏族自治州": [102.02, 35.52],
    "西宁市": [101.78, 36.62],
    "海北藏族自治州": [100.9, 36.96],
    "北海市": [109.11, 21.48],
    "钦州市": [108.62, 21.97],
    "百色市": [106.61, 23.9],
    "河池市": [108.06, 24.7],
    "南宁市": [108.32, 22.83],
    "来宾市": [109.23, 23.74],
    "柳州市": [109.41, 24.32],
    "崇左市": [107.35, 22.41],
    "防城港市": [108.34, 21.62],
    "贺州市": [111.55, 24.42],
    "玉林市": [110.15, 22.63],
    "贵港市": [109.6, 23.1],
    "梧州市": [111.29, 23.48],
    "桂林市": [110.29, 25.28],
    "中卫市": [105.19, 37.51],

    "朔州市": [112.43, 39.33],
    "晋中市": [112.73, 37.7],
    "吕梁市": [111.13, 37.52],
    "大同市": [113.29, 40.09]
};

var data = [{
        name: "北京市",
        value: 3237
    },
    {
        name: "上海市",
        value: 2965
    },
    {
        name: "成都市",
        value: 2147
    },
    {
        name: "广州市",
        value: 2122
    },
    {
        name: "天津市",
        value: 2105
    },
    {
        name: "杭州市",
        value: 1751
    },
    {
        name: "佛山市",
        value: 1612
    },
    {
        name: "苏州市",
        value: 1594
    },
    {
        name: "宁波市",
        value: 1520
    },
    {
        name: "西安市",
        value: 1505
    },
    {
        name: "深圳市",
        value: 1441
    },
    {
        name: "武汉市",
        value: 1432
    },
    {
        name: "郑州市",
        value: 1353
    },
    {
        name: "石家庄市",
        value: 1264
    },
    {
        name: "昆明市",
        value: 1240
    },
    {
        name: "青岛市",
        value: 1226
    },
    {
        name: "福州市",
        value: 1225
    },
    {
        name: "温州市",
        value: 1215
    },
    {
        name: "济南市",
        value: 1211
    },
    {
        name: "保定市",
        value: 1206
    },
    {
        name: "长沙市",
        value: 1199
    },
    {
        name: "哈尔滨市",
        value: 1170
    },
    {
        name: "大连市",
        value: 1166
    },
    {
        name: "泉州市",
        value: 1112
    },
    {
        name: "沈阳市",
        value: 1096
    },
    {
        name: "潍坊市",
        value: 1087
    },
    {
        name: "南京市",
        value: 1077
    },
    {
        name: "香港特别行政区",
        value: 1070
    },
    {
        name: "唐山市",
        value: 1053
    },
    {
        name: "烟台市",
        value: 1035
    },
    {
        name: "南通市",
        value: 1019
    },
    {
        name: "长春市",
        value: 1018
    },
    {
        name: "临沂市",
        value: 1015
    },
    {
        name: "无锡市",
        value: 984
    },
    {
        name: "赣州市",
        value: 983
    },
    {
        name: "金华市",
        value: 942
    },
    {
        name: "南宁市",
        value: 932
    },
    {
        name: "邯郸市",
        value: 931
    },
    {
        name: "台州市",
        value: 891
    },
    {
        name: "合肥市",
        value: 872
    },
    {
        name: "徐州市",
        value: 846
    },
    {
        name: "南阳市",
        value: 842
    },
    {
        name: "洛阳市",
        value: 839
    },
    {
        name: "沧州市",
        value: 833
    },
    {
        name: "嘉兴市",
        value: 823
    },
    {
        name: "济宁市",
        value: 815
    },
    {
        name: "太原市",
        value: 809
    },
    {
        name: "南昌市",
        value: 795
    },
    {
        name: "淄博市",
        value: 794
    },
    {
        name: "盐城市",
        value: 789
    },
    {
        name: "邢台市",
        value: 783
    },
    {
        name: "绍兴市",
        value: 781
    },
    {
        name: "江门市",
        value: 767
    },
    {
        name: "衡阳市",
        value: 737
    },
    {
        name: "常州市",
        value: 716
    },
    {
        name: "贵阳市",
        value: 709
    },
    {
        name: "南充市",
        value: 706
    },
    {
        name: "绵阳市",
        value: 695
    },
    {
        name: "兰州市",
        value: 694
    },
    {
        name: "遵义市",
        value: 682
    },
    {
        name: "德州市",
        value: 676
    },
    {
        name: "桂林市",
        value: 671
    },
    {
        name: "上饶市",
        value: 668
    },
    {
        name: "惠州市",
        value: 660
    },
    {
        name: "湛江市",
        value: 654
    },
    {
        name: "咸阳市",
        value: 632
    },
    {
        name: "吉安市",
        value: 627
    },
    {
        name: "襄阳市",
        value: 626
    },
    {
        name: "信阳市",
        value: 622
    },
    {
        name: "菏泽市",
        value: 621
    },
    {
        name: "临汾市",
        value: 620
    },
    {
        name: "赤峰市",
        value: 620
    },
    {
        name: "吉林市",
        value: 619
    },
    {
        name: "泰州市",
        value: 618
    },
    {
        name: "周口市",
        value: 616
    },
    {
        name: "新乡市",
        value: 615
    },
    {
        name: "阜阳市",
        value: 614
    },
    {
        name: "扬州市",
        value: 613
    },
    {
        name: "九江市",
        value: 613
    },
    {
        name: "宜昌市",
        value: 606
    },
    {
        name: "黄冈市",
        value: 600
    },
    {
        name: "乌鲁木齐市",
        value: 593
    },
    {
        name: "邵阳市",
        value: 590
    },
    {
        name: "呼和浩特市",
        value: 589
    },
    {
        name: "驻马店市",
        value: 587
    },
    {
        name: "聊城市",
        value: 585
    },
    {
        name: "安庆市",
        value: 584
    },
    {
        name: "张家口市",
        value: 577
    },
    {
        name: "运城市",
        value: 574
    },
    {
        name: "渭南市",
        value: 568
    },
    {
        name: "镇江市",
        value: 568
    },
    {
        name: "茂名市",
        value: 555
    },
    {
        name: "荆州市",
        value: 554
    },
    {
        name: "廊坊市",
        value: 551
    },
    {
        name: "商丘市",
        value: 550
    },
    {
        name: "宜春市",
        value: 549
    },
    {
        name: "郴州市",
        value: 543
    },
    {
        name: "常德市",
        value: 542
    },
    {
        name: "漳州市",
        value: 541
    },
    {
        name: "泰安市",
        value: 536
    },
    {
        name: "安阳市",
        value: 532
    },
    {
        name: "汕头市",
        value: 530
    },
    {
        name: "永州市",
        value: 528
    },
    {
        name: "厦门市",
        value: 524
    },
    {
        name: "平顶山市",
        value: 522
    },
    {
        name: "宝鸡市",
        value: 515
    },
    {
        name: "岳阳市",
        value: 510
    },
    {
        name: "晋中市",
        value: 505
    },
    {
        name: "株洲市",
        value: 504
    },
    {
        name: "揭阳市",
        value: 503
    },
    {
        name: "玉林市",
        value: 503
    },
    {
        name: "吕梁市",
        value: 501
    },
    {
        name: "三明市",
        value: 501
    },
    {
        name: "达州市",
        value: 497
    },
    {
        name: "焦作市",
        value: 493
    },
    {
        name: "抚州市",
        value: 492
    },
    {
        name: "淮安市",
        value: 488
    },
    {
        name: "齐齐哈尔市",
        value: 488
    },
    {
        name: "滁州市",
        value: 487
    },
    {
        name: "柳州市",
        value: 485
    },
    {
        name: "长治市",
        value: 479
    },
    {
        name: "鞍山市",
        value: 476
    },
    {
        name: "衡水市",
        value: 468
    },
    {
        name: "汉中市",
        value: 460
    },
    {
        name: "梅州市",
        value: 459
    },
    {
        name: "德阳市",
        value: 459
    },
    {
        name: "忻州市",
        value: 457
    },
    {
        name: "银川市",
        value: 457
    },
    {
        name: "芜湖市",
        value: 456
    },
    {
        name: "承德市",
        value: 456
    },
    {
        name: "连云港市",
        value: 455
    },
    {
        name: "滨州市",
        value: 454
    },
    {
        name: "榆林市",
        value: 454
    },
    {
        name: "清远市",
        value: 453
    },
    {
        name: "包头市",
        value: 453
    },
    {
        name: "宜宾市",
        value: 453
    },
    {
        name: "肇庆市",
        value: 450
    },
    {
        name: "红河哈尼族彝族自治州",
        value: 450
    },
    {
        name: "牡丹江市",
        value: 449
    },
    {
        name: "威海市",
        value: 449
    },
    {
        name: "南平市",
        value: 445
    },
    {
        name: "怀化市",
        value: 444
    },
    {
        name: "鄂尔多斯市",
        value: 442
    },
    {
        name: "乐山市",
        value: 442
    },
    {
        name: "大庆市",
        value: 440
    },
    {
        name: "佳木斯市",
        value: 438
    },
    {
        name: "丽水市",
        value: 432
    },
    {
        name: "泸州市",
        value: 430
    },
    {
        name: "绥化市",
        value: 427
    },
    {
        name: "十堰市",
        value: 426
    },
    {
        name: "西宁市",
        value: 424
    },
    {
        name: "孝感市",
        value: 419
    },
    {
        name: "东营市",
        value: 416
    },
    {
        name: "海口市",
        value: 416
    },
    {
        name: "开封市",
        value: 412
    },
    {
        name: "秦皇岛市",
        value: 411
    },
    {
        name: "六安市",
        value: 410
    },
    {
        name: "许昌市",
        value: 405
    },
    {
        name: "益阳市",
        value: 405
    },
    {
        name: "大同市",
        value: 405
    },
    {
        name: "黔南布依族苗族自治州",
        value: 403
    },
    {
        name: "湖州市",
        value: 403
    },
    {
        name: "延边朝鲜族自治州",
        value: 400
    },
    {
        name: "珠海市",
        value: 398
    },
    {
        name: "韶关市",
        value: 397
    },
    {
        name: "湘潭市",
        value: 390
    },
    {
        name: "呼伦贝尔市",
        value: 388
    },
    {
        name: "宁德市",
        value: 386
    },
    {
        name: "衢州市",
        value: 384
    },
    {
        name: "黔东南苗族侗族自治州",
        value: 383
    },
    {
        name: "锦州市",
        value: 382
    },
    {
        name: "宿州市",
        value: 380
    },
    {
        name: "蚌埠市",
        value: 377
    },
    {
        name: "枣庄市",
        value: 375
    },
    {
        name: "四平市",
        value: 375
    },
    {
        name: "宿迁市",
        value: 373
    },
    {
        name: "龙岩市",
        value: 372
    },
    {
        name: "丹东市",
        value: 370
    },
    {
        name: "通辽市",
        value: 369
    },
    {
        name: "广安市",
        value: 368
    },
    {
        name: "葫芦岛市",
        value: 367
    },
    {
        name: "朝阳市",
        value: 366
    },
    {
        name: "河池市",
        value: 364
    },
    {
        name: "延安市",
        value: 359
    },
    {
        name: "铁岭市",
        value: 359
    },
    {
        name: "濮阳市",
        value: 357
    },
    {
        name: "莆田市",
        value: 357
    },
    {
        name: "荆门市",
        value: 349
    },
    {
        name: "内江市",
        value: 349
    },
    {
        name: "通化市",
        value: 349
    },
    {
        name: "营口市",
        value: 348
    },
    {
        name: "曲靖市",
        value: 346
    },
    {
        name: "自贡市",
        value: 345
    },
    {
        name: "凉山彝族自治州",
        value: 345
    },
    {
        name: "遂宁市",
        value: 344
    },
    {
        name: "淮南市",
        value: 342
    },
    {
        name: "娄底市",
        value: 341
    },
    {
        name: "眉山市",
        value: 339
    },
    {
        name: "乌兰察布市",
        value: 334
    },
    {
        name: "咸宁市",
        value: 328
    },
    {
        name: "毕节市",
        value: 327
    },
    {
        name: "亳州市",
        value: 327
    },
    {
        name: "抚顺市",
        value: 323
    },
    {
        name: "河源市",
        value: 323
    },
    {
        name: "百色市",
        value: 321
    },
    {
        name: "马鞍山市",
        value: 320
    },
    {
        name: "晋城市",
        value: 320
    },
    {
        name: "宣城市",
        value: 317
    },
    {
        name: "贵港市",
        value: 316
    },
    {
        name: "广元市",
        value: 312
    },
    {
        name: "铜仁市",
        value: 311
    },
    {
        name: "大理白族自治州",
        value: 310
    },
    {
        name: "庆阳市",
        value: 303
    },
    {
        name: "三门峡市",
        value: 303
    },
    {
        name: "辽阳市",
        value: 299
    },
    {
        name: "恩施土家族苗族自治州",
        value: 299
    },
    {
        name: "松原市",
        value: 294
    },
    {
        name: "天水市",
        value: 292
    },
    {
        name: "鸡西市",
        value: 291
    },
    {
        name: "陇南市",
        value: 289
    },
    {
        name: "巴彦淖尔市",
        value: 287
    },
    {
        name: "黄山市",
        value: 287
    },
    {
        name: "商洛市",
        value: 287
    },
    {
        name: "定西市",
        value: 285
    },
    {
        name: "巴中市",
        value: 284
    },
    {
        name: "玉溪市",
        value: 284
    },
    {
        name: "平凉市",
        value: 284
    },
    {
        name: "资阳市",
        value: 283
    },
    {
        name: "黄石市",
        value: 282
    },
    {
        name: "盘锦市",
        value: 281
    },
    {
        name: "昭通市",
        value: 281
    },
    {
        name: "漯河市",
        value: 280
    },
    {
        name: "楚雄彝族自治州",
        value: 279
    },
    {
        name: "梧州市",
        value: 278
    },
    {
        name: "湘西土家族苗族自治州",
        value: 277
    },
    {
        name: "云浮市",
        value: 270
    },
    {
        name: "阳泉市",
        value: 269
    },
    {
        name: "安康市",
        value: 264
    },
    {
        name: "日照市",
        value: 263
    },
    {
        name: "本溪市",
        value: 262
    },
    {
        name: "白城市",
        value: 258
    },
    {
        name: "双鸭山市",
        value: 249
    },
    {
        name: "白山市",
        value: 246
    },
    {
        name: "阳江市",
        value: 242
    },
    {
        name: "钦州市",
        value: 241
    },
    {
        name: "朔州市",
        value: 240
    },
    {
        name: "伊犁哈萨克自治州",
        value: 240
    },
    {
        name: "崇左市",
        value: 239
    },
    {
        name: "锡林郭勒盟",
        value: 236
    },
    {
        name: "黑河市",
        value: 234
    },
    {
        name: "黔西南布依族苗族自治州",
        value: 230
    },
    {
        name: "池州市",
        value: 230
    },
    {
        name: "铜陵市",
        value: 229
    },
    {
        name: "舟山市",
        value: 228
    },
    {
        name: "雅安市",
        value: 226
    },
    {
        name: "安顺市",
        value: 226
    },
    {
        name: "萍乡市",
        value: 223
    },
    {
        name: "随州市",
        value: 222
    },
    {
        name: "阜新市",
        value: 222
    },
    {
        name: "昌吉回族自治州",
        value: 219
    },
    {
        name: "酒泉市",
        value: 217
    },
    {
        name: "武威市",
        value: 217
    },
    {
        name: "淮北市",
        value: 213
    },
    {
        name: "潮州市",
        value: 212
    },
    {
        name: "汕尾市",
        value: 211
    },
    {
        name: "文山壮族苗族自治州",
        value: 210
    },
    {
        name: "白银市",
        value: 209
    },
    {
        name: "景德镇市",
        value: 208
    },
    {
        name: "普洱市",
        value: 204
    },
    {
        name: "伊春市",
        value: 204
    },
    {
        name: "保山市",
        value: 203
    },
    {
        name: "六盘水市",
        value: 196
    },
    {
        name: "来宾市",
        value: 196
    },
    {
        name: "鹤岗市",
        value: 188
    },
    {
        name: "临夏回族自治州",
        value: 187
    },
    {
        name: "喀什地区",
        value: 185
    },
    {
        name: "辽源市",
        value: 185
    },
    {
        name: "阿克苏地区",
        value: 182
    },
    {
        name: "巴音郭楞蒙古自治州",
        value: 182
    },
    {
        name: "吴忠市",
        value: 181
    },
    {
        name: "攀枝花市",
        value: 181
    },
    {
        name: "贺州市",
        value: 177
    },
    {
        name: "张掖市",
        value: 176
    },
    {
        name: "鹤壁市",
        value: 175
    },
    {
        name: "鹰潭市",
        value: 171
    },
    {
        name: "北海市",
        value: 171
    },
    {
        name: "德宏傣族景颇族自治州",
        value: 162
    },
    {
        name: "张家界市",
        value: 162
    },
    {
        name: "兴安盟",
        value: 159
    },
    {
        name: "临沧市",
        value: 152
    },
    {
        name: "石嘴山市",
        value: 151
    },
    {
        name: "塔城地区",
        value: 149
    },
    {
        name: "阿坝藏族羌族自治州",
        value: 148
    },
    {
        name: "丽江市",
        value: 141
    },
    {
        name: "新余市",
        value: 140
    },
    {
        name: "鄂州市",
        value: 130
    },
    {
        name: "防城港市",
        value: 130
    },
    {
        name: "铜川市",
        value: 130
    },
    {
        name: "西双版纳傣族自治州",
        value: 129
    },
    {
        name: "甘南藏族自治州",
        value: 123
    },
    {
        name: "三亚市",
        value: 122
    },
    {
        name: "中卫市",
        value: 118
    },
    {
        name: "固原市",
        value: 116
    },
    {
        name: "拉萨市",
        value: 114
    },
    {
        name: "七台河市",
        value: 111
    },
    {
        name: "济源市",
        value: 109
    },
    {
        name: "甘孜藏族自治州",
        value: 108
    },
    {
        name: "海西蒙古族藏族自治州",
        value: 104
    },
    {
        name: "海东市",
        value: 102
    },
    {
        name: "仙桃市",
        value: 100
    },
    {
        name: "金昌市",
        value: 99
    },
    {
        name: "天门市",
        value: 97
    },
    {
        name: "潜江市",
        value: 94
    },
    {
        name: "乌海市",
        value: 93
    },
    {
        name: "澳门特别行政区",
        value: 89
    },
    {
        name: "大兴安岭地区",
        value: 88
    },
    {
        name: "文昌市",
        value: 79
    },
    {
        name: "博尔塔拉蒙古自治州",
        value: 78
    },
    {
        name: "日喀则市",
        value: 78
    },
    {
        name: "琼海市",
        value: 77
    },
    {
        name: "克拉玛依市",
        value: 71
    },
    {
        name: "石河子市",
        value: 70
    },
    {
        name: "阿拉善盟",
        value: 70
    },
    {
        name: "和田地区",
        value: 68
    },
    {
        name: "吐鲁番市",
        value: 65
    },
    {
        name: "阿勒泰地区",
        value: 64
    },
    {
        name: "怒江傈僳族自治州",
        value: 64
    },
    {
        name: "澄迈县",
        value: 63
    },
    {
        name: "万宁市",
        value: 62
    },
    {
        name: "哈密市",
        value: 62
    },
    {
        name: "迪庆藏族自治州",
        value: 55
    },
    {
        name: "昌都市",
        value: 49
    },
    {
        name: "海北藏族自治州",
        value: 47
    },
    {
        name: "东方市",
        value: 47
    },
    {
        name: "海南藏族自治州",
        value: 47
    },
    {
        name: "山南市",
        value: 46
    },
    {
        name: "陵水黎族自治县",
        value: 45
    },
    {
        name: "定安县",
        value: 40
    },
    {
        name: "乐东黎族自治县",
        value: 35
    },
    {
        name: "林芝市",
        value: 35
    },
    {
        name: "昌江黎族自治县",
        value: 34
    },
    {
        name: "临高县",
        value: 34
    },
    {
        name: "黄南藏族自治州",
        value: 32
    },
    {
        name: "克孜勒苏柯尔克孜自治州",
        value: 32
    },
    {
        name: "琼中黎族苗族自治县",
        value: 29
    },
    {
        name: "屯昌县",
        value: 29
    },
    {
        name: "玉树藏族自治州",
        value: 29
    },
    {
        name: "阿拉尔市",
        value: 27
    },
    {
        name: "保亭黎族苗族自治县",
        value: 26
    },
    {
        name: "那曲市",
        value: 25
    },
    {
        name: "果洛藏族自治州",
        value: 24
    },
    {
        name: "五家渠市",
        value: 24
    },
    {
        name: "白沙黎族自治县",
        value: 23
    },
    {
        name: "阿里地区",
        value: 20
    },
    {
        name: "神农架林区",
        value: 19
    },
    {
        name: "北屯市",
        value: 17
    },
    {
        name: "五指山市",
        value: 15
    },
    {
        name: "图木舒克市",
        value: 13
    },
    {
        name: "铁门关市",
        value: 8
    },
    {
        name: "双河市",
        value: 7
    },
    {
        name: "可克达拉市",
        value: 6
    },
    {
        name: "三沙市",
        value: 3
    },
    {
        name: "昆玉市",
        value: 2
    },
    {
        name: "东莞市",
        value: 1
    }
];

var convertData = function(data) {
    var res = [];
    for (var i = 0; i < data.length; i++) {
        var geoCoord = geoCoordMap[data[i].name];
        if (geoCoord) {
            res.push({
                name: data[i].name,
                value: geoCoord.concat(data[i].value)
            });
        }
    }
    return res;
};

var convertedData = [
    convertData(data),
    convertData(data.sort(function(a, b) {
        return b.value - a.value;
    }).slice(0, 6))
];


option = {
    backgroundColor: '#404a59',
    animation: true,
    animationDuration: 1000,
    animationEasing: 'cubicInOut',
    animationDurationUpdate: 1000,
    animationEasingUpdate: 'cubicInOut',
    title: [{
            text: '全国主要城市商业银行网点分布情况',
            subtext: '不包含ATM',
            sublink: 'https://www.cbirc.gov.cn/cn/view/pages/tongjishuju/tongjishuju.html',
            left: 'center',
            textStyle: {
                color: '#fff'
            }
        },
        {
            id: 'statistic',
            right: 120,
            top: 40,
            width: 100,
            textStyle: {
                color: '#fff',
                fontSize: 16
            }
        }
    ],
    toolbox: {
        iconStyle: {
            normal: {
                borderColor: '#fff'
            },
            emphasis: {
                borderColor: '#b1e4ff'
            }
        }
    },
    brush: {
        outOfBrush: {
            color: '#abc'
        },
        brushStyle: {
            borderWidth: 2,
            color: 'rgba(0,0,0,0.2)',
            borderColor: 'rgba(0,0,0,0.5)',
        },
        seriesIndex: [0, 1],
        throttleType: 'debounce',
        throttleDelay: 300,
        geoIndex: 0
    },
    geo: {
        map: 'china',
        left: '10',
        right: '35%',
        center: [117.98561551896913, 31.205000490896193],
        zoom: 2.5,
        label: {
            emphasis: {
                show: false
            }
        },
        roam: true,
        itemStyle: {
            normal: {
                areaColor: '#323c48',
                borderColor: '#111'
            },
            emphasis: {
                areaColor: '#2a333d'
            }
        }
    },
    tooltip: {
        trigger: 'item',
        //formatter: '{b0}: {c0}<br />{b1}: {c1}'
    },
    grid: {
        right: 40,
        top: 100,
        bottom: 40,
        width: '30%'
    },
    xAxis: {
        type: 'value',
        scale: true,
        position: 'top',
        boundaryGap: false,
        splitLine: {
            show: false
        },
        axisLine: {
            show: false
        },
        axisTick: {
            show: false
        },
        axisLabel: {
            margin: 2,
            textStyle: {
                color: '#aaa'
            }
        },
    },
    yAxis: {
        type: 'category',
        name: 'TOP 20',
        nameGap: 16,
        axisLine: {
            show: false,
            lineStyle: {
                color: '#ddd'
            }
        },
        axisTick: {
            show: false,
            lineStyle: {
                color: '#ddd'
            }
        },
        axisLabel: {
            interval: 0,
            textStyle: {
                color: '#ddd'
            }
        },
        data: []
    },
    series: [{
            name: '辖区内商业银行网点数量',
            type: 'scatter',
            coordinateSystem: 'geo',
            data: convertedData[0],
            symbolSize: function(val) {
                return Math.max(val[2] / 50, 8);
            },
            label: {
                normal: {
                    formatter: '{b}',
                    position: 'right',
                    show: false
                },
                emphasis: {
                    show: true
                }
            },
            itemStyle: {
                normal: {
                    color: '#ddb926'
                }
            },
            tooltip: {
                //trigger: 'item',
                //formatter: '{a}<br />{b}: {c}<br />',
                formatter: function(params, ticket, callback) {
                    //console.log(params);
                    //var showHtm = params.seriesName + '<br />' + params.name + '辖区内商业银行网点数量:' + params.value[2];
                    var showHtm = params.name + params.seriesName + ':' + params.value[2] + '<br />';
                    //
                    return showHtm;
                },
            },
        },
        {
            name: 'Top 5',
            type: 'effectScatter',
            coordinateSystem: 'geo',
            data: convertedData[1],
            symbolSize: function(val) {
                return Math.max(val[2] / 50, 8);
            },
            showEffectOn: 'emphasis',
            rippleEffect: {
                brushType: 'stroke'
            },
            hoverAnimation: true,
            label: {
                normal: {
                    formatter: '{b}',
                    position: 'right',
                    show: true
                }
            },
            itemStyle: {
                normal: {
                    color: '#f4e925',
                    shadowBlur: 10,
                    shadowColor: '#333'
                }
            },
            tooltip: {
                //trigger: 'item',
                //formatter: '{a}<br />{b}: {c}<br />',
                formatter: function(params, ticket, callback) {
                    console.log(params);
                    var showHtm = params.seriesName + '<br />' + params.name + '辖区内商业银行网点数量:' + params.value[2];
                    //var showHtm = params.name + params.seriesName + ':' + params.value[2] + '<br />';
                    return showHtm;
                },
            },
            zlevel: 1
        },
        {
            id: 'bar',
            zlevel: 2,
            type: 'bar',
            symbol: 'none',
            itemStyle: {
                normal: {
                    color: '#ddb926'
                }
            },
            data: []
        }
    ]
};


myChart.on('brushselected', renderBrushed);

// myChart.setOption(option);

setTimeout(function() {
    myChart.dispatchAction({
        type: 'brush',
        areas: [{
            geoIndex: 0,
            brushType: 'polygon',
            coordRange: [
                [119.72, 34.85],
                [119.68, 34.85],
                [119.5, 34.84],
                [119.19, 34.77],
                [118.76, 34.63],
                [118.6, 34.6],
                [118.46, 34.6],
                [118.33, 34.57],
                [118.05, 34.56],
                [117.6, 34.56],
                [117.41, 34.56],
                [117.25, 34.56],
                [117.11, 34.56],
                [117.02, 34.56],
                [117, 34.56],
                [116.94, 34.56],
                [116.94, 34.55],
                [116.9, 34.5],
                [116.88, 34.44],
                [116.88, 34.37],
                [116.88, 34.33],
                [116.88, 34.24],
                [116.92, 34.15],
                [116.98, 34.09],
                [117.05, 34.06],
                [117.19, 33.96],
                [117.29, 33.9],
                [117.43, 33.8],
                [117.49, 33.75],
                [117.54, 33.68],
                [117.6, 33.65],
                [117.62, 33.61],
                [117.64, 33.59],
                [117.68, 33.58],
                [117.7, 33.52],
                [117.74, 33.5],
                [117.74, 33.46],
                [117.8, 33.44],
                [117.82, 33.41],
                [117.86, 33.37],
                [117.9, 33.3],
                [117.9, 33.28],
                [117.9, 33.27],
                [118.09, 32.97],
                [118.21, 32.7],
                [118.29, 32.56],
                [118.31, 32.5],
                [118.35, 32.46],
                [118.35, 32.42],
                [118.35, 32.36],
                [118.35, 32.34],
                [118.37, 32.24],
                [118.37, 32.14],
                [118.37, 32.09],
                [118.44, 32.05],
                [118.46, 32.01],
                [118.54, 31.98],
                [118.6, 31.93],
                [118.68, 31.86],
                [118.72, 31.8],
                [118.74, 31.78],
                [118.76, 31.74],
                [118.78, 31.7],
                [118.82, 31.64],
                [118.82, 31.62],
                [118.86, 31.58],
                [118.86, 31.55],
                [118.88, 31.54],
                [118.88, 31.52],
                [118.9, 31.51],
                [118.91, 31.48],
                [118.93, 31.43],
                [118.95, 31.4],
                [118.97, 31.39],
                [118.97, 31.37],
                [118.97, 31.34],
                [118.97, 31.27],
                [118.97, 31.21],
                [118.97, 31.17],
                [118.97, 31.12],
                [118.97, 31.02],
                [118.97, 30.93],
                [118.97, 30.87],
                [118.97, 30.85],
                [118.95, 30.8],
                [118.95, 30.77],
                [118.95, 30.76],
                [118.93, 30.7],
                [118.91, 30.63],
                [118.91, 30.61],
                [118.91, 30.6],
                [118.9, 30.6],
                [118.88, 30.54],
                [118.88, 30.51],
                [118.86, 30.51],
                [118.86, 30.46],
                [118.72, 30.18],
                [118.68, 30.1],
                [118.66, 30.07],
                [118.62, 29.91],
                [118.56, 29.73],
                [118.52, 29.63],
                [118.48, 29.51],
                [118.44, 29.42],
                [118.44, 29.32],
                [118.43, 29.19],
                [118.43, 29.14],
                [118.43, 29.08],
                [118.44, 29.05],
                [118.46, 29.05],
                [118.6, 28.95],
                [118.64, 28.94],
                [119.07, 28.51],
                [119.25, 28.41],
                [119.36, 28.28],
                [119.46, 28.19],
                [119.54, 28.13],
                [119.66, 28.03],
                [119.78, 28],
                [119.87, 27.94],
                [120.03, 27.86],
                [120.17, 27.79],
                [120.23, 27.76],
                [120.3, 27.72],
                [120.42, 27.66],
                [120.52, 27.64],
                [120.58, 27.63],
                [120.64, 27.63],
                [120.77, 27.63],
                [120.89, 27.61],
                [120.97, 27.6],
                [121.07, 27.59],
                [121.15, 27.59],
                [121.28, 27.59],
                [121.38, 27.61],
                [121.56, 27.73],
                [121.73, 27.89],
                [122.03, 28.2],
                [122.3, 28.5],
                [122.46, 28.72],
                [122.5, 28.77],
                [122.54, 28.82],
                [122.56, 28.82],
                [122.58, 28.85],
                [122.6, 28.86],
                [122.61, 28.91],
                [122.71, 29.02],
                [122.73, 29.08],
                [122.93, 29.44],
                [122.99, 29.54],
                [123.03, 29.66],
                [123.05, 29.73],
                [123.16, 29.92],
                [123.24, 30.02],
                [123.28, 30.13],
                [123.32, 30.29],
                [123.36, 30.36],
                [123.36, 30.55],
                [123.36, 30.74],
                [123.36, 31.05],
                [123.36, 31.14],
                [123.36, 31.26],
                [123.38, 31.42],
                [123.46, 31.74],
                [123.48, 31.83],
                [123.48, 31.95],
                [123.46, 32.09],
                [123.34, 32.25],
                [123.22, 32.39],
                [123.12, 32.46],
                [123.07, 32.48],
                [123.05, 32.49],
                [122.97, 32.53],
                [122.91, 32.59],
                [122.83, 32.81],
                [122.77, 32.87],
                [122.71, 32.9],
                [122.56, 32.97],
                [122.38, 33.05],
                [122.3, 33.12],
                [122.26, 33.15],
                [122.22, 33.21],
                [122.22, 33.3],
                [122.22, 33.39],
                [122.18, 33.44],
                [122.07, 33.56],
                [121.99, 33.69],
                [121.89, 33.78],
                [121.69, 34.02],
                [121.66, 34.05],
                [121.64, 34.08]
            ]
        }]
    });
}, 0);


function renderBrushed(params) {
    var mainSeries = params.batch[0].selected[0];

    var selectedItems = [];
    var categoryData = [];
    var barData = [];
    var maxBar = 30;
    var sum = 0;
    var count = 0;

    for (var i = 0; i < mainSeries.dataIndex.length; i++) {
        var rawIndex = mainSeries.dataIndex[i];
        var dataItem = convertedData[0][rawIndex];
        var pmValue = dataItem.value[2];

        sum += pmValue;
        count++;

        selectedItems.push(dataItem);
    }

    selectedItems.sort(function(a, b) {
        return a.value[2] - b.value[2];
    });

    for (var i = 0; i < Math.min(selectedItems.length, maxBar); i++) {
        categoryData.push(selectedItems[i].name);
        barData.push(selectedItems[i].value[2]);
    }

    this.setOption({
        yAxis: {
            data: categoryData
        },
        xAxis: {
            axisLabel: {
                show: !!count
            }
        },
        title: {
            id: 'statistic',
            text: count ? '平均: ' + (sum / count).toFixed(0) : ''
        },
        series: {
            id: 'bar',
            data: barData
        }
    });
}