option = {
    baseOption: {
        timeline: {
            axisType: 'category',
            // realtime: false,
            // loop: false,
            autoPlay: true,
            // currentIndex: 2,
            playInterval: 1000,
            // controlStyle: {
            //     position: 'left'
            // },
            data: [
                '0°','45°','90°', '135°', '180°'
            ],
        },
        
        
        
        title: {
            subtext: '测试数据'
        },
        tooltip: {
        },
        legend: {
            left: 'right',
            data: ['1级浪', '2级浪', '3级浪', '4级浪', '5级浪', '6级浪'],
            selected: {
                '4级浪': false, '5级浪': false, '6级浪': false
            }
        },
        // calculable : true,
        grid: {
            top: 80,
            bottom: 100,
            tooltip: {
                trigger: 'axis',
                axisPointer: {
                    type: 'shadow',
                    // label: {
                    //     show: true,
                    //     formatter: function (params) {
                    //         return params.value.replace('\n', '');
                    //     }
                    // }
                }
            }
        },
        xAxis: [
            {
                'type':'value',
                'axisLabel':{'interval':'aotu'},
                'data':[
                    10,12,13,14,15,16,17,18,19
                ],
                splitLine: {show: false}
            }
        ],
        yAxis: [
            {
                type: 'value',
                name: '轴功率（kw）'
            }
        ],
        series: [
            {name: '4级浪', type: 'line'},
            {name: '5级浪', type: 'line'},
            {name: '6级浪', type: 'line'},
            {name: '1级浪', type: 'line'},
            {name: '2级浪', type: 'line'},
            {name: '3级浪', type: 'line'},
        ]
    },
    options: [
        {
            title: {text: '浪向0°,不同浪高下航速轴功率'},
            series : [
                {data: [[1,2],[2,5],[3,5], [14,6],[15,7]]},
                {data: [[1,4],[2,5],[3,7], [4,9],[5,17]]},
                {data: [[1,3],[2,2],[3,6], [4,16],[5,20]]},
                {data: [[1,1],[2,10],[3,4], [4,18],[5,21]]},
                {data: [[1,12],[2,6],[3,19], [4,25],[5,17]]},
                {data: [[1,4],[2,13],[3,17], [4,19],[5,11]]},
            ]
        },
        {
            title : {text: '浪向45°,不同浪高下航速轴功率'},
            series : [
                {data: [[1,2],[2,5],[3,5], [4,6],[5,7]]},
                {data: [[1,4],[2,5],[3,7], [4,9],[5,17]]},
                {data: [[1,3],[2,2],[3,6], [4,16],[5,20]]},
                {data: [[1,1],[2,10],[3,4], [4,18],[5,21]]},
                {data: [[1,12],[2,6],[3,19], [4,25],[5,17]]},
                {data: [[1,4],[2,13],[3,17], [4,19],[5,11]]},
            ]
        },
        {
            title : {text: '浪向90°,不同浪高下航速轴功率'},
            series : [
                {data: [[1,2],[2,5],[3,5], [4,6],[5,7]]},
                {data: [[1,4],[2,5],[3,7], [4,9],[5,17]]},
                {data: [[1,3],[2,2],[3,6], [4,16],[5,20]]},
                {data: [[1,1],[2,10],[3,4], [4,18],[5,21]]},
                {data: [[1,12],[2,6],[3,19], [4,25],[5,17]]},
                {data: [[1,4],[2,13],[3,17], [4,19],[5,11]]},
            ]
        },
        {
            title : {text: '浪向135°,不同浪高下航速轴功率'},
            series : [
                {data: [[1,2],[2,5],[3,5], [4,6],[5,7]]},
                {data: [[1,4],[2,5],[3,7], [4,9],[5,17]]},
                {data: [[1,3],[2,2],[3,6], [4,16],[5,20]]},
                {data: [[1,1],[2,10],[3,4], [4,18],[5,21]]},
                {data: [[1,12],[2,6],[3,19], [4,25],[5,17]]},
                {data: [[1,4],[2,13],[3,17], [4,19],[5,11]]},
            ]
        },
        {
            title : {text: '浪向180°,不同浪高下航速轴功率'},
            series : [
                {data: [[1,2],[2,5],[3,5], [4,6],[5,7]]},
                {data: [[1,4],[2,5],[3,7], [4,9],[5,17]]},
                {data: [[1,3],[2,2],[3,6], [4,16],[5,20]]},
                {data: [[1,1],[2,10],[3,4], [4,18],[5,21]]},
                {data: [[1,12],[2,6],[3,19], [4,25],[5,17]]},
                {data: [[1,4],[2,13],[3,17], [4,19],[5,11]]},
            ]
        },

    ]
};



console.log(JSON.stringify(option));
