var uploadedDataURL = "/asset/get/s/data-1480404354615-H1jtpscGe.csv";

option = {
    title: {
        text: '商用驾驶员年龄结构图'
    },
    tooltip: {
        trigger: 'axis'
    },
    legend: {
        data: ['商用驾驶员']
    },
    toolbox: {
        feature: {
            saveAsImage: {}
        }
    },
    grid: {
        left: '3%',
        right: '4%',
        bottom: '3%',
        containLabel: true
    },
    xAxis: [{
        type: 'category',
        boundaryGap: false,
        data: ['1940年', '1941年', '1942年', '1943年', '1944年', '1945年', '1946年', '1947年', '1948年', '1949年', '1950年', '1951年', '1952年', '1953年', '1954年', '1955年', '1956年', '1957年', '1958年', '1959年', '1960年', '1961年', '1962年', '1963年', '1964年', '1965年', '1966年', '1967年', '1968年', '1969年', '1970年', '1971年', '1972年', '1973年', '1974年', '1975年', '1976年', '1977年', '1978年', '1979年', '1980年', '1981年', '1982年', '1983年', '1984年', '1985年', '1986年', '1987年', '1988年', '1989年', '1990年', '1991年', '1992年', '1993年', '1994年', '1995年', '1996年', '1997年', '1998年', '1999年']
    }],
    yAxis: [{
        type: 'value'
    }],
    series: [{
        name: '年龄',
        type: 'line',
        stack: '总量',
        label: {
            normal: {
                show: true,
                position: 'top'
            }
        },
        areaStyle: {
            normal: {}
        },
        data: [3, 2, 5, 8, 5, 8, 9, 15, 52, 80, 74, 43, 19, 11, 7, 9, 10, 30, 38, 39, 70, 59, 84, 69, 63, 65, 72, 50, 43, 38, 53, 81, 77, 81, 73, 70, 58, 88, 93, 100, 145, 266, 498, 666, 910, 1188, 1689, 2320, 2713, 3185, 2996, 2416, 2341, 1864, 995, 82, 41, 10, 3, 0]
    }]
};