app.title = '坐标轴刻度与标签对齐';

option = {
    color: ['#3398DB'],
    tooltip : {
        trigger: 'axis',
        axisPointer : {            // 坐标轴指示器，坐标轴触发有效
            type : 'shadow'        // 默认为直线，可选为：'line' | 'shadow'
        }
    },
    grid: {
        left: '3%',
        right: '4%',
        bottom: '3%',
        containLabel: true
    },
    
    xAxis : [
        {
            type : 'category',
            data : ['山东', '黑龙江', '河南', '辽宁', '北京', '内蒙古', '甘肃', '山西', '天津', '吉林', '河北', '西藏', '湖北', '宁夏', '青海', '陕西', '全国', '安徽', '江西', '广东', '贵州', '福建', '湖南', '云南', '新疆', '上海', '重庆', '广西', '江苏', '海南', '四川', '浙江'],
            axisTick: {
                alignWithLabel: true
            },
            axisLabel: {
            inside: false,   //是否将横坐标轴显示在图标内部
            interval:0,     //设置参数为零，表示显示全部横坐标
            }
                    }
    ],
    
    yAxis : [
        {
            type : 'value'
        }
    ],
  
    series : [
        {
            name:'直接访问',
            type:'bar',
            barWidth: '60%',
            data:[106.1173488, 93.34658209, 85.39692676, 80.46706285, 79.25879917, 74.98583715, 65.77800804, 61.82013093, 51.40669274, 48.4806222, 42.20625381, 40.08747292, 39.21618093, 38.96031007, 38.56074804, 36.64113083, 33.25327388, 28.80924546, 28.62753991, 28.56046864, 26.17076387, 25.74879971, 24.48147056, 24.43498091, 24.34356363, 23.21030984, 21.73619447, 21.26431361, 20.9306171, 18.26132572, 16.73460579, 13.58280265],
        }
    ]
};
