var uploadedDataURL = "/asset/get/s/data-1583818121222-hIrduHxY.json";
var zoneCoord = {
    安海镇: [118.479665292, 24.7189556157999],
    白濑乡: [118.012875373, 25.3026246903],
    百崎回族乡: [118.719077059, 24.8782841845],
    宝盖镇: [118.649632608999, 24.746227161],
    北峰街道: [118.570885875, 24.9641376516],
    参内乡: [118.230218837, 25.0826903186999],
    常泰街道: [118.514386914, 24.9157935948999],
    陈埭镇: [118.610607847, 24.8350711665999],
    呈祥乡: [118.146438751999, 25.44720359],
    城东街道: [118.642850083, 24.917628299],
    城厢镇: [118.178565285999, 25.0448412769],
    池店镇: [118.563849446, 24.8623430805],
    赤水镇: [118.153455282, 25.6416790327999],
    崇武镇: [118.928223779, 24.892819758],
    春美乡: [118.008729332, 25.7091975043999],
    磁灶镇: [118.488008861, 24.8224779009],
    达埔镇: [118.129758478, 25.3123738910999],
    大铭乡: [118.072276626, 25.7126425916],
    大坪乡: [117.953716075, 24.8988616599],
    东关镇: [118.393794406, 25.3034799675],
    东海街道: [118.643483371, 24.8817555705999],
    东湖街道: [118.607306634, 24.9171729557],
    东岭镇: [118.89963895, 24.9732056506999],
    东平镇: [118.335368566, 25.298489962],
    东桥镇: [118.897837786, 25.014292737],
    东石镇: [118.487950305, 24.6551583024999],
    东田镇: [118.283780484, 24.8890608323],
    东园镇: [118.740563023, 24.9079103372999],
    丰泽街道: [118.603106238, 24.8975907242],
    丰州镇: [118.51611025, 24.9855153464],
    峰尾镇: [118.935105013, 25.1214874608],
    凤城镇: [118.177792745, 25.068567898],
    凤里街道: [118.620936902, 24.7388353370999],
    浮桥街道: [118.544021675, 24.9330170891],
    福田乡: [117.648598178, 25.2500477542999],
    盖德镇: [118.142595576999, 25.5199243426],
    感德镇: [117.804676206, 25.3102962687],
    葛坑镇: [118.204033233, 25.8503825083999],
    官桥镇: [118.392, 24.832],
    桂阳乡: [118.267384673, 25.7725532283],
    桂洋镇: [118.06817872, 25.4905921257],
    国宝乡: [118.19241019, 25.58852783],
    国有山腰盐场: [118.904042296, 25.1088484502999],
    海滨街道: [118.57514903, 24.9094010289],
    蚶江镇: [118.683181898, 24.7714584022],
    河市镇: [118.626629356, 25.0667805323],
    横口乡: [117.884918162, 25.4301303762999],
    虹山乡: [118.581715133, 25.2747474732],
    洪濑镇: [118.533471377, 25.0514125784],
    洪梅镇: [118.543911562999, 25.1387470493999],
    鸿山镇: [118.741229975, 24.7473782086999],
    后龙镇: [118.936454789, 25.1587726746],
    湖滨街道: [118.637013190999, 24.7358562054999],
    湖上乡: [117.974196212, 25.2601983345999],
    湖头镇: [118.043454771, 25.2304070219],
    湖洋镇: [118.427870334, 25.3869426101999],
    虎邱镇: [117.943968105, 24.9648692109],
    岵山镇: [118.249847059999, 25.2657777756],
    华大街道: [118.633699053, 24.9407542671],
    黄塘镇: [118.696327379, 25.0222611901999],
    剑斗镇: [117.939977465, 25.3365866456999],
    江南街道: [118.552529039, 24.8922453978],
    介福乡: [118.323039478, 25.4288616432999],
    界山镇: [118.886481116, 25.2216488607],
    金城镇: [118.316456208, 24.4110746439999],
    金谷镇: [118.111559041, 25.2054107573999],
    金湖镇: [118.418011976, 24.4418619751999],
    金井镇: [118.603675232, 24.5721892400999],
    金龙街道: [118.536231724999, 24.9049805792999],
    金宁乡: [118.332405534, 24.4517401827999],
    金沙镇: [118.425045509, 24.4844842137],
    金淘镇: [118.335220344, 25.1196934061],
    锦斗镇: [118.099555667, 25.4334705726999],
    锦尚镇: [118.719337411, 24.7260361177],
    净峰镇: [118.971587759, 24.9994398850999],
    九都镇: [118.421143352, 25.22514155],
    开元街道: [118.586395908, 24.921514152],
    康美镇: [118.457950338, 25.0441811879],
    坑仔口镇: [117.996135133, 25.4281412057999],
    魁斗镇: [118.168964097, 25.1324687090999],
    蓝田乡: [117.862038287999, 25.1156599806],
    乐峰镇: [118.540456811, 25.2229714537],
    雷峰镇: [118.279346749, 25.6028013694],
    鲤中街道: [118.585750624, 24.9118562272],
    烈屿乡: [118.23740917, 24.4277845255],
    临江街道: [118.582740239, 24.8973723778],
    灵秀镇: [118.603889162, 24.7354003495],
    灵源街道: [118.526179928, 24.7396343986],
    柳城街道: [118.401564842, 24.9158204973999],
    龙湖镇: [118.610709052, 24.6737699653],
    龙涓乡: [117.724903342999, 24.9434313888],
    龙门滩镇: [118.394739054, 25.5042868819],
    龙门镇: [118.076719598, 24.9354473365],
    龙浔镇: [118.221751106, 25.468312597],
    芦田镇: [117.81682005, 25.0448186664999],
    仑苍镇: [118.296058664, 25.0239189756],
    罗东镇: [118.482007896, 25.1750559406999],
    罗山街道: [118.55579251, 24.7701413795999],
    罗溪镇: [118.627972568999, 25.2340915394],
    螺城镇: [118.790661579, 25.0496469974999],
    螺阳镇: [118.781380854999, 24.9880468355],
    洛阳镇: [118.698722555, 24.9595932766],
    马甲镇: [118.623983395, 25.137024402],
    码头镇: [118.357286439, 25.1917912663999],
    眉山乡: [118.280443527, 25.0900445330999],
    梅岭街道: [118.565185903, 24.8224318697999],
    梅山镇: [118.453517109, 25.1152117494],
    美湖镇: [118.067518893, 25.5915214173999],
    美林街道: [118.393846333, 24.9954559886],
    南埕镇: [118.378884873999, 25.6357027008],
    南埔镇: [118.92002393, 25.1854669344],
    内坑镇: [118.462495469999, 24.7799449759999],
    蓬壶镇: [118.143871731, 25.3832465041],
    蓬华镇: [118.181964906999, 25.2057116798999],
    蓬莱镇: [118.055142557, 25.1159817318],
    前黄镇: [118.866183578, 25.1457929964],
    青阳街道: [118.574787764, 24.8029232013999],
    清源街道: [118.598758618, 24.9476138600999],
    泉秀街道: [118.594278691, 24.8851405624999],
    三班镇: [118.287226937, 25.4496560794],
    山霞镇: [118.872548394, 24.9229858477],
    山腰街道: [118.879252488, 25.1174416144],
    上涌镇: [118.164545903, 25.729364869],
    尚卿乡: [117.960658967, 25.1354791794],
    深沪镇: [118.645383163, 24.6133068641999],
    省新镇: [118.382659063, 25.0424694945],
    诗山镇: [118.262966062, 25.1935455397],
    石鼓镇: [118.23196985, 25.3320986589],
    石井镇: [118.379034511, 24.6336694877],
    双阳街道: [118.616714101, 24.9913518972],
    水口镇: [118.414005586, 25.7237427628999],
    水头镇: [118.379044933, 24.7258622081],
    苏坑镇: [118.198931136, 25.4311749771],
    汤头乡: [118.092718782, 25.8244579943999],
    桃城镇: [118.322044338, 25.3472208811],
    桃舟乡: [117.75251494, 25.3680272701],
    涂岭镇: [118.791886178, 25.1655508903999],
    涂寨镇: [118.839507549, 24.9847077643],
    外山乡: [118.475313333, 25.3244105544999],
    万安街道: [118.656326779, 24.9570928322999],
    辋川镇: [118.831459471, 25.0714239711],
    乌坵乡: [119.447969689, 24.9993677605999],
    吾峰镇: [118.233057078, 25.3920248085999],
    五里街镇: [118.286820878, 25.3715033303999],
    西滨镇: [118.631904320999, 24.7940524304999],
    西坪镇: [117.900801043, 25.0079576153999],
    西园街道: [118.535352223, 24.8188245509999],
    溪美街道: [118.346044791, 24.9548762711],
    霞美镇: [118.470195860999, 24.9351975131999],
    下洋镇: [117.963284877, 25.4896791522],
    仙夹镇: [118.203118047999, 25.2488691173],
    祥华乡: [117.720719917, 25.1643856259],
    祥芝镇: [118.73156371, 24.7661617951],
    翔云镇: [118.163584728999, 24.955816013],
    向阳乡: [118.479096829, 25.2751937302],
    小岞镇: [118.997172703999, 24.9553012422],
    新塘街道: [118.599801596, 24.7740755945],
    浔中镇: [118.233670559999, 25.5193725952999],
    杨梅乡: [118.305492998, 25.8827184525],
    一都镇: [117.780620906, 25.4561049705],
    英都镇: [118.227576154, 24.9552921905],
    英林镇: [118.563131098, 24.6190857648],
    永和镇: [118.557262691999, 24.6943604325],
    永宁镇: [118.689297018, 24.6983686316],
    玉斗镇: [118.044551852, 25.3766792726],
    张坂镇: [118.801800074, 24.907592807],
    长坑乡: [117.861286315, 25.2031296582],
    紫帽镇: [118.502210786, 24.8785187018],
    紫山镇: [118.73147427, 25.0803439224999],
};
var newOD = [{
        from: '东田镇',
        to: '丰州镇',
        value: 10.5714285714286
    },
    {
        from: '东田镇',
        to: '官桥镇',
        value: 49.1428571428571
    },
    {
        from: '东田镇',
        to: '洪濑镇',
        value: 18.5
    },
    {
        from: '东田镇',
        to: '洪梅镇',
        value: 5
    },
    {
        from: '东田镇',
        to: '金淘镇',
        value: 17
    },
    {
        from: '东田镇',
        to: '九都镇',
        value: 5
    },
    {
        from: '东田镇',
        to: '康美镇',
        value: 80.5714285714286
    },
    {
        from: '东田镇',
        to: '乐峰镇',
        value: 5
    },
    {
        from: '东田镇',
        to: '柳城街道',
        value: 420.428571428571
    },
    {
        from: '东田镇',
        to: '仑苍镇',
        value: 339.428571428571
    },
    {
        from: '东田镇',
        to: '罗东镇',
        value: 10.8
    },
    {
        from: '东田镇',
        to: '码头镇',
        value: 9.66666666666667
    },
    {
        from: '东田镇',
        to: '眉山乡',
        value: 5
    },
    {
        from: '东田镇',
        to: '梅山镇',
        value: 8.71428571428571
    },
    {
        from: '东田镇',
        to: '美林街道',
        value: 338.142857142857
    },
    {
        from: '东田镇',
        to: '蓬华镇',
        value: 5
    },
    {
        from: '东田镇',
        to: '省新镇',
        value: 61
    },
    {
        from: '东田镇',
        to: '诗山镇',
        value: 6
    },
    {
        from: '东田镇',
        to: '石井镇',
        value: 96
    },
    {
        from: '东田镇',
        to: '水头镇',
        value: 203.714285714286
    },
    {
        from: '东田镇',
        to: '溪美街道',
        value: 1887.42857142857
    },
    {
        from: '东田镇',
        to: '霞美镇',
        value: 68.1428571428571
    },
    {
        from: '东田镇',
        to: '翔云镇',
        value: 8.85714285714286
    },
    {
        from: '东田镇',
        to: '英都镇',
        value: 228.857142857143
    },
    {
        from: '丰州镇',
        to: '东田镇',
        value: 9.14285714285714
    },
    {
        from: '丰州镇',
        to: '官桥镇',
        value: 531.285714285714
    },
    {
        from: '丰州镇',
        to: '洪濑镇',
        value: 786
    },
    {
        from: '丰州镇',
        to: '洪梅镇',
        value: 45
    },
    {
        from: '丰州镇',
        to: '金淘镇',
        value: 82.4285714285714
    },
    {
        from: '丰州镇',
        to: '九都镇',
        value: 12.1428571428571
    },
    {
        from: '丰州镇',
        to: '康美镇',
        value: 2883
    },
    {
        from: '丰州镇',
        to: '乐峰镇',
        value: 34.4285714285714
    },
    {
        from: '丰州镇',
        to: '柳城街道',
        value: 442.857142857143
    },
    {
        from: '丰州镇',
        to: '仑苍镇',
        value: 91.4285714285714
    },
    {
        from: '丰州镇',
        to: '罗东镇',
        value: 48.1428571428571
    },
    {
        from: '丰州镇',
        to: '码头镇',
        value: 79.4285714285714
    },
    {
        from: '丰州镇',
        to: '眉山乡',
        value: 5
    },
    {
        from: '丰州镇',
        to: '梅山镇',
        value: 182.571428571429
    },
    {
        from: '丰州镇',
        to: '美林街道',
        value: 520.142857142857
    },
    {
        from: '丰州镇',
        to: '蓬华镇',
        value: 5
    },
    {
        from: '丰州镇',
        to: '省新镇',
        value: 121.142857142857
    },
    {
        from: '丰州镇',
        to: '诗山镇',
        value: 43.7142857142857
    },
    {
        from: '丰州镇',
        to: '石井镇',
        value: 40.2857142857143
    },
    {
        from: '丰州镇',
        to: '水头镇',
        value: 1226.85714285714
    },
    {
        from: '丰州镇',
        to: '溪美街道',
        value: 127.857142857143
    },
    {
        from: '丰州镇',
        to: '霞美镇',
        value: 10369.1428571429
    },
    {
        from: '丰州镇',
        to: '翔云镇',
        value: 5
    },
    {
        from: '丰州镇',
        to: '向阳乡',
        value: 5
    },
    {
        from: '丰州镇',
        to: '英都镇',
        value: 13.5
    },
    {
        from: '官桥镇',
        to: '东田镇',
        value: 44.8571428571429
    },
    {
        from: '官桥镇',
        to: '丰州镇',
        value: 515.428571428571
    },
    {
        from: '官桥镇',
        to: '洪濑镇',
        value: 52
    },
    {
        from: '官桥镇',
        to: '洪梅镇',
        value: 7
    },
    {
        from: '官桥镇',
        to: '金淘镇',
        value: 29.2857142857143
    },
    {
        from: '官桥镇',
        to: '康美镇',
        value: 98.5714285714286
    },
    {
        from: '官桥镇',
        to: '乐峰镇',
        value: 9.4
    },
    {
        from: '官桥镇',
        to: '柳城街道',
        value: 2925.28571428571
    },
    {
        from: '官桥镇',
        to: '仑苍镇',
        value: 50.4285714285714
    },
    {
        from: '官桥镇',
        to: '罗东镇',
        value: 13.8571428571429
    },
    {
        from: '官桥镇',
        to: '码头镇',
        value: 17.8571428571429
    },
    {
        from: '官桥镇',
        to: '眉山乡',
        value: 5
    },
    {
        from: '官桥镇',
        to: '梅山镇',
        value: 32.4285714285714
    },
    {
        from: '官桥镇',
        to: '美林街道',
        value: 307.142857142857
    },
    {
        from: '官桥镇',
        to: '蓬华镇',
        value: 6.2
    },
    {
        from: '官桥镇',
        to: '省新镇',
        value: 100.142857142857
    },
    {
        from: '官桥镇',
        to: '诗山镇',
        value: 16.1428571428571
    },
    {
        from: '官桥镇',
        to: '石井镇',
        value: 333.142857142857
    },
    {
        from: '官桥镇',
        to: '水头镇',
        value: 7749
    },
    {
        from: '官桥镇',
        to: '溪美街道',
        value: 227.142857142857
    },
    {
        from: '官桥镇',
        to: '霞美镇',
        value: 989.285714285714
    },
    {
        from: '官桥镇',
        to: '翔云镇',
        value: 8.66666666666667
    },
    {
        from: '官桥镇',
        to: '英都镇',
        value: 7.28571428571429
    },
    {
        from: '洪濑镇',
        to: '东田镇',
        value: 22.4285714285714
    },
    {
        from: '洪濑镇',
        to: '丰州镇',
        value: 730.571428571429
    },
    {
        from: '洪濑镇',
        to: '官桥镇',
        value: 52.5714285714286
    },
    {
        from: '洪濑镇',
        to: '洪梅镇',
        value: 1940.14285714286
    },
    {
        from: '洪濑镇',
        to: '金淘镇',
        value: 91.1428571428571
    },
    {
        from: '洪濑镇',
        to: '九都镇',
        value: 31.8571428571429
    },
    {
        from: '洪濑镇',
        to: '康美镇',
        value: 5436.14285714286
    },
    {
        from: '洪濑镇',
        to: '乐峰镇',
        value: 71.4285714285714
    },
    {
        from: '洪濑镇',
        to: '柳城街道',
        value: 330.285714285714
    },
    {
        from: '洪濑镇',
        to: '仑苍镇',
        value: 23.1428571428571
    },
    {
        from: '洪濑镇',
        to: '罗东镇',
        value: 349.285714285714
    },
    {
        from: '洪濑镇',
        to: '码头镇',
        value: 86.4285714285714
    },
    {
        from: '洪濑镇',
        to: '眉山乡',
        value: 6.66666666666667
    },
    {
        from: '洪濑镇',
        to: '梅山镇',
        value: 2932
    },
    {
        from: '洪濑镇',
        to: '美林街道',
        value: 392
    },
    {
        from: '洪濑镇',
        to: '省新镇',
        value: 85.7142857142857
    },
    {
        from: '洪濑镇',
        to: '诗山镇',
        value: 38.8571428571429
    },
    {
        from: '洪濑镇',
        to: '石井镇',
        value: 9.85714285714286
    },
    {
        from: '洪濑镇',
        to: '水头镇',
        value: 88.4285714285714
    },
    {
        from: '洪濑镇',
        to: '溪美街道',
        value: 118
    },
    {
        from: '洪濑镇',
        to: '霞美镇',
        value: 296.714285714286
    },
    {
        from: '洪濑镇',
        to: '翔云镇',
        value: 5
    },
    {
        from: '洪濑镇',
        to: '向阳乡',
        value: 8.2
    },
    {
        from: '洪濑镇',
        to: '英都镇',
        value: 6.57142857142857
    },
    {
        from: '洪梅镇',
        to: '丰州镇',
        value: 51.2857142857143
    },
    {
        from: '洪梅镇',
        to: '官桥镇',
        value: 7
    },
    {
        from: '洪梅镇',
        to: '洪濑镇',
        value: 1940.71428571429
    },
    {
        from: '洪梅镇',
        to: '金淘镇',
        value: 7
    },
    {
        from: '洪梅镇',
        to: '九都镇',
        value: 6.66666666666667
    },
    {
        from: '洪梅镇',
        to: '康美镇',
        value: 120.571428571429
    },
    {
        from: '洪梅镇',
        to: '乐峰镇',
        value: 37.5714285714286
    },
    {
        from: '洪梅镇',
        to: '柳城街道',
        value: 25.4285714285714
    },
    {
        from: '洪梅镇',
        to: '仑苍镇',
        value: 5
    },
    {
        from: '洪梅镇',
        to: '罗东镇',
        value: 73
    },
    {
        from: '洪梅镇',
        to: '码头镇',
        value: 10.6
    },
    {
        from: '洪梅镇',
        to: '眉山乡',
        value: 5
    },
    {
        from: '洪梅镇',
        to: '梅山镇',
        value: 144.285714285714
    },
    {
        from: '洪梅镇',
        to: '美林街道',
        value: 37.5714285714286
    },
    {
        from: '洪梅镇',
        to: '省新镇',
        value: 17.7142857142857
    },
    {
        from: '洪梅镇',
        to: '诗山镇',
        value: 8.33333333333333
    },
    {
        from: '洪梅镇',
        to: '石井镇',
        value: 5
    },
    {
        from: '洪梅镇',
        to: '水头镇',
        value: 16
    },
    {
        from: '洪梅镇',
        to: '溪美街道',
        value: 21.7142857142857
    },
    {
        from: '洪梅镇',
        to: '霞美镇',
        value: 22.4285714285714
    },
    {
        from: '洪梅镇',
        to: '翔云镇',
        value: 5
    },
    {
        from: '洪梅镇',
        to: '向阳乡',
        value: 5
    },
    {
        from: '洪梅镇',
        to: '英都镇',
        value: 5
    },
    {
        from: '金淘镇',
        to: '东田镇',
        value: 23.1428571428571
    },
    {
        from: '金淘镇',
        to: '丰州镇',
        value: 57
    },
    {
        from: '金淘镇',
        to: '官桥镇',
        value: 25.5714285714286
    },
    {
        from: '金淘镇',
        to: '洪濑镇',
        value: 85.4285714285714
    },
    {
        from: '金淘镇',
        to: '洪梅镇',
        value: 9
    },
    {
        from: '金淘镇',
        to: '九都镇',
        value: 16.1428571428571
    },
    {
        from: '金淘镇',
        to: '康美镇',
        value: 49.5714285714286
    },
    {
        from: '金淘镇',
        to: '乐峰镇',
        value: 33.4285714285714
    },
    {
        from: '金淘镇',
        to: '柳城街道',
        value: 199.714285714286
    },
    {
        from: '金淘镇',
        to: '仑苍镇',
        value: 104.285714285714
    },
    {
        from: '金淘镇',
        to: '罗东镇',
        value: 125.857142857143
    },
    {
        from: '金淘镇',
        to: '码头镇',
        value: 1373
    },
    {
        from: '金淘镇',
        to: '眉山乡',
        value: 149.714285714286
    },
    {
        from: '金淘镇',
        to: '梅山镇',
        value: 981.857142857143
    },
    {
        from: '金淘镇',
        to: '美林街道',
        value: 316.142857142857
    },
    {
        from: '金淘镇',
        to: '蓬华镇',
        value: 26.4285714285714
    },
    {
        from: '金淘镇',
        to: '省新镇',
        value: 2163.14285714286
    },
    {
        from: '金淘镇',
        to: '诗山镇',
        value: 785.857142857143
    },
    {
        from: '金淘镇',
        to: '石井镇',
        value: 13.6
    },
    {
        from: '金淘镇',
        to: '水头镇',
        value: 40.5714285714286
    },
    {
        from: '金淘镇',
        to: '溪美街道',
        value: 129.857142857143
    },
    {
        from: '金淘镇',
        to: '霞美镇',
        value: 143.428571428571
    },
    {
        from: '金淘镇',
        to: '翔云镇',
        value: 5
    },
    {
        from: '金淘镇',
        to: '向阳乡',
        value: 10.3333333333333
    },
    {
        from: '金淘镇',
        to: '英都镇',
        value: 15.5
    },
    {
        from: '九都镇',
        to: '东田镇',
        value: 5
    },
    {
        from: '九都镇',
        to: '丰州镇',
        value: 9.25
    },
    {
        from: '九都镇',
        to: '官桥镇',
        value: 5
    },
    {
        from: '九都镇',
        to: '洪濑镇',
        value: 35
    },
    {
        from: '九都镇',
        to: '洪梅镇',
        value: 12
    },
    {
        from: '九都镇',
        to: '金淘镇',
        value: 23
    },
    {
        from: '九都镇',
        to: '康美镇',
        value: 12
    },
    {
        from: '九都镇',
        to: '乐峰镇',
        value: 8.66666666666667
    },
    {
        from: '九都镇',
        to: '柳城街道',
        value: 11.5
    },
    {
        from: '九都镇',
        to: '仑苍镇',
        value: 5
    },
    {
        from: '九都镇',
        to: '罗东镇',
        value: 335.428571428571
    },
    {
        from: '九都镇',
        to: '码头镇',
        value: 72.1428571428571
    },
    {
        from: '九都镇',
        to: '眉山乡',
        value: 5
    },
    {
        from: '九都镇',
        to: '梅山镇',
        value: 253.857142857143
    },
    {
        from: '九都镇',
        to: '美林街道',
        value: 19
    },
    {
        from: '九都镇',
        to: '省新镇',
        value: 6.25
    },
    {
        from: '九都镇',
        to: '诗山镇',
        value: 11.8
    },
    {
        from: '九都镇',
        to: '石井镇',
        value: 5
    },
    {
        from: '九都镇',
        to: '水头镇',
        value: 6.25
    },
    {
        from: '九都镇',
        to: '溪美街道',
        value: 7
    },
    {
        from: '九都镇',
        to: '霞美镇',
        value: 9.6
    },
    {
        from: '九都镇',
        to: '向阳乡',
        value: 47.5714285714286
    },
    {
        from: '九都镇',
        to: '英都镇',
        value: 5
    },
    {
        from: '康美镇',
        to: '东田镇',
        value: 89.4285714285714
    },
    {
        from: '康美镇',
        to: '丰州镇',
        value: 3344.42857142857
    },
    {
        from: '康美镇',
        to: '官桥镇',
        value: 129.571428571429
    },
    {
        from: '康美镇',
        to: '洪濑镇',
        value: 5130.28571428571
    },
    {
        from: '康美镇',
        to: '洪梅镇',
        value: 137.571428571429
    },
    {
        from: '康美镇',
        to: '金淘镇',
        value: 44.5714285714286
    },
    {
        from: '康美镇',
        to: '九都镇',
        value: 20.4
    },
    {
        from: '康美镇',
        to: '乐峰镇',
        value: 22.8333333333333
    },
    {
        from: '康美镇',
        to: '柳城街道',
        value: 616.571428571429
    },
    {
        from: '康美镇',
        to: '仑苍镇',
        value: 72.8571428571429
    },
    {
        from: '康美镇',
        to: '罗东镇',
        value: 114.285714285714
    },
    {
        from: '康美镇',
        to: '码头镇',
        value: 61.1428571428571
    },
    {
        from: '康美镇',
        to: '眉山乡',
        value: 5
    },
    {
        from: '康美镇',
        to: '梅山镇',
        value: 737.857142857143
    },
    {
        from: '康美镇',
        to: '美林街道',
        value: 2686
    },
    {
        from: '康美镇',
        to: '省新镇',
        value: 559.428571428571
    },
    {
        from: '康美镇',
        to: '诗山镇',
        value: 20.2857142857143
    },
    {
        from: '康美镇',
        to: '石井镇',
        value: 138.571428571429
    },
    {
        from: '康美镇',
        to: '水头镇',
        value: 491.571428571429
    },
    {
        from: '康美镇',
        to: '溪美街道',
        value: 289.714285714286
    },
    {
        from: '康美镇',
        to: '霞美镇',
        value: 376.714285714286
    },
    {
        from: '康美镇',
        to: '翔云镇',
        value: 5
    },
    {
        from: '康美镇',
        to: '向阳乡',
        value: 5
    },
    {
        from: '康美镇',
        to: '英都镇',
        value: 11.5
    },
    {
        from: '乐峰镇',
        to: '丰州镇',
        value: 28.8571428571429
    },
    {
        from: '乐峰镇',
        to: '官桥镇',
        value: 10.5
    },
    {
        from: '乐峰镇',
        to: '洪濑镇',
        value: 74.7142857142857
    },
    {
        from: '乐峰镇',
        to: '洪梅镇',
        value: 45.4285714285714
    },
    {
        from: '乐峰镇',
        to: '金淘镇',
        value: 16.1428571428571
    },
    {
        from: '乐峰镇',
        to: '九都镇',
        value: 10.3333333333333
    },
    {
        from: '乐峰镇',
        to: '康美镇',
        value: 29.5714285714286
    },
    {
        from: '乐峰镇',
        to: '柳城街道',
        value: 32.3333333333333
    },
    {
        from: '乐峰镇',
        to: '仑苍镇',
        value: 5
    },
    {
        from: '乐峰镇',
        to: '罗东镇',
        value: 1420.85714285714
    },
    {
        from: '乐峰镇',
        to: '码头镇',
        value: 9.66666666666667
    },
    {
        from: '乐峰镇',
        to: '眉山乡',
        value: 7.5
    },
    {
        from: '乐峰镇',
        to: '梅山镇',
        value: 397.285714285714
    },
    {
        from: '乐峰镇',
        to: '美林街道',
        value: 23.8571428571429
    },
    {
        from: '乐峰镇',
        to: '省新镇',
        value: 14
    },
    {
        from: '乐峰镇',
        to: '诗山镇',
        value: 6
    },
    {
        from: '乐峰镇',
        to: '石井镇',
        value: 26
    },
    {
        from: '乐峰镇',
        to: '水头镇',
        value: 13.1666666666667
    },
    {
        from: '乐峰镇',
        to: '溪美街道',
        value: 9.6
    },
    {
        from: '乐峰镇',
        to: '霞美镇',
        value: 21.5714285714286
    },
    {
        from: '乐峰镇',
        to: '向阳乡',
        value: 58.8571428571429
    },
    {
        from: '乐峰镇',
        to: '英都镇',
        value: 5
    },
    {
        from: '柳城街道',
        to: '东田镇',
        value: 418.714285714286
    },
    {
        from: '柳城街道',
        to: '丰州镇',
        value: 443
    },
    {
        from: '柳城街道',
        to: '官桥镇',
        value: 2837.42857142857
    },
    {
        from: '柳城街道',
        to: '洪濑镇',
        value: 310.428571428571
    },
    {
        from: '柳城街道',
        to: '洪梅镇',
        value: 33.5714285714286
    },
    {
        from: '柳城街道',
        to: '金淘镇',
        value: 213.285714285714
    },
    {
        from: '柳城街道',
        to: '九都镇',
        value: 9.66666666666667
    },
    {
        from: '柳城街道',
        to: '康美镇',
        value: 584.714285714286
    },
    {
        from: '柳城街道',
        to: '乐峰镇',
        value: 21.7142857142857
    },
    {
        from: '柳城街道',
        to: '仑苍镇',
        value: 604.142857142857
    },
    {
        from: '柳城街道',
        to: '罗东镇',
        value: 72.8571428571429
    },
    {
        from: '柳城街道',
        to: '码头镇',
        value: 112.571428571429
    },
    {
        from: '柳城街道',
        to: '眉山乡',
        value: 39
    },
    {
        from: '柳城街道',
        to: '梅山镇',
        value: 205.428571428571
    },
    {
        from: '柳城街道',
        to: '美林街道',
        value: 14501.4285714286
    },
    {
        from: '柳城街道',
        to: '蓬华镇',
        value: 10.4285714285714
    },
    {
        from: '柳城街道',
        to: '省新镇',
        value: 1115.14285714286
    },
    {
        from: '柳城街道',
        to: '诗山镇',
        value: 109.428571428571
    },
    {
        from: '柳城街道',
        to: '石井镇',
        value: 186
    },
    {
        from: '柳城街道',
        to: '水头镇',
        value: 911.857142857143
    },
    {
        from: '柳城街道',
        to: '溪美街道',
        value: 13770.4285714286
    },
    {
        from: '柳城街道',
        to: '霞美镇',
        value: 9027.85714285714
    },
    {
        from: '柳城街道',
        to: '翔云镇',
        value: 28.8571428571429
    },
    {
        from: '柳城街道',
        to: '向阳乡',
        value: 6
    },
    {
        from: '柳城街道',
        to: '英都镇',
        value: 135.428571428571
    },
    {
        from: '仑苍镇',
        to: '东田镇',
        value: 348.428571428571
    },
    {
        from: '仑苍镇',
        to: '丰州镇',
        value: 66.1428571428571
    },
    {
        from: '仑苍镇',
        to: '官桥镇',
        value: 83.1428571428571
    },
    {
        from: '仑苍镇',
        to: '洪濑镇',
        value: 27.8571428571429
    },
    {
        from: '仑苍镇',
        to: '洪梅镇',
        value: 5
    },
    {
        from: '仑苍镇',
        to: '金淘镇',
        value: 87.8571428571429
    },
    {
        from: '仑苍镇',
        to: '九都镇',
        value: 5
    },
    {
        from: '仑苍镇',
        to: '康美镇',
        value: 60.7142857142857
    },
    {
        from: '仑苍镇',
        to: '乐峰镇',
        value: 5
    },
    {
        from: '仑苍镇',
        to: '柳城街道',
        value: 628.714285714286
    },
    {
        from: '仑苍镇',
        to: '罗东镇',
        value: 25.7142857142857
    },
    {
        from: '仑苍镇',
        to: '码头镇',
        value: 17
    },
    {
        from: '仑苍镇',
        to: '眉山乡',
        value: 248.142857142857
    },
    {
        from: '仑苍镇',
        to: '梅山镇',
        value: 38.1428571428571
    },
    {
        from: '仑苍镇',
        to: '美林街道',
        value: 4004.42857142857
    },
    {
        from: '仑苍镇',
        to: '蓬华镇',
        value: 14.3333333333333
    },
    {
        from: '仑苍镇',
        to: '省新镇',
        value: 414.285714285714
    },
    {
        from: '仑苍镇',
        to: '诗山镇',
        value: 37.5714285714286
    },
    {
        from: '仑苍镇',
        to: '石井镇',
        value: 67.5714285714286
    },
    {
        from: '仑苍镇',
        to: '水头镇',
        value: 117.714285714286
    },
    {
        from: '仑苍镇',
        to: '溪美街道',
        value: 1451.57142857143
    },
    {
        from: '仑苍镇',
        to: '霞美镇',
        value: 206.857142857143
    },
    {
        from: '仑苍镇',
        to: '翔云镇',
        value: 77.7142857142857
    },
    {
        from: '仑苍镇',
        to: '英都镇',
        value: 2557
    },
    {
        from: '罗东镇',
        to: '东田镇',
        value: 6.25
    },
    {
        from: '罗东镇',
        to: '丰州镇',
        value: 54.8571428571429
    },
    {
        from: '罗东镇',
        to: '官桥镇',
        value: 12.5
    },
    {
        from: '罗东镇',
        to: '洪濑镇',
        value: 326.428571428571
    },
    {
        from: '罗东镇',
        to: '洪梅镇',
        value: 61.8571428571429
    },
    {
        from: '罗东镇',
        to: '金淘镇',
        value: 127.285714285714
    },
    {
        from: '罗东镇',
        to: '九都镇',
        value: 344.285714285714
    },
    {
        from: '罗东镇',
        to: '康美镇',
        value: 129.285714285714
    },
    {
        from: '罗东镇',
        to: '乐峰镇',
        value: 1431.85714285714
    },
    {
        from: '罗东镇',
        to: '柳城街道',
        value: 66.2857142857143
    },
    {
        from: '罗东镇',
        to: '仑苍镇',
        value: 26.5714285714286
    },
    {
        from: '罗东镇',
        to: '码头镇',
        value: 58.8571428571429
    },
    {
        from: '罗东镇',
        to: '眉山乡',
        value: 6.5
    },
    {
        from: '罗东镇',
        to: '梅山镇',
        value: 4635.14285714286
    },
    {
        from: '罗东镇',
        to: '美林街道',
        value: 80.1428571428571
    },
    {
        from: '罗东镇',
        to: '省新镇',
        value: 51
    },
    {
        from: '罗东镇',
        to: '诗山镇',
        value: 18.2857142857143
    },
    {
        from: '罗东镇',
        to: '石井镇',
        value: 9.4
    },
    {
        from: '罗东镇',
        to: '水头镇',
        value: 28.7142857142857
    },
    {
        from: '罗东镇',
        to: '溪美街道',
        value: 38.1428571428571
    },
    {
        from: '罗东镇',
        to: '霞美镇',
        value: 48.1428571428571
    },
    {
        from: '罗东镇',
        to: '翔云镇',
        value: 5
    },
    {
        from: '罗东镇',
        to: '向阳乡',
        value: 24
    },
    {
        from: '罗东镇',
        to: '英都镇',
        value: 7.5
    },
    {
        from: '码头镇',
        to: '东田镇',
        value: 9
    },
    {
        from: '码头镇',
        to: '丰州镇',
        value: 65.1428571428571
    },
    {
        from: '码头镇',
        to: '官桥镇',
        value: 23.1428571428571
    },
    {
        from: '码头镇',
        to: '洪濑镇',
        value: 94.8571428571429
    },
    {
        from: '码头镇',
        to: '洪梅镇',
        value: 10.7142857142857
    },
    {
        from: '码头镇',
        to: '金淘镇',
        value: 1428.71428571429
    },
    {
        from: '码头镇',
        to: '九都镇',
        value: 77.1428571428571
    },
    {
        from: '码头镇',
        to: '康美镇',
        value: 61
    },
    {
        from: '码头镇',
        to: '乐峰镇',
        value: 10.5714285714286
    },
    {
        from: '码头镇',
        to: '柳城街道',
        value: 105.857142857143
    },
    {
        from: '码头镇',
        to: '仑苍镇',
        value: 21.8
    },
    {
        from: '码头镇',
        to: '罗东镇',
        value: 62.2857142857143
    },
    {
        from: '码头镇',
        to: '眉山乡',
        value: 8.2
    },
    {
        from: '码头镇',
        to: '梅山镇',
        value: 1067.14285714286
    },
    {
        from: '码头镇',
        to: '美林街道',
        value: 145.714285714286
    },
    {
        from: '码头镇',
        to: '蓬华镇',
        value: 21.7142857142857
    },
    {
        from: '码头镇',
        to: '省新镇',
        value: 307.714285714286
    },
    {
        from: '码头镇',
        to: '诗山镇',
        value: 2949.28571428571
    },
    {
        from: '码头镇',
        to: '石井镇',
        value: 14.3333333333333
    },
    {
        from: '码头镇',
        to: '水头镇',
        value: 43.1428571428571
    },
    {
        from: '码头镇',
        to: '溪美街道',
        value: 39
    },
    {
        from: '码头镇',
        to: '霞美镇',
        value: 134.857142857143
    },
    {
        from: '码头镇',
        to: '向阳乡',
        value: 6.5
    },
    {
        from: '码头镇',
        to: '英都镇',
        value: 7.5
    },
    {
        from: '眉山乡',
        to: '东田镇',
        value: 6.25
    },
    {
        from: '眉山乡',
        to: '丰州镇',
        value: 5
    },
    {
        from: '眉山乡',
        to: '官桥镇',
        value: 5
    },
    {
        from: '眉山乡',
        to: '洪濑镇',
        value: 14
    },
    {
        from: '眉山乡',
        to: '洪梅镇',
        value: 5
    },
    {
        from: '眉山乡',
        to: '金淘镇',
        value: 161.285714285714
    },
    {
        from: '眉山乡',
        to: '九都镇',
        value: 5
    },
    {
        from: '眉山乡',
        to: '康美镇',
        value: 5
    },
    {
        from: '眉山乡',
        to: '乐峰镇',
        value: 5
    },
    {
        from: '眉山乡',
        to: '柳城街道',
        value: 42.1666666666667
    },
    {
        from: '眉山乡',
        to: '仑苍镇',
        value: 229
    },
    {
        from: '眉山乡',
        to: '罗东镇',
        value: 11
    },
    {
        from: '眉山乡',
        to: '码头镇',
        value: 6
    },
    {
        from: '眉山乡',
        to: '梅山镇',
        value: 13.1666666666667
    },
    {
        from: '眉山乡',
        to: '美林街道',
        value: 28.5714285714286
    },
    {
        from: '眉山乡',
        to: '蓬华镇',
        value: 5
    },
    {
        from: '眉山乡',
        to: '省新镇',
        value: 47.7142857142857
    },
    {
        from: '眉山乡',
        to: '诗山镇',
        value: 31.8571428571429
    },
    {
        from: '眉山乡',
        to: '石井镇',
        value: 7.5
    },
    {
        from: '眉山乡',
        to: '水头镇',
        value: 16
    },
    {
        from: '眉山乡',
        to: '溪美街道',
        value: 31.8571428571429
    },
    {
        from: '眉山乡',
        to: '霞美镇',
        value: 16.1666666666667
    },
    {
        from: '眉山乡',
        to: '翔云镇',
        value: 5
    },
    {
        from: '眉山乡',
        to: '英都镇',
        value: 13.7142857142857
    },
    {
        from: '梅山镇',
        to: '东田镇',
        value: 13.1666666666667
    },
    {
        from: '梅山镇',
        to: '丰州镇',
        value: 164.714285714286
    },
    {
        from: '梅山镇',
        to: '官桥镇',
        value: 27.1428571428571
    },
    {
        from: '梅山镇',
        to: '洪濑镇',
        value: 3113.71428571429
    },
    {
        from: '梅山镇',
        to: '洪梅镇',
        value: 153.285714285714
    },
    {
        from: '梅山镇',
        to: '金淘镇',
        value: 908.428571428571
    },
    {
        from: '梅山镇',
        to: '九都镇',
        value: 255.428571428571
    },
    {
        from: '梅山镇',
        to: '康美镇',
        value: 784.428571428571
    },
    {
        from: '梅山镇',
        to: '乐峰镇',
        value: 405.142857142857
    },
    {
        from: '梅山镇',
        to: '柳城街道',
        value: 188.285714285714
    },
    {
        from: '梅山镇',
        to: '仑苍镇',
        value: 26.5714285714286
    },
    {
        from: '梅山镇',
        to: '罗东镇',
        value: 4522.71428571429
    },
    {
        from: '梅山镇',
        to: '码头镇',
        value: 994.571428571429
    },
    {
        from: '梅山镇',
        to: '眉山乡',
        value: 13.8
    },
    {
        from: '梅山镇',
        to: '美林街道',
        value: 201.857142857143
    },
    {
        from: '梅山镇',
        to: '蓬华镇',
        value: 6.25
    },
    {
        from: '梅山镇',
        to: '省新镇',
        value: 96.8571428571429
    },
    {
        from: '梅山镇',
        to: '诗山镇',
        value: 148.714285714286
    },
    {
        from: '梅山镇',
        to: '石井镇',
        value: 11.8571428571429
    },
    {
        from: '梅山镇',
        to: '水头镇',
        value: 46.8571428571429
    },
    {
        from: '梅山镇',
        to: '溪美街道',
        value: 116
    },
    {
        from: '梅山镇',
        to: '霞美镇',
        value: 89.4285714285714
    },
    {
        from: '梅山镇',
        to: '向阳乡',
        value: 27.7142857142857
    },
    {
        from: '梅山镇',
        to: '英都镇',
        value: 9.2
    },
    {
        from: '美林街道',
        to: '东田镇',
        value: 398.857142857143
    },
    {
        from: '美林街道',
        to: '丰州镇',
        value: 522
    },
    {
        from: '美林街道',
        to: '官桥镇',
        value: 296.142857142857
    },
    {
        from: '美林街道',
        to: '洪濑镇',
        value: 362.714285714286
    },
    {
        from: '美林街道',
        to: '洪梅镇',
        value: 38.4285714285714
    },
    {
        from: '美林街道',
        to: '金淘镇',
        value: 348.857142857143
    },
    {
        from: '美林街道',
        to: '九都镇',
        value: 13.2857142857143
    },
    {
        from: '美林街道',
        to: '康美镇',
        value: 2517.57142857143
    },
    {
        from: '美林街道',
        to: '乐峰镇',
        value: 38.4285714285714
    },
    {
        from: '美林街道',
        to: '柳城街道',
        value: 14571.8571428571
    },
    {
        from: '美林街道',
        to: '仑苍镇',
        value: 3771
    },
    {
        from: '美林街道',
        to: '罗东镇',
        value: 87.4285714285714
    },
    {
        from: '美林街道',
        to: '码头镇',
        value: 163.285714285714
    },
    {
        from: '美林街道',
        to: '眉山乡',
        value: 27.8571428571429
    },
    {
        from: '美林街道',
        to: '梅山镇',
        value: 203
    },
    {
        from: '美林街道',
        to: '蓬华镇',
        value: 8.42857142857143
    },
    {
        from: '美林街道',
        to: '省新镇',
        value: 8655.85714285714
    },
    {
        from: '美林街道',
        to: '诗山镇',
        value: 159.571428571429
    },
    {
        from: '美林街道',
        to: '石井镇',
        value: 179.857142857143
    },
    {
        from: '美林街道',
        to: '水头镇',
        value: 619.714285714286
    },
    {
        from: '美林街道',
        to: '溪美街道',
        value: 8233
    },
    {
        from: '美林街道',
        to: '霞美镇',
        value: 2384.42857142857
    },
    {
        from: '美林街道',
        to: '翔云镇',
        value: 24
    },
    {
        from: '美林街道',
        to: '向阳乡',
        value: 5
    },
    {
        from: '美林街道',
        to: '英都镇',
        value: 157
    },
    {
        from: '蓬华镇',
        to: '东田镇',
        value: 5
    },
    {
        from: '蓬华镇',
        to: '丰州镇',
        value: 7.5
    },
    {
        from: '蓬华镇',
        to: '官桥镇',
        value: 5
    },
    {
        from: '蓬华镇',
        to: '金淘镇',
        value: 26.1666666666667
    },
    {
        from: '蓬华镇',
        to: '康美镇',
        value: 5
    },
    {
        from: '蓬华镇',
        to: '柳城街道',
        value: 14.6
    },
    {
        from: '蓬华镇',
        to: '仑苍镇',
        value: 17
    },
    {
        from: '蓬华镇',
        to: '罗东镇',
        value: 8
    },
    {
        from: '蓬华镇',
        to: '码头镇',
        value: 15.2857142857143
    },
    {
        from: '蓬华镇',
        to: '眉山乡',
        value: 6
    },
    {
        from: '蓬华镇',
        to: '梅山镇',
        value: 6.83333333333333
    },
    {
        from: '蓬华镇',
        to: '美林街道',
        value: 7.2
    },
    {
        from: '蓬华镇',
        to: '省新镇',
        value: 7.2
    },
    {
        from: '蓬华镇',
        to: '诗山镇',
        value: 375.285714285714
    },
    {
        from: '蓬华镇',
        to: '水头镇',
        value: 7.75
    },
    {
        from: '蓬华镇',
        to: '溪美街道',
        value: 7.4
    },
    {
        from: '蓬华镇',
        to: '霞美镇',
        value: 5
    },
    {
        from: '蓬华镇',
        to: '英都镇',
        value: 5
    },
    {
        from: '省新镇',
        to: '东田镇',
        value: 71
    },
    {
        from: '省新镇',
        to: '丰州镇',
        value: 103
    },
    {
        from: '省新镇',
        to: '官桥镇',
        value: 90.4285714285714
    },
    {
        from: '省新镇',
        to: '洪濑镇',
        value: 106
    },
    {
        from: '省新镇',
        to: '洪梅镇',
        value: 12.3333333333333
    },
    {
        from: '省新镇',
        to: '金淘镇',
        value: 2223.71428571429
    },
    {
        from: '省新镇',
        to: '九都镇',
        value: 5
    },
    {
        from: '省新镇',
        to: '康美镇',
        value: 508.285714285714
    },
    {
        from: '省新镇',
        to: '乐峰镇',
        value: 20.5
    },
    {
        from: '省新镇',
        to: '柳城街道',
        value: 1174
    },
    {
        from: '省新镇',
        to: '仑苍镇',
        value: 480.142857142857
    },
    {
        from: '省新镇',
        to: '罗东镇',
        value: 46
    },
    {
        from: '省新镇',
        to: '码头镇',
        value: 310.571428571429
    },
    {
        from: '省新镇',
        to: '眉山乡',
        value: 44.5714285714286
    },
    {
        from: '省新镇',
        to: '梅山镇',
        value: 111.142857142857
    },
    {
        from: '省新镇',
        to: '美林街道',
        value: 8711.14285714286
    },
    {
        from: '省新镇',
        to: '蓬华镇',
        value: 15
    },
    {
        from: '省新镇',
        to: '诗山镇',
        value: 151.142857142857
    },
    {
        from: '省新镇',
        to: '石井镇',
        value: 19.4285714285714
    },
    {
        from: '省新镇',
        to: '水头镇',
        value: 123.428571428571
    },
    {
        from: '省新镇',
        to: '溪美街道',
        value: 714.571428571429
    },
    {
        from: '省新镇',
        to: '霞美镇',
        value: 413.857142857143
    },
    {
        from: '省新镇',
        to: '翔云镇',
        value: 17.25
    },
    {
        from: '省新镇',
        to: '向阳乡',
        value: 5
    },
    {
        from: '省新镇',
        to: '英都镇',
        value: 35
    },
    {
        from: '诗山镇',
        to: '东田镇',
        value: 7.75
    },
    {
        from: '诗山镇',
        to: '丰州镇',
        value: 33
    },
    {
        from: '诗山镇',
        to: '官桥镇',
        value: 16.1428571428571
    },
    {
        from: '诗山镇',
        to: '洪濑镇',
        value: 55
    },
    {
        from: '诗山镇',
        to: '洪梅镇',
        value: 5
    },
    {
        from: '诗山镇',
        to: '金淘镇',
        value: 910.714285714286
    },
    {
        from: '诗山镇',
        to: '九都镇',
        value: 12.2857142857143
    },
    {
        from: '诗山镇',
        to: '康美镇',
        value: 31.7142857142857
    },
    {
        from: '诗山镇',
        to: '柳城街道',
        value: 119
    },
    {
        from: '诗山镇',
        to: '仑苍镇',
        value: 39.8571428571429
    },
    {
        from: '诗山镇',
        to: '罗东镇',
        value: 12.3333333333333
    },
    {
        from: '诗山镇',
        to: '码头镇',
        value: 3038.14285714286
    },
    {
        from: '诗山镇',
        to: '眉山乡',
        value: 25
    },
    {
        from: '诗山镇',
        to: '梅山镇',
        value: 141
    },
    {
        from: '诗山镇',
        to: '美林街道',
        value: 149.142857142857
    },
    {
        from: '诗山镇',
        to: '蓬华镇',
        value: 361.571428571429
    },
    {
        from: '诗山镇',
        to: '省新镇',
        value: 146.142857142857
    },
    {
        from: '诗山镇',
        to: '石井镇',
        value: 9.66666666666667
    },
    {
        from: '诗山镇',
        to: '水头镇',
        value: 24
    },
    {
        from: '诗山镇',
        to: '溪美街道',
        value: 41.2857142857143
    },
    {
        from: '诗山镇',
        to: '霞美镇',
        value: 57.8571428571429
    },
    {
        from: '诗山镇',
        to: '翔云镇',
        value: 5
    },
    {
        from: '诗山镇',
        to: '向阳乡',
        value: 5
    },
    {
        from: '诗山镇',
        to: '英都镇',
        value: 8
    },
    {
        from: '石井镇',
        to: '东田镇',
        value: 66.2857142857143
    },
    {
        from: '石井镇',
        to: '丰州镇',
        value: 32.5714285714286
    },
    {
        from: '石井镇',
        to: '官桥镇',
        value: 349.428571428571
    },
    {
        from: '石井镇',
        to: '洪濑镇',
        value: 15.8571428571429
    },
    {
        from: '石井镇',
        to: '金淘镇',
        value: 7.66666666666667
    },
    {
        from: '石井镇',
        to: '九都镇',
        value: 5
    },
    {
        from: '石井镇',
        to: '康美镇',
        value: 157.857142857143
    },
    {
        from: '石井镇',
        to: '乐峰镇',
        value: 12
    },
    {
        from: '石井镇',
        to: '柳城街道',
        value: 172.571428571429
    },
    {
        from: '石井镇',
        to: '仑苍镇',
        value: 55
    },
    {
        from: '石井镇',
        to: '罗东镇',
        value: 7.75
    },
    {
        from: '石井镇',
        to: '码头镇',
        value: 8.85714285714286
    },
    {
        from: '石井镇',
        to: '眉山乡',
        value: 13
    },
    {
        from: '石井镇',
        to: '梅山镇',
        value: 22.3333333333333
    },
    {
        from: '石井镇',
        to: '美林街道',
        value: 172.571428571429
    },
    {
        from: '石井镇',
        to: '蓬华镇',
        value: 10
    },
    {
        from: '石井镇',
        to: '省新镇',
        value: 30.4285714285714
    },
    {
        from: '石井镇',
        to: '诗山镇',
        value: 12.5
    },
    {
        from: '石井镇',
        to: '水头镇',
        value: 15277
    },
    {
        from: '石井镇',
        to: '溪美街道',
        value: 76.2857142857143
    },
    {
        from: '石井镇',
        to: '霞美镇',
        value: 66.8571428571429
    },
    {
        from: '石井镇',
        to: '翔云镇',
        value: 5
    },
    {
        from: '石井镇',
        to: '向阳乡',
        value: 5
    },
    {
        from: '石井镇',
        to: '英都镇',
        value: 5
    },
    {
        from: '水头镇',
        to: '东田镇',
        value: 171.428571428571
    },
    {
        from: '水头镇',
        to: '丰州镇',
        value: 901.142857142857
    },
    {
        from: '水头镇',
        to: '官桥镇',
        value: 8235
    },
    {
        from: '水头镇',
        to: '洪濑镇',
        value: 83.8571428571429
    },
    {
        from: '水头镇',
        to: '洪梅镇',
        value: 22.5
    },
    {
        from: '水头镇',
        to: '金淘镇',
        value: 41
    },
    {
        from: '水头镇',
        to: '九都镇',
        value: 6.66666666666667
    },
    {
        from: '水头镇',
        to: '康美镇',
        value: 578.142857142857
    },
    {
        from: '水头镇',
        to: '乐峰镇',
        value: 16
    },
    {
        from: '水头镇',
        to: '柳城街道',
        value: 946.857142857143
    },
    {
        from: '水头镇',
        to: '仑苍镇',
        value: 165.571428571429
    },
    {
        from: '水头镇',
        to: '罗东镇',
        value: 17
    },
    {
        from: '水头镇',
        to: '码头镇',
        value: 33.5714285714286
    },
    {
        from: '水头镇',
        to: '眉山乡',
        value: 7.2
    },
    {
        from: '水头镇',
        to: '梅山镇',
        value: 51
    },
    {
        from: '水头镇',
        to: '美林街道',
        value: 582.285714285714
    },
    {
        from: '水头镇',
        to: '蓬华镇',
        value: 5
    },
    {
        from: '水头镇',
        to: '省新镇',
        value: 104.857142857143
    },
    {
        from: '水头镇',
        to: '诗山镇',
        value: 26.4285714285714
    },
    {
        from: '水头镇',
        to: '石井镇',
        value: 14979.8571428571
    },
    {
        from: '水头镇',
        to: '溪美街道',
        value: 194.571428571429
    },
    {
        from: '水头镇',
        to: '霞美镇',
        value: 774.428571428571
    },
    {
        from: '水头镇',
        to: '翔云镇',
        value: 8.66666666666667
    },
    {
        from: '水头镇',
        to: '向阳乡',
        value: 5
    },
    {
        from: '水头镇',
        to: '英都镇',
        value: 9.85714285714286
    },
    {
        from: '溪美街道',
        to: '东田镇',
        value: 1878
    },
    {
        from: '溪美街道',
        to: '丰州镇',
        value: 104
    },
    {
        from: '溪美街道',
        to: '官桥镇',
        value: 242.142857142857
    },
    {
        from: '溪美街道',
        to: '洪濑镇',
        value: 122.571428571429
    },
    {
        from: '溪美街道',
        to: '洪梅镇',
        value: 16.8571428571429
    },
    {
        from: '溪美街道',
        to: '金淘镇',
        value: 137.571428571429
    },
    {
        from: '溪美街道',
        to: '九都镇',
        value: 10.6
    },
    {
        from: '溪美街道',
        to: '康美镇',
        value: 284.571428571429
    },
    {
        from: '溪美街道',
        to: '乐峰镇',
        value: 9.5
    },
    {
        from: '溪美街道',
        to: '柳城街道',
        value: 14119.5714285714
    },
    {
        from: '溪美街道',
        to: '仑苍镇',
        value: 1430.85714285714
    },
    {
        from: '溪美街道',
        to: '罗东镇',
        value: 32.4285714285714
    },
    {
        from: '溪美街道',
        to: '码头镇',
        value: 43.5
    },
    {
        from: '溪美街道',
        to: '眉山乡',
        value: 26.5714285714286
    },
    {
        from: '溪美街道',
        to: '梅山镇',
        value: 114
    },
    {
        from: '溪美街道',
        to: '美林街道',
        value: 7711.42857142857
    },
    {
        from: '溪美街道',
        to: '蓬华镇',
        value: 8.75
    },
    {
        from: '溪美街道',
        to: '省新镇',
        value: 690.285714285714
    },
    {
        from: '溪美街道',
        to: '诗山镇',
        value: 39.7142857142857
    },
    {
        from: '溪美街道',
        to: '石井镇',
        value: 71
    },
    {
        from: '溪美街道',
        to: '水头镇',
        value: 201.857142857143
    },
    {
        from: '溪美街道',
        to: '霞美镇',
        value: 585.714285714286
    },
    {
        from: '溪美街道',
        to: '翔云镇',
        value: 45.2857142857143
    },
    {
        from: '溪美街道',
        to: '向阳乡',
        value: 5
    },
    {
        from: '溪美街道',
        to: '英都镇',
        value: 261.714285714286
    },
    {
        from: '霞美镇',
        to: '东田镇',
        value: 68.4285714285714
    },
    {
        from: '霞美镇',
        to: '丰州镇',
        value: 10316
    },
    {
        from: '霞美镇',
        to: '官桥镇',
        value: 952.571428571429
    },
    {
        from: '霞美镇',
        to: '洪濑镇',
        value: 313.285714285714
    },
    {
        from: '霞美镇',
        to: '洪梅镇',
        value: 29.7142857142857
    },
    {
        from: '霞美镇',
        to: '金淘镇',
        value: 142.142857142857
    },
    {
        from: '霞美镇',
        to: '九都镇',
        value: 6.25
    },
    {
        from: '霞美镇',
        to: '康美镇',
        value: 397.142857142857
    },
    {
        from: '霞美镇',
        to: '乐峰镇',
        value: 15.1666666666667
    },
    {
        from: '霞美镇',
        to: '柳城街道',
        value: 8596.71428571429
    },
    {
        from: '霞美镇',
        to: '仑苍镇',
        value: 212.714285714286
    },
    {
        from: '霞美镇',
        to: '罗东镇',
        value: 39
    },
    {
        from: '霞美镇',
        to: '码头镇',
        value: 132.428571428571
    },
    {
        from: '霞美镇',
        to: '眉山乡',
        value: 9.66666666666667
    },
    {
        from: '霞美镇',
        to: '梅山镇',
        value: 107.428571428571
    },
    {
        from: '霞美镇',
        to: '美林街道',
        value: 2599.28571428571
    },
    {
        from: '霞美镇',
        to: '蓬华镇',
        value: 5
    },
    {
        from: '霞美镇',
        to: '省新镇',
        value: 448
    },
    {
        from: '霞美镇',
        to: '诗山镇',
        value: 62.8571428571429
    },
    {
        from: '霞美镇',
        to: '石井镇',
        value: 83.2857142857143
    },
    {
        from: '霞美镇',
        to: '水头镇',
        value: 807.714285714286
    },
    {
        from: '霞美镇',
        to: '溪美街道',
        value: 631.285714285714
    },
    {
        from: '霞美镇',
        to: '翔云镇',
        value: 6.25
    },
    {
        from: '霞美镇',
        to: '向阳乡',
        value: 7
    },
    {
        from: '霞美镇',
        to: '英都镇',
        value: 41.2857142857143
    },
    {
        from: '翔云镇',
        to: '东田镇',
        value: 8.66666666666667
    },
    {
        from: '翔云镇',
        to: '丰州镇',
        value: 5
    },
    {
        from: '翔云镇',
        to: '官桥镇',
        value: 10.6666666666667
    },
    {
        from: '翔云镇',
        to: '洪濑镇',
        value: 5
    },
    {
        from: '翔云镇',
        to: '金淘镇',
        value: 8
    },
    {
        from: '翔云镇',
        to: '柳城街道',
        value: 23.8571428571429
    },
    {
        from: '翔云镇',
        to: '仑苍镇',
        value: 71.7142857142857
    },
    {
        from: '翔云镇',
        to: '罗东镇',
        value: 5
    },
    {
        from: '翔云镇',
        to: '眉山乡',
        value: 5
    },
    {
        from: '翔云镇',
        to: '梅山镇',
        value: 5
    },
    {
        from: '翔云镇',
        to: '美林街道',
        value: 22.2857142857143
    },
    {
        from: '翔云镇',
        to: '省新镇',
        value: 10.8333333333333
    },
    {
        from: '翔云镇',
        to: '水头镇',
        value: 7.5
    },
    {
        from: '翔云镇',
        to: '溪美街道',
        value: 37.8571428571429
    },
    {
        from: '翔云镇',
        to: '霞美镇',
        value: 9
    },
    {
        from: '翔云镇',
        to: '英都镇',
        value: 274.285714285714
    },
    {
        from: '向阳乡',
        to: '东田镇',
        value: 5
    },
    {
        from: '向阳乡',
        to: '丰州镇',
        value: 5
    },
    {
        from: '向阳乡',
        to: '官桥镇',
        value: 5
    },
    {
        from: '向阳乡',
        to: '洪濑镇',
        value: 8
    },
    {
        from: '向阳乡',
        to: '洪梅镇',
        value: 5
    },
    {
        from: '向阳乡',
        to: '金淘镇',
        value: 7.5
    },
    {
        from: '向阳乡',
        to: '九都镇',
        value: 57.2857142857143
    },
    {
        from: '向阳乡',
        to: '康美镇',
        value: 5
    },
    {
        from: '向阳乡',
        to: '乐峰镇',
        value: 50.2857142857143
    },
    {
        from: '向阳乡',
        to: '柳城街道',
        value: 5
    },
    {
        from: '向阳乡',
        to: '罗东镇',
        value: 28.8571428571429
    },
    {
        from: '向阳乡',
        to: '码头镇',
        value: 7.4
    },
    {
        from: '向阳乡',
        to: '梅山镇',
        value: 27.8571428571429
    },
    {
        from: '向阳乡',
        to: '美林街道',
        value: 5
    },
    {
        from: '向阳乡',
        to: '省新镇',
        value: 5
    },
    {
        from: '向阳乡',
        to: '诗山镇',
        value: 5
    },
    {
        from: '向阳乡',
        to: '水头镇',
        value: 7.2
    },
    {
        from: '向阳乡',
        to: '溪美街道',
        value: 9.25
    },
    {
        from: '向阳乡',
        to: '霞美镇',
        value: 5
    },
    {
        from: '英都镇',
        to: '东田镇',
        value: 259.714285714286
    },
    {
        from: '英都镇',
        to: '丰州镇',
        value: 8.28571428571429
    },
    {
        from: '英都镇',
        to: '官桥镇',
        value: 9.4
    },
    {
        from: '英都镇',
        to: '洪濑镇',
        value: 9.25
    },
    {
        from: '英都镇',
        to: '洪梅镇',
        value: 6.66666666666667
    },
    {
        from: '英都镇',
        to: '金淘镇',
        value: 11.1666666666667
    },
    {
        from: '英都镇',
        to: '九都镇',
        value: 5
    },
    {
        from: '英都镇',
        to: '康美镇',
        value: 11.1666666666667
    },
    {
        from: '英都镇',
        to: '乐峰镇',
        value: 5
    },
    {
        from: '英都镇',
        to: '柳城街道',
        value: 166.714285714286
    },
    {
        from: '英都镇',
        to: '仑苍镇',
        value: 2549.71428571429
    },
    {
        from: '英都镇',
        to: '罗东镇',
        value: 7.5
    },
    {
        from: '英都镇',
        to: '码头镇',
        value: 5
    },
    {
        from: '英都镇',
        to: '眉山乡',
        value: 17.8333333333333
    },
    {
        from: '英都镇',
        to: '梅山镇',
        value: 8.2
    },
    {
        from: '英都镇',
        to: '美林街道',
        value: 135.142857142857
    },
    {
        from: '英都镇',
        to: '蓬华镇',
        value: 5
    },
    {
        from: '英都镇',
        to: '省新镇',
        value: 28.7142857142857
    },
    {
        from: '英都镇',
        to: '诗山镇',
        value: 6.5
    },
    {
        from: '英都镇',
        to: '石井镇',
        value: 5
    },
    {
        from: '英都镇',
        to: '水头镇',
        value: 13.6666666666667
    },
    {
        from: '英都镇',
        to: '溪美街道',
        value: 274.857142857143
    },
    {
        from: '英都镇',
        to: '霞美镇',
        value: 27.8571428571429
    },
    {
        from: '英都镇',
        to: '翔云镇',
        value: 290
    },
];

var initData = newOD.filter(function(e) {
    return e.from == "美林街道";
});
var getOdValue = function(odData, name) {

    var fromObj = {};
    var toObj = {};
    for (var e in odData) {
        if (fromObj[odData[e].from] === undefined) {
            fromObj[odData[e].from] = odData[e].value;
        } else {
            fromObj[odData[e].from] = fromObj[odData[e].from] + odData[e].value;
        }
        if (toObj[odData[e].to] === undefined) {
            toObj[odData[e].to] = odData[e].value;
        } else {
            toObj[odData[e].to] = toObj[odData[e].to] + odData[e].value;
        }
    }
    var result = [];
    for (var item in fromObj) {
        if (item == name) continue;
        result.push({
            name: item,
            value: zoneCoord[item].concat(fromObj[item]),
        });
    }

    for (var ind in toObj) {
        if (ind == name) continue;
        result.push({
            name: ind,
            value: zoneCoord[ind].concat(toObj[ind]),
        });
    }

    return result;

}

var convertData = function(data) {
    var res = [];
    for (var e in data) {
        var fromCoord = zoneCoord[data[e].from];
        var toCoord = zoneCoord[data[e].to];
        if (fromCoord && toCoord) {
            res.push([{
                    coord: fromCoord
                },
                {
                    coord: toCoord
                }
            ]);
        }
    }
    return res;
};


$.get(uploadedDataURL, function(geoJson) {

    echarts.registerMap('map', geoJson);
    console.log(name);

    var option = {
        backgroundColor: '#013954',
        title: {
            // text: "南安市迁徙图",
            left: 'center',
            textStyle: {
                color: '#ffffff'
            }
        },
        tooltip: {
            trigger: 'item',
            backgroundColor: 'rgba(166, 200, 76, 0.82)',
            borderColor: '#040616',
            showDelay: 0,
            hideDelay: 0,
            enterable: true,
            transitionDuration: 0,
            extraCssText: 'z-index:100'
        },
        geo: {
            map: 'map',
            scaleLimit: {
                min: 1,
                max: 3
            },
            // center: [118.616714101,24.9913518972],
            nameMap: {
                selectedMode: 'single'
            },
            zoom: 1,
            label: {
                emphasis: {
                   show: true,
                       fontSize: 10,
                       textStyle:{
                           color:'#ffffff'
                       }
                }
            },
            roam: true, //是否允许缩放
            itemStyle: {
                normal: {
                    color: 'rgba(51, 69, 89, .5)', //地图背景色
                    borderColor: '#516a89', //省市边界线00fcff 516a89
                    borderWidth: 1
                },
                emphasis: {
                    color: 'rgba(37, 43, 61, .5)' //悬浮背景
                }
            }
        },
        visualMap: {
            min: 0,
            max: 15000,
            // left: 'right',
            right: 50,
            bottom: '50',
            text: ['高', '低'], // 文本，默认为数值文本
            seriesIndex: [1],
            calculable: true,
            inRange: {
                // color: ['yellow', 'lightskyblue', 'orangered']
                color: ['#f6ff54', '#ffa225', '#ff2c2a'] // 黄橙红
            },
            textStyle: {
                color: '#ffffff'
            }
        },
        series: [{
                name: '1',
                type: 'lines',
                coordinateSystem: 'geo',
                zlevel: 1,
                data: convertData(initData),
                silent: true,
                lineStyle: {
                    normal: {
                        color: '#f6ff54',
                        width: 1,
                        curveness: 0.3
                    }
                },
                effect: {
                    show: true,
                    period: 4, //箭头指向速度，值越小速度越快
                    trailLength: 0.02, //特效尾迹长度[0,1]值越大，尾迹越长重
                    symbol: 'arrow', //箭头图标
                    symbolSize: 5, //图标大小
                },
            },
            {
                name: '出行量',
                type: 'effectScatter',
                coordinateSystem: 'geo',
                zlevel: 3,
                rippleEffect: { //涟漪特效
                    brushType: 'stroke', //波纹绘制方式 stroke, fill
                },
                symbol: 'circle',
                label: {
                    normal: {
                        show: true,
                        position: 'right', //显示位置
                        offset: [5, 0], //偏移设置
                        formatter: function(params) { //圆环显示文字
                            return params.data.name;
                        },
                        fontSize: 10,
                        textStyle: {
                            color: '#ffffff'
                        }
                    },
                    emphasis: {
                        show: true
                    }
                },
                tooltip: {
                    formatter: function(params, ticket, callback) {
                        let data = params.data;
                        let name = data.name;
                        let value = parseInt(data.value[2]);
                        let res = name + '<br/> OD量：' + value;
                        return res;
                    },
                },
                symbolSize: function(val) {
                    var value = val[2];
                    if (value < 100) {
                        return 4;
                    } else if (value >= 100 && value < 500) {
                        return 9;
                    } else if (value >= 500 && value < 1000) {
                        return 15;
                    } else if (value >= 1000 && value < 5000) {
                        return 22;
                    } else if (value >= 5000 && value < 10000) {
                        return 30;
                    } else {
                        return 40;
                    }
                },
                itemStyle: {
                    normal: {
                        color: '#f6ff54'
                    }
                },
                data: getOdValue(initData, "美林街道")
            }
        ]
    };

    myChart.setOption(option);
    myChart.on('click', function(obj) {
        console.log(obj);
        var name = obj.name;
        var data = newOD.filter(function(value) {
            return value.from == name;
        })
        if (data.length > 0) {
            option.series[0].data = convertData(data);
            option.series[1].data = getOdValue(data, name);
            myChart.setOption(option);
        }

    });
});