// 排行数据
var rankData = [
    {
        'category': '2019-05-18',
        'data': [
            {
                'name': '济南',
                'value': 508.90
            },

            {
                'name': '青岛',
                'value': 453.55
            },

            {
                'name': '淄博',
                'value': 401.20
            },

            {
                'name': '枣庄',
                'value': 380.92
            },

            {
                'name': '东营',
                'value':330.32
            },

            {
                'name': '烟台',
                'value': 290.74
            },

            {
                'name': '济宁',
                'value': 269.07
            },
             {
                'name': '潍坊',
                'value': 224.07
            },
            
             {
                'name': '威海',
                'value': 200.07
            },
            
             {
                'name': '日照',
                'value': 179.07
            },
            
             {
                'name': '滨州',
                'value': 154.07
            },
             {
                'name': '德州',
                'value': 150.07
            },
            
             {
                'name': '聊城',
                'value': 100.07
            },
             {
                'name': '临沂',
                'value': 86.07
            },
             {
                'name': '菏泽',
                'value': 66.07
            },
             {
                'name': '泰安',
                'value': 45.07
            },
            
            ],
        'date': '2019-05-18-16'
    },

    {
        'category': '2019-05-18',
        'data': [

            {
                'name': '',
                'value': 227.84
            },

            {
                'name': '行者无畏',
                'value': 180.45
            },

            {
                'name': '超级联盟',
                'value': 152.20
            },

            {
                'name': '动力火车',
                'value': 147.91
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 102.26
            },

            {
                'name': '一起爱',
                'value': 89.74
            },

            {
                'name': '天荒地老',
                'value': 46.21
            } ],
        'date': '2019-05-18-17'
    },

    {
        'category': '2019-05-18',
        'data': [

            {
                'name': '一起幸福一起飞',
                'value': 238.80
            },

            {
                'name': '行者无畏',
                'value': 197.67
            },

            {
                'name': '超级联盟',
                'value': 165.53
            },

            {
                'name': '动力火车',
                'value': 147.91
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 107.92
            },

            {
                'name': '一起爱',
                'value': 98.00
            },

            {
                'name': '天荒地老',
                'value': 54.94
            } ],
        'date': '2019-05-18-18'
    },

    {
        'category': '2019-05-18',
        'data': [

            {
                'name': '一起幸福一起飞',
                'value': 254.83
            },

            {
                'name': '行者无畏',
                'value': 249.05
            },

            {
                'name': '超级联盟',
                'value': 169.16
            },

            {
                'name': '动力火车',
                'value': 147.91
            },

            {
                'name': '一起爱',
                'value': 114.07
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 107.92
            },

            {
                'name': '天荒地老',
                'value': 55.27
            } ],
        'date': '2019-05-18-19'
    },

    {
        'category': '2019-05-18',
        'data': [

            {
                'name': '行者无畏',
                'value': 274.44
            },

            {
                'name': '一起幸福一起飞',
                'value': 254.83
            },

            {
                'name': '超级联盟',
                'value': 178.64
            },

            {
                'name': '动力火车',
                'value': 157.74
            },

            {
                'name': '一起爱',
                'value': 121.84
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 107.92
            },

            {
                'name': '天荒地老',
                'value': 62.29
            } ],
        'date': '2019-05-18-20'
    },

    {
        'category': '2019-05-18',
        'data': [

            {
                'name': '行者无畏',
                'value': 284.08
            },

            {
                'name': '一起幸福一起飞',
                'value': 270.00
            },

            {
                'name': '超级联盟',
                'value': 185.26
            },

            {
                'name': '动力火车',
                'value': 180.40
            },

            {
                'name': '一起爱',
                'value': 125.65
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 107.92
            },

            {
                'name': '天荒地老',
                'value': 62.29
            } ],
        'date': '2019-05-18-21'
    },

    {
        'category': '2019-05-18',
        'data': [

            {
                'name': '行者无畏',
                'value': 297.14
            },

            {
                'name': '一起幸福一起飞',
                'value': 280.33
            },

            {
                'name': '超级联盟',
                'value': 202.22
            },

            {
                'name': '动力火车',
                'value': 188.48
            },

            {
                'name': '一起爱',
                'value': 134.35
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 109.53
            },

            {
                'name': '天荒地老',
                'value': 62.29
            } ],
        'date': '2019-05-18-22'
    },

    {
        'category': '2019-05-18',
        'data': [

            {
                'name': '行者无畏',
                'value': 313.22
            },

            {
                'name': '一起幸福一起飞',
                'value': 280.33
            },

            {
                'name': '超级联盟',
                'value': 202.35
            },

            {
                'name': '动力火车',
                'value': 191.12
            },

            {
                'name': '一起爱',
                'value': 140.36
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 112.62
            },

            {
                'name': '天荒地老',
                'value': 62.29
            } ],
        'date': '2019-05-18-23'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 315.30
            },

            {
                'name': '一起幸福一起飞',
                'value': 285.94
            },

            {
                'name': '超级联盟',
                'value': 202.35
            },

            {
                'name': '动力火车',
                'value': 191.12
            },

            {
                'name': '一起爱',
                'value': 140.36
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 115.94
            },

            {
                'name': '天荒地老',
                'value': 62.29
            } ],
        'date': '2019-05-19-0'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 315.30
            },

            {
                'name': '一起幸福一起飞',
                'value': 285.94
            },

            {
                'name': '超级联盟',
                'value': 202.35
            },

            {
                'name': '动力火车',
                'value': 191.12
            },

            {
                'name': '一起爱',
                'value': 140.36
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 115.94
            },

            {
                'name': '天荒地老',
                'value': 62.29
            } ],
        'date': '2019-05-19-1'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 315.30
            },

            {
                'name': '一起幸福一起飞',
                'value': 285.94
            },

            {
                'name': '超级联盟',
                'value': 202.35
            },

            {
                'name': '动力火车',
                'value': 191.12
            },

            {
                'name': '一起爱',
                'value': 140.36
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 115.94
            },

            {
                'name': '天荒地老',
                'value': 62.29
            } ],
        'date': '2019-05-19-2'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 315.30
            },

            {
                'name': '一起幸福一起飞',
                'value': 285.94
            },

            {
                'name': '超级联盟',
                'value': 202.35
            },

            {
                'name': '动力火车',
                'value': 191.12
            },

            {
                'name': '一起爱',
                'value': 140.36
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 115.94
            },

            {
                'name': '天荒地老',
                'value': 62.29
            } ],
        'date': '2019-05-19-3'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 315.30
            },

            {
                'name': '一起幸福一起飞',
                'value': 285.94
            },

            {
                'name': '超级联盟',
                'value': 202.35
            },

            {
                'name': '动力火车',
                'value': 191.12
            },

            {
                'name': '一起爱',
                'value': 140.36
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 115.94
            },

            {
                'name': '天荒地老',
                'value': 62.29
            } ],
        'date': '2019-05-19-4'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 322.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 285.94
            },

            {
                'name': '超级联盟',
                'value': 202.35
            },

            {
                'name': '动力火车',
                'value': 191.12
            },

            {
                'name': '一起爱',
                'value': 140.36
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 115.94
            },

            {
                'name': '天荒地老',
                'value': 62.29
            } ],
        'date': '2019-05-19-5'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 322.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 285.94
            },

            {
                'name': '超级联盟',
                'value': 202.35
            },

            {
                'name': '动力火车',
                'value': 191.12
            },

            {
                'name': '一起爱',
                'value': 140.36
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 115.94
            },

            {
                'name': '天荒地老',
                'value': 62.29
            } ],
        'date': '2019-05-19-6'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 328.59
            },

            {
                'name': '一起幸福一起飞',
                'value': 300.76
            },

            {
                'name': '超级联盟',
                'value': 209.50
            },

            {
                'name': '动力火车',
                'value': 191.45
            },

            {
                'name': '一起爱',
                'value': 151.73
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 115.94
            },

            {
                'name': '天荒地老',
                'value': 62.29
            } ],
        'date': '2019-05-19-7'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 368.61
            },

            {
                'name': '一起幸福一起飞',
                'value': 316.73
            },

            {
                'name': '超级联盟',
                'value': 241.55
            },

            {
                'name': '动力火车',
                'value': 207.87
            },

            {
                'name': '一起爱',
                'value': 151.73
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 136.32
            },

            {
                'name': '天荒地老',
                'value': 64.83
            } ],
        'date': '2019-05-19-8'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 398.35
            },

            {
                'name': '一起幸福一起飞',
                'value': 372.63
            },

            {
                'name': '超级联盟',
                'value': 254.61
            },

            {
                'name': '动力火车',
                'value': 230.75
            },

            {
                'name': '一起爱',
                'value': 172.83
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 140.94
            },

            {
                'name': '天荒地老',
                'value': 64.83
            } ],
        'date': '2019-05-19-9'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 434.84
            },

            {
                'name': '一起幸福一起飞',
                'value': 373.21
            },

            {
                'name': '动力火车',
                'value': 285.72
            },

            {
                'name': '超级联盟',
                'value': 274.61
            },

            {
                'name': '一起爱',
                'value': 176.08
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 163.97
            },

            {
                'name': '天荒地老',
                'value': 70.23
            } ],
        'date': '2019-05-19-10'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 489.33
            },

            {
                'name': '一起幸福一起飞',
                'value': 414.58
            },

            {
                'name': '动力火车',
                'value': 287.78
            },

            {
                'name': '超级联盟',
                'value': 275.87
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 178.87
            },

            {
                'name': '一起爱',
                'value': 176.08
            },

            {
                'name': '天荒地老',
                'value': 103.47
            } ],
        'date': '2019-05-19-11'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 502.56
            },

            {
                'name': '一起幸福一起飞',
                'value': 432.13
            },

            {
                'name': '动力火车',
                'value': 305.55
            },

            {
                'name': '超级联盟',
                'value': 275.87
            },

            {
                'name': '一起爱',
                'value': 188.08
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 181.70
            },

            {
                'name': '天荒地老',
                'value': 103.47
            } ],
        'date': '2019-05-19-12'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 510.50
            },

            {
                'name': '一起幸福一起飞',
                'value': 432.13
            },

            {
                'name': '动力火车',
                'value': 311.37
            },

            {
                'name': '超级联盟',
                'value': 283.72
            },

            {
                'name': '一起爱',
                'value': 188.08
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 181.70
            },

            {
                'name': '天荒地老',
                'value': 127.47
            } ],
        'date': '2019-05-19-13'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 521.25
            },

            {
                'name': '一起幸福一起飞',
                'value': 439.48
            },

            {
                'name': '动力火车',
                'value': 322.25
            },

            {
                'name': '超级联盟',
                'value': 308.39
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 198.15
            },

            {
                'name': '一起爱',
                'value': 189.45
            },

            {
                'name': '天荒地老',
                'value': 128.62
            } ],
        'date': '2019-05-19-14'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 540.93
            },

            {
                'name': '一起幸福一起飞',
                'value': 440.65
            },

            {
                'name': '动力火车',
                'value': 322.25
            },

            {
                'name': '超级联盟',
                'value': 308.39
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 198.15
            },

            {
                'name': '一起爱',
                'value': 189.77
            },

            {
                'name': '天荒地老',
                'value': 128.62
            } ],
        'date': '2019-05-19-15'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 545.30
            },

            {
                'name': '一起幸福一起飞',
                'value': 440.95
            },

            {
                'name': '动力火车',
                'value': 333.85
            },

            {
                'name': '超级联盟',
                'value': 309.94
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 213.48
            },

            {
                'name': '一起爱',
                'value': 201.68
            },

            {
                'name': '天荒地老',
                'value': 128.62
            } ],
        'date': '2019-05-19-16'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 550.32
            },

            {
                'name': '一起幸福一起飞',
                'value': 442.22
            },

            {
                'name': '动力火车',
                'value': 336.16
            },

            {
                'name': '超级联盟',
                'value': 310.37
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 221.68
            },

            {
                'name': '一起爱',
                'value': 202.74
            },

            {
                'name': '天荒地老',
                'value': 128.62
            } ],
        'date': '2019-05-19-17'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 553.44
            },

            {
                'name': '一起幸福一起飞',
                'value': 456.67
            },

            {
                'name': '动力火车',
                'value': 338.98
            },

            {
                'name': '超级联盟',
                'value': 312.44
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 222.75
            },

            {
                'name': '一起爱',
                'value': 208.00
            },

            {
                'name': '天荒地老',
                'value': 149.32
            } ],
        'date': '2019-05-19-18'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 574.52
            },

            {
                'name': '一起幸福一起飞',
                'value': 464.05
            },

            {
                'name': '动力火车',
                'value': 340.21
            },

            {
                'name': '超级联盟',
                'value': 312.71
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 228.67
            },

            {
                'name': '一起爱',
                'value': 208.62
            },

            {
                'name': '天荒地老',
                'value': 157.31
            } ],
        'date': '2019-05-19-19'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 580.28
            },

            {
                'name': '一起幸福一起飞',
                'value': 490.92
            },

            {
                'name': '动力火车',
                'value': 341.62
            },

            {
                'name': '超级联盟',
                'value': 323.87
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 228.95
            },

            {
                'name': '一起爱',
                'value': 208.62
            },

            {
                'name': '天荒地老',
                'value': 159.54
            } ],
        'date': '2019-05-19-20'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 593.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 492.56
            },

            {
                'name': '动力火车',
                'value': 349.50
            },

            {
                'name': '超级联盟',
                'value': 338.59
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 230.46
            },

            {
                'name': '一起爱',
                'value': 214.63
            },

            {
                'name': '天荒地老',
                'value': 166.25
            } ],
        'date': '2019-05-19-21'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 594.55
            },

            {
                'name': '一起幸福一起飞',
                'value': 504.04
            },

            {
                'name': '动力火车',
                'value': 349.50
            },

            {
                'name': '超级联盟',
                'value': 348.08
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 230.46
            },

            {
                'name': '一起爱',
                'value': 219.03
            },

            {
                'name': '天荒地老',
                'value': 174.04
            } ],
        'date': '2019-05-19-22'
    },

    {
        'category': '2019-05-19',
        'data': [

            {
                'name': '行者无畏',
                'value': 594.55
            },

            {
                'name': '一起幸福一起飞',
                'value': 504.04
            },

            {
                'name': '超级联盟',
                'value': 368.16
            },

            {
                'name': '动力火车',
                'value': 353.05
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 230.46
            },

            {
                'name': '一起爱',
                'value': 220.32
            },

            {
                'name': '天荒地老',
                'value': 174.04
            } ],
        'date': '2019-05-19-23'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 599.31
            },

            {
                'name': '一起幸福一起飞',
                'value': 511.19
            },

            {
                'name': '超级联盟',
                'value': 368.16
            },

            {
                'name': '动力火车',
                'value': 353.05
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 236.52
            },

            {
                'name': '一起爱',
                'value': 220.32
            },

            {
                'name': '天荒地老',
                'value': 174.04
            } ],
        'date': '2019-05-20-0'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 599.31
            },

            {
                'name': '一起幸福一起飞',
                'value': 512.35
            },

            {
                'name': '超级联盟',
                'value': 376.37
            },

            {
                'name': '动力火车',
                'value': 353.05
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 237.61
            },

            {
                'name': '一起爱',
                'value': 220.32
            },

            {
                'name': '天荒地老',
                'value': 174.04
            } ],
        'date': '2019-05-20-1'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 599.31
            },

            {
                'name': '一起幸福一起飞',
                'value': 512.35
            },

            {
                'name': '超级联盟',
                'value': 377.14
            },

            {
                'name': '动力火车',
                'value': 353.05
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 237.61
            },

            {
                'name': '一起爱',
                'value': 220.32
            },

            {
                'name': '天荒地老',
                'value': 174.04
            } ],
        'date': '2019-05-20-2'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 599.31
            },

            {
                'name': '一起幸福一起飞',
                'value': 514.72
            },

            {
                'name': '超级联盟',
                'value': 377.14
            },

            {
                'name': '动力火车',
                'value': 353.05
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 237.61
            },

            {
                'name': '一起爱',
                'value': 220.32
            },

            {
                'name': '天荒地老',
                'value': 174.04
            } ],
        'date': '2019-05-20-3'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 599.31
            },

            {
                'name': '一起幸福一起飞',
                'value': 514.72
            },

            {
                'name': '超级联盟',
                'value': 377.14
            },

            {
                'name': '动力火车',
                'value': 353.05
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 239.12
            },

            {
                'name': '一起爱',
                'value': 224.01
            },

            {
                'name': '天荒地老',
                'value': 174.04
            } ],
        'date': '2019-05-20-4'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 599.31
            },

            {
                'name': '一起幸福一起飞',
                'value': 514.72
            },

            {
                'name': '超级联盟',
                'value': 377.14
            },

            {
                'name': '动力火车',
                'value': 353.05
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 239.12
            },

            {
                'name': '一起爱',
                'value': 224.01
            },

            {
                'name': '天荒地老',
                'value': 174.04
            } ],
        'date': '2019-05-20-5'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 599.31
            },

            {
                'name': '一起幸福一起飞',
                'value': 514.72
            },

            {
                'name': '超级联盟',
                'value': 377.14
            },

            {
                'name': '动力火车',
                'value': 353.05
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 240.08
            },

            {
                'name': '一起爱',
                'value': 224.01
            },

            {
                'name': '天荒地老',
                'value': 174.04
            } ],
        'date': '2019-05-20-6'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 604.61
            },

            {
                'name': '一起幸福一起飞',
                'value': 531.71
            },

            {
                'name': '超级联盟',
                'value': 387.64
            },

            {
                'name': '动力火车',
                'value': 358.09
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 255.04
            },

            {
                'name': '一起爱',
                'value': 231.12
            },

            {
                'name': '天荒地老',
                'value': 185.86
            } ],
        'date': '2019-05-20-7'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 632.87
            },

            {
                'name': '一起幸福一起飞',
                'value': 587.32
            },

            {
                'name': '超级联盟',
                'value': 428.86
            },

            {
                'name': '动力火车',
                'value': 368.17
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 264.93
            },

            {
                'name': '一起爱',
                'value': 243.20
            },

            {
                'name': '天荒地老',
                'value': 186.56
            } ],
        'date': '2019-05-20-8'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 651.19
            },

            {
                'name': '一起幸福一起飞',
                'value': 617.60
            },

            {
                'name': '超级联盟',
                'value': 428.86
            },

            {
                'name': '动力火车',
                'value': 428.80
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 274.63
            },

            {
                'name': '一起爱',
                'value': 249.11
            },

            {
                'name': '天荒地老',
                'value': 196.10
            } ],
        'date': '2019-05-20-9'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 654.64
            },

            {
                'name': '一起幸福一起飞',
                'value': 619.78
            },

            {
                'name': '动力火车',
                'value': 433.87
            },

            {
                'name': '超级联盟',
                'value': 429.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 279.18
            },

            {
                'name': '一起爱',
                'value': 249.71
            },

            {
                'name': '天荒地老',
                'value': 203.54
            } ],
        'date': '2019-05-20-10'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 654.64
            },

            {
                'name': '一起幸福一起飞',
                'value': 627.15
            },

            {
                'name': '动力火车',
                'value': 436.72
            },

            {
                'name': '超级联盟',
                'value': 429.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 281.37
            },

            {
                'name': '一起爱',
                'value': 249.71
            },

            {
                'name': '天荒地老',
                'value': 216.36
            } ],
        'date': '2019-05-20-11'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 659.77
            },

            {
                'name': '一起幸福一起飞',
                'value': 628.34
            },

            {
                'name': '动力火车',
                'value': 443.68
            },

            {
                'name': '超级联盟',
                'value': 429.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 281.75
            },

            {
                'name': '一起爱',
                'value': 249.71
            },

            {
                'name': '天荒地老',
                'value': 216.36
            } ],
        'date': '2019-05-20-12'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 668.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 628.34
            },

            {
                'name': '动力火车',
                'value': 446.49
            },

            {
                'name': '超级联盟',
                'value': 430.18
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 281.75
            },

            {
                'name': '一起爱',
                'value': 249.71
            },

            {
                'name': '天荒地老',
                'value': 217.57
            } ],
        'date': '2019-05-20-13'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 670.76
            },

            {
                'name': '一起幸福一起飞',
                'value': 628.34
            },

            {
                'name': '动力火车',
                'value': 447.47
            },

            {
                'name': '超级联盟',
                'value': 430.18
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 291.79
            },

            {
                'name': '一起爱',
                'value': 254.21
            },

            {
                'name': '天荒地老',
                'value': 218.90
            } ],
        'date': '2019-05-20-14'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 672.33
            },

            {
                'name': '一起幸福一起飞',
                'value': 629.13
            },

            {
                'name': '动力火车',
                'value': 449.38
            },

            {
                'name': '超级联盟',
                'value': 430.18
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 291.79
            },

            {
                'name': '一起爱',
                'value': 254.21
            },

            {
                'name': '天荒地老',
                'value': 218.90
            } ],
        'date': '2019-05-20-15'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 675.78
            },

            {
                'name': '一起幸福一起飞',
                'value': 629.57
            },

            {
                'name': '动力火车',
                'value': 451.79
            },

            {
                'name': '超级联盟',
                'value': 431.34
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 298.01
            },

            {
                'name': '一起爱',
                'value': 261.02
            },

            {
                'name': '天荒地老',
                'value': 218.90
            } ],
        'date': '2019-05-20-16'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 697.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 629.57
            },

            {
                'name': '动力火车',
                'value': 451.79
            },

            {
                'name': '超级联盟',
                'value': 435.42
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 298.01
            },

            {
                'name': '一起爱',
                'value': 261.02
            },

            {
                'name': '天荒地老',
                'value': 218.90
            } ],
        'date': '2019-05-20-17'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 705.51
            },

            {
                'name': '一起幸福一起飞',
                'value': 630.07
            },

            {
                'name': '动力火车',
                'value': 458.87
            },

            {
                'name': '超级联盟',
                'value': 440.63
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 298.01
            },

            {
                'name': '一起爱',
                'value': 265.13
            },

            {
                'name': '天荒地老',
                'value': 223.51
            } ],
        'date': '2019-05-20-18'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 711.24
            },

            {
                'name': '一起幸福一起飞',
                'value': 632.55
            },

            {
                'name': '动力火车',
                'value': 461.84
            },

            {
                'name': '超级联盟',
                'value': 460.14
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 300.12
            },

            {
                'name': '一起爱',
                'value': 265.13
            },

            {
                'name': '天荒地老',
                'value': 223.51
            } ],
        'date': '2019-05-20-19'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 715.30
            },

            {
                'name': '一起幸福一起飞',
                'value': 634.13
            },

            {
                'name': '动力火车',
                'value': 483.82
            },

            {
                'name': '超级联盟',
                'value': 475.34
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 303.13
            },

            {
                'name': '一起爱',
                'value': 265.13
            },

            {
                'name': '天荒地老',
                'value': 223.79
            } ],
        'date': '2019-05-20-20'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 735.23
            },

            {
                'name': '一起幸福一起飞',
                'value': 645.26
            },

            {
                'name': '动力火车',
                'value': 507.33
            },

            {
                'name': '超级联盟',
                'value': 476.31
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 303.13
            },

            {
                'name': '一起爱',
                'value': 272.77
            },

            {
                'name': '天荒地老',
                'value': 224.64
            } ],
        'date': '2019-05-20-21'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 779.80
            },

            {
                'name': '一起幸福一起飞',
                'value': 669.75
            },

            {
                'name': '动力火车',
                'value': 514.96
            },

            {
                'name': '超级联盟',
                'value': 476.31
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 303.13
            },

            {
                'name': '一起爱',
                'value': 284.21
            },

            {
                'name': '天荒地老',
                'value': 227.25
            } ],
        'date': '2019-05-20-22'
    },

    {
        'category': '2019-05-20',
        'data': [

            {
                'name': '行者无畏',
                'value': 785.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 683.03
            },

            {
                'name': '动力火车',
                'value': 514.96
            },

            {
                'name': '超级联盟',
                'value': 482.96
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 303.13
            },

            {
                'name': '一起爱',
                'value': 284.21
            },

            {
                'name': '天荒地老',
                'value': 234.27
            } ],
        'date': '2019-05-20-23'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 785.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 688.42
            },

            {
                'name': '动力火车',
                'value': 514.96
            },

            {
                'name': '超级联盟',
                'value': 482.96
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 303.13
            },

            {
                'name': '一起爱',
                'value': 284.86
            },

            {
                'name': '天荒地老',
                'value': 234.27
            } ],
        'date': '2019-05-21-0'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 785.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 688.42
            },

            {
                'name': '动力火车',
                'value': 514.96
            },

            {
                'name': '超级联盟',
                'value': 482.96
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 303.13
            },

            {
                'name': '一起爱',
                'value': 284.86
            },

            {
                'name': '天荒地老',
                'value': 234.27
            } ],
        'date': '2019-05-21-1'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 785.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 688.42
            },

            {
                'name': '动力火车',
                'value': 514.96
            },

            {
                'name': '超级联盟',
                'value': 482.96
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 303.13
            },

            {
                'name': '一起爱',
                'value': 284.86
            },

            {
                'name': '天荒地老',
                'value': 234.27
            } ],
        'date': '2019-05-21-2'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 785.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 688.42
            },

            {
                'name': '动力火车',
                'value': 514.96
            },

            {
                'name': '超级联盟',
                'value': 482.96
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 303.13
            },

            {
                'name': '一起爱',
                'value': 284.86
            },

            {
                'name': '天荒地老',
                'value': 234.27
            } ],
        'date': '2019-05-21-3'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 785.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 688.42
            },

            {
                'name': '动力火车',
                'value': 514.96
            },

            {
                'name': '超级联盟',
                'value': 482.96
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 305.57
            },

            {
                'name': '一起爱',
                'value': 284.86
            },

            {
                'name': '天荒地老',
                'value': 234.27
            } ],
        'date': '2019-05-21-4'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 785.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 688.42
            },

            {
                'name': '动力火车',
                'value': 514.96
            },

            {
                'name': '超级联盟',
                'value': 482.96
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 305.57
            },

            {
                'name': '一起爱',
                'value': 284.86
            },

            {
                'name': '天荒地老',
                'value': 234.27
            } ],
        'date': '2019-05-21-5'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 785.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 698.75
            },

            {
                'name': '动力火车',
                'value': 517.31
            },

            {
                'name': '超级联盟',
                'value': 482.96
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 305.57
            },

            {
                'name': '一起爱',
                'value': 284.86
            },

            {
                'name': '天荒地老',
                'value': 234.27
            } ],
        'date': '2019-05-21-6'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 785.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 725.12
            },

            {
                'name': '动力火车',
                'value': 517.31
            },

            {
                'name': '超级联盟',
                'value': 491.02
            },

            {
                'name': '一起爱',
                'value': 322.57
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 313.69
            },

            {
                'name': '天荒地老',
                'value': 241.38
            } ],
        'date': '2019-05-21-7'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 833.23
            },

            {
                'name': '一起幸福一起飞',
                'value': 754.11
            },

            {
                'name': '动力火车',
                'value': 528.51
            },

            {
                'name': '超级联盟',
                'value': 514.92
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 348.17
            },

            {
                'name': '一起爱',
                'value': 325.14
            },

            {
                'name': '天荒地老',
                'value': 256.38
            } ],
        'date': '2019-05-21-8'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 859.27
            },

            {
                'name': '一起幸福一起飞',
                'value': 765.24
            },

            {
                'name': '动力火车',
                'value': 563.59
            },

            {
                'name': '超级联盟',
                'value': 541.20
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 359.71
            },

            {
                'name': '一起爱',
                'value': 334.55
            },

            {
                'name': '天荒地老',
                'value': 256.38
            } ],
        'date': '2019-05-21-9'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 870.59
            },

            {
                'name': '一起幸福一起飞',
                'value': 780.38
            },

            {
                'name': '动力火车',
                'value': 569.00
            },

            {
                'name': '超级联盟',
                'value': 548.01
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 371.71
            },

            {
                'name': '一起爱',
                'value': 334.55
            },

            {
                'name': '天荒地老',
                'value': 261.46
            } ],
        'date': '2019-05-21-10'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 870.59
            },

            {
                'name': '一起幸福一起飞',
                'value': 780.38
            },

            {
                'name': '动力火车',
                'value': 571.65
            },

            {
                'name': '超级联盟',
                'value': 548.01
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 377.55
            },

            {
                'name': '一起爱',
                'value': 334.55
            },

            {
                'name': '天荒地老',
                'value': 266.00
            } ],
        'date': '2019-05-21-11'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 873.54
            },

            {
                'name': '一起幸福一起飞',
                'value': 782.77
            },

            {
                'name': '动力火车',
                'value': 571.65
            },

            {
                'name': '超级联盟',
                'value': 548.01
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 384.41
            },

            {
                'name': '一起爱',
                'value': 334.55
            },

            {
                'name': '天荒地老',
                'value': 294.17
            } ],
        'date': '2019-05-21-12'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 877.71
            },

            {
                'name': '一起幸福一起飞',
                'value': 784.98
            },

            {
                'name': '动力火车',
                'value': 575.31
            },

            {
                'name': '超级联盟',
                'value': 548.79
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 389.88
            },

            {
                'name': '一起爱',
                'value': 335.52
            },

            {
                'name': '天荒地老',
                'value': 294.17
            } ],
        'date': '2019-05-21-13'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 878.65
            },

            {
                'name': '一起幸福一起飞',
                'value': 792.38
            },

            {
                'name': '动力火车',
                'value': 578.67
            },

            {
                'name': '超级联盟',
                'value': 548.79
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 401.48
            },

            {
                'name': '一起爱',
                'value': 337.35
            },

            {
                'name': '天荒地老',
                'value': 294.17
            } ],
        'date': '2019-05-21-14'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 880.27
            },

            {
                'name': '一起幸福一起飞',
                'value': 792.71
            },

            {
                'name': '动力火车',
                'value': 580.07
            },

            {
                'name': '超级联盟',
                'value': 548.79
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 402.45
            },

            {
                'name': '一起爱',
                'value': 337.35
            },

            {
                'name': '天荒地老',
                'value': 294.17
            } ],
        'date': '2019-05-21-15'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 880.27
            },

            {
                'name': '一起幸福一起飞',
                'value': 792.71
            },

            {
                'name': '动力火车',
                'value': 580.07
            },

            {
                'name': '超级联盟',
                'value': 548.79
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 402.45
            },

            {
                'name': '一起爱',
                'value': 337.35
            },

            {
                'name': '天荒地老',
                'value': 294.17
            } ],
        'date': '2019-05-21-16'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 883.06
            },

            {
                'name': '一起幸福一起飞',
                'value': 798.73
            },

            {
                'name': '动力火车',
                'value': 580.07
            },

            {
                'name': '超级联盟',
                'value': 559.33
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 403.78
            },

            {
                'name': '一起爱',
                'value': 337.35
            },

            {
                'name': '天荒地老',
                'value': 294.17
            } ],
        'date': '2019-05-21-17'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 883.37
            },

            {
                'name': '一起幸福一起飞',
                'value': 798.73
            },

            {
                'name': '动力火车',
                'value': 585.07
            },

            {
                'name': '超级联盟',
                'value': 559.33
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 407.11
            },

            {
                'name': '一起爱',
                'value': 345.35
            },

            {
                'name': '天荒地老',
                'value': 299.45
            } ],
        'date': '2019-05-21-18'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 885.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 802.36
            },

            {
                'name': '动力火车',
                'value': 603.31
            },

            {
                'name': '超级联盟',
                'value': 561.26
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 417.11
            },

            {
                'name': '一起爱',
                'value': 345.35
            },

            {
                'name': '天荒地老',
                'value': 299.45
            } ],
        'date': '2019-05-21-19'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 885.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 808.02
            },

            {
                'name': '动力火车',
                'value': 606.88
            },

            {
                'name': '超级联盟',
                'value': 561.65
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 432.11
            },

            {
                'name': '一起爱',
                'value': 351.75
            },

            {
                'name': '天荒地老',
                'value': 299.45
            } ],
        'date': '2019-05-21-20'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 904.51
            },

            {
                'name': '一起幸福一起飞',
                'value': 811.33
            },

            {
                'name': '动力火车',
                'value': 610.25
            },

            {
                'name': '超级联盟',
                'value': 577.16
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 432.11
            },

            {
                'name': '一起爱',
                'value': 360.05
            },

            {
                'name': '天荒地老',
                'value': 322.87
            } ],
        'date': '2019-05-21-21'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 917.93
            },

            {
                'name': '一起幸福一起飞',
                'value': 820.45
            },

            {
                'name': '动力火车',
                'value': 625.34
            },

            {
                'name': '超级联盟',
                'value': 577.16
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 432.11
            },

            {
                'name': '一起爱',
                'value': 365.26
            },

            {
                'name': '天荒地老',
                'value': 322.87
            } ],
        'date': '2019-05-21-22'
    },

    {
        'category': '2019-05-21',
        'data': [

            {
                'name': '行者无畏',
                'value': 923.17
            },

            {
                'name': '一起幸福一起飞',
                'value': 830.50
            },

            {
                'name': '动力火车',
                'value': 625.34
            },

            {
                'name': '超级联盟',
                'value': 582.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 432.11
            },

            {
                'name': '一起爱',
                'value': 365.26
            },

            {
                'name': '天荒地老',
                'value': 322.87
            } ],
        'date': '2019-05-21-23'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 929.73
            },

            {
                'name': '一起幸福一起飞',
                'value': 842.46
            },

            {
                'name': '动力火车',
                'value': 636.87
            },

            {
                'name': '超级联盟',
                'value': 582.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 441.07
            },

            {
                'name': '一起爱',
                'value': 367.37
            },

            {
                'name': '天荒地老',
                'value': 322.87
            } ],
        'date': '2019-05-22-0'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 929.73
            },

            {
                'name': '一起幸福一起飞',
                'value': 846.11
            },

            {
                'name': '动力火车',
                'value': 636.87
            },

            {
                'name': '超级联盟',
                'value': 582.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 441.07
            },

            {
                'name': '一起爱',
                'value': 367.37
            },

            {
                'name': '天荒地老',
                'value': 322.87
            } ],
        'date': '2019-05-22-1'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 929.73
            },

            {
                'name': '一起幸福一起飞',
                'value': 846.11
            },

            {
                'name': '动力火车',
                'value': 636.87
            },

            {
                'name': '超级联盟',
                'value': 582.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 441.07
            },

            {
                'name': '一起爱',
                'value': 367.37
            },

            {
                'name': '天荒地老',
                'value': 322.87
            } ],
        'date': '2019-05-22-2'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 929.73
            },

            {
                'name': '一起幸福一起飞',
                'value': 846.11
            },

            {
                'name': '动力火车',
                'value': 636.87
            },

            {
                'name': '超级联盟',
                'value': 582.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 441.07
            },

            {
                'name': '一起爱',
                'value': 367.37
            },

            {
                'name': '天荒地老',
                'value': 322.87
            } ],
        'date': '2019-05-22-3'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 929.73
            },

            {
                'name': '一起幸福一起飞',
                'value': 846.11
            },

            {
                'name': '动力火车',
                'value': 636.87
            },

            {
                'name': '超级联盟',
                'value': 582.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 441.07
            },

            {
                'name': '一起爱',
                'value': 367.37
            },

            {
                'name': '天荒地老',
                'value': 322.87
            } ],
        'date': '2019-05-22-4'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 929.73
            },

            {
                'name': '一起幸福一起飞',
                'value': 846.11
            },

            {
                'name': '动力火车',
                'value': 636.87
            },

            {
                'name': '超级联盟',
                'value': 582.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 441.79
            },

            {
                'name': '一起爱',
                'value': 367.37
            },

            {
                'name': '天荒地老',
                'value': 322.87
            } ],
        'date': '2019-05-22-5'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 941.73
            },

            {
                'name': '一起幸福一起飞',
                'value': 851.99
            },

            {
                'name': '动力火车',
                'value': 636.87
            },

            {
                'name': '超级联盟',
                'value': 582.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 441.79
            },

            {
                'name': '一起爱',
                'value': 367.37
            },

            {
                'name': '天荒地老',
                'value': 322.87
            } ],
        'date': '2019-05-22-6'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 941.73
            },

            {
                'name': '一起幸福一起飞',
                'value': 871.54
            },

            {
                'name': '动力火车',
                'value': 658.85
            },

            {
                'name': '超级联盟',
                'value': 595.85
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 449.31
            },

            {
                'name': '一起爱',
                'value': 377.76
            },

            {
                'name': '天荒地老',
                'value': 322.87
            } ],
        'date': '2019-05-22-7'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 971.99
            },

            {
                'name': '一起幸福一起飞',
                'value': 902.94
            },

            {
                'name': '动力火车',
                'value': 664.90
            },

            {
                'name': '超级联盟',
                'value': 615.89
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 475.96
            },

            {
                'name': '一起爱',
                'value': 394.42
            },

            {
                'name': '天荒地老',
                'value': 337.99
            } ],
        'date': '2019-05-22-8'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 989.00
            },

            {
                'name': '一起幸福一起飞',
                'value': 934.19
            },

            {
                'name': '动力火车',
                'value': 674.46
            },

            {
                'name': '超级联盟',
                'value': 615.89
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 489.07
            },

            {
                'name': '一起爱',
                'value': 403.25
            },

            {
                'name': '天荒地老',
                'value': 343.16
            } ],
        'date': '2019-05-22-9'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 990.04
            },

            {
                'name': '一起幸福一起飞',
                'value': 946.19
            },

            {
                'name': '动力火车',
                'value': 677.76
            },

            {
                'name': '超级联盟',
                'value': 621.45
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 489.07
            },

            {
                'name': '一起爱',
                'value': 404.89
            },

            {
                'name': '天荒地老',
                'value': 343.16
            } ],
        'date': '2019-05-22-10'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 1003.36
            },

            {
                'name': '一起幸福一起飞',
                'value': 960.23
            },

            {
                'name': '动力火车',
                'value': 677.76
            },

            {
                'name': '超级联盟',
                'value': 621.45
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 489.07
            },

            {
                'name': '一起爱',
                'value': 406.02
            },

            {
                'name': '天荒地老',
                'value': 355.36
            } ],
        'date': '2019-05-22-11'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 1005.16
            },

            {
                'name': '一起幸福一起飞',
                'value': 960.23
            },

            {
                'name': '动力火车',
                'value': 677.91
            },

            {
                'name': '超级联盟',
                'value': 621.45
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 489.07
            },

            {
                'name': '一起爱',
                'value': 406.38
            },

            {
                'name': '天荒地老',
                'value': 355.36
            } ],
        'date': '2019-05-22-12'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 1005.85
            },

            {
                'name': '一起幸福一起飞',
                'value': 960.23
            },

            {
                'name': '动力火车',
                'value': 682.20
            },

            {
                'name': '超级联盟',
                'value': 621.45
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 489.07
            },

            {
                'name': '一起爱',
                'value': 407.01
            },

            {
                'name': '天荒地老',
                'value': 355.36
            } ],
        'date': '2019-05-22-13'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 1008.75
            },

            {
                'name': '一起幸福一起飞',
                'value': 960.23
            },

            {
                'name': '动力火车',
                'value': 682.20
            },

            {
                'name': '超级联盟',
                'value': 621.45
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 489.07
            },

            {
                'name': '一起爱',
                'value': 407.74
            },

            {
                'name': '天荒地老',
                'value': 355.36
            } ],
        'date': '2019-05-22-14'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 1009.13
            },

            {
                'name': '一起幸福一起飞',
                'value': 966.02
            },

            {
                'name': '动力火车',
                'value': 684.02
            },

            {
                'name': '超级联盟',
                'value': 621.45
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 489.07
            },

            {
                'name': '一起爱',
                'value': 407.74
            },

            {
                'name': '天荒地老',
                'value': 355.36
            } ],
        'date': '2019-05-22-15'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 1021.99
            },

            {
                'name': '一起幸福一起飞',
                'value': 967.18
            },

            {
                'name': '动力火车',
                'value': 684.02
            },

            {
                'name': '超级联盟',
                'value': 621.45
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 489.07
            },

            {
                'name': '一起爱',
                'value': 407.74
            },

            {
                'name': '天荒地老',
                'value': 355.36
            } ],
        'date': '2019-05-22-16'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 1023.86
            },

            {
                'name': '一起幸福一起飞',
                'value': 967.18
            },

            {
                'name': '动力火车',
                'value': 695.20
            },

            {
                'name': '超级联盟',
                'value': 621.73
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 489.07
            },

            {
                'name': '一起爱',
                'value': 408.69
            },

            {
                'name': '天荒地老',
                'value': 355.36
            } ],
        'date': '2019-05-22-17'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 1025.93
            },

            {
                'name': '一起幸福一起飞',
                'value': 971.21
            },

            {
                'name': '动力火车',
                'value': 695.47
            },

            {
                'name': '超级联盟',
                'value': 621.73
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 491.99
            },

            {
                'name': '一起爱',
                'value': 410.40
            },

            {
                'name': '天荒地老',
                'value': 355.36
            } ],
        'date': '2019-05-22-18'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 1028.61
            },

            {
                'name': '一起幸福一起飞',
                'value': 974.96
            },

            {
                'name': '动力火车',
                'value': 698.22
            },

            {
                'name': '超级联盟',
                'value': 622.64
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 497.67
            },

            {
                'name': '一起爱',
                'value': 420.45
            },

            {
                'name': '天荒地老',
                'value': 356.37
            } ],
        'date': '2019-05-22-19'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 1040.61
            },

            {
                'name': '一起幸福一起飞',
                'value': 974.96
            },

            {
                'name': '动力火车',
                'value': 700.55
            },

            {
                'name': '超级联盟',
                'value': 622.64
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 505.89
            },

            {
                'name': '一起爱',
                'value': 432.84
            },

            {
                'name': '天荒地老',
                'value': 364.65
            } ],
        'date': '2019-05-22-20'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 1052.99
            },

            {
                'name': '一起幸福一起飞',
                'value': 980.87
            },

            {
                'name': '动力火车',
                'value': 701.22
            },

            {
                'name': '超级联盟',
                'value': 622.64
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 508.93
            },

            {
                'name': '一起爱',
                'value': 433.93
            },

            {
                'name': '天荒地老',
                'value': 364.99
            } ],
        'date': '2019-05-22-21'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 1069.57
            },

            {
                'name': '一起幸福一起飞',
                'value': 994.43
            },

            {
                'name': '动力火车',
                'value': 702.41
            },

            {
                'name': '超级联盟',
                'value': 636.23
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 508.93
            },

            {
                'name': '一起爱',
                'value': 441.28
            },

            {
                'name': '天荒地老',
                'value': 380.31
            } ],
        'date': '2019-05-22-22'
    },

    {
        'category': '2019-05-22',
        'data': [

            {
                'name': '行者无畏',
                'value': 1089.74
            },

            {
                'name': '一起幸福一起飞',
                'value': 997.80
            },

            {
                'name': '动力火车',
                'value': 705.58
            },

            {
                'name': '超级联盟',
                'value': 643.82
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 519.31
            },

            {
                'name': '一起爱',
                'value': 441.28
            },

            {
                'name': '天荒地老',
                'value': 382.85
            } ],
        'date': '2019-05-22-23'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1108.20
            },

            {
                'name': '一起幸福一起飞',
                'value': 1012.04
            },

            {
                'name': '动力火车',
                'value': 705.58
            },

            {
                'name': '超级联盟',
                'value': 643.82
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 519.31
            },

            {
                'name': '一起爱',
                'value': 441.28
            },

            {
                'name': '天荒地老',
                'value': 382.85
            } ],
        'date': '2019-05-23-0'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1127.14
            },

            {
                'name': '一起幸福一起飞',
                'value': 1012.04
            },

            {
                'name': '动力火车',
                'value': 705.58
            },

            {
                'name': '超级联盟',
                'value': 643.82
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 519.31
            },

            {
                'name': '一起爱',
                'value': 441.28
            },

            {
                'name': '天荒地老',
                'value': 382.85
            } ],
        'date': '2019-05-23-1'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1127.14
            },

            {
                'name': '一起幸福一起飞',
                'value': 1012.04
            },

            {
                'name': '动力火车',
                'value': 705.58
            },

            {
                'name': '超级联盟',
                'value': 643.82
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 519.31
            },

            {
                'name': '一起爱',
                'value': 441.28
            },

            {
                'name': '天荒地老',
                'value': 382.85
            } ],
        'date': '2019-05-23-2'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1127.14
            },

            {
                'name': '一起幸福一起飞',
                'value': 1012.04
            },

            {
                'name': '动力火车',
                'value': 705.58
            },

            {
                'name': '超级联盟',
                'value': 643.82
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 519.31
            },

            {
                'name': '一起爱',
                'value': 441.28
            },

            {
                'name': '天荒地老',
                'value': 382.85
            } ],
        'date': '2019-05-23-3'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1127.14
            },

            {
                'name': '一起幸福一起飞',
                'value': 1012.04
            },

            {
                'name': '动力火车',
                'value': 705.58
            },

            {
                'name': '超级联盟',
                'value': 643.82
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 519.31
            },

            {
                'name': '一起爱',
                'value': 441.28
            },

            {
                'name': '天荒地老',
                'value': 382.85
            } ],
        'date': '2019-05-23-4'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1132.39
            },

            {
                'name': '一起幸福一起飞',
                'value': 1012.04
            },

            {
                'name': '动力火车',
                'value': 705.58
            },

            {
                'name': '超级联盟',
                'value': 643.82
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 519.31
            },

            {
                'name': '一起爱',
                'value': 441.28
            },

            {
                'name': '天荒地老',
                'value': 382.85
            } ],
        'date': '2019-05-23-5'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1132.39
            },

            {
                'name': '一起幸福一起飞',
                'value': 1012.04
            },

            {
                'name': '动力火车',
                'value': 705.58
            },

            {
                'name': '超级联盟',
                'value': 643.82
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 519.31
            },

            {
                'name': '一起爱',
                'value': 441.28
            },

            {
                'name': '天荒地老',
                'value': 382.85
            } ],
        'date': '2019-05-23-6'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1140.65
            },

            {
                'name': '一起幸福一起飞',
                'value': 1032.70
            },

            {
                'name': '动力火车',
                'value': 710.78
            },

            {
                'name': '超级联盟',
                'value': 656.36
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 535.31
            },

            {
                'name': '一起爱',
                'value': 476.54
            },

            {
                'name': '天荒地老',
                'value': 382.85
            } ],
        'date': '2019-05-23-7'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1180.00
            },

            {
                'name': '一起幸福一起飞',
                'value': 1065.42
            },

            {
                'name': '动力火车',
                'value': 742.14
            },

            {
                'name': '超级联盟',
                'value': 695.53
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 574.58
            },

            {
                'name': '一起爱',
                'value': 488.35
            },

            {
                'name': '天荒地老',
                'value': 386.17
            } ],
        'date': '2019-05-23-8'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1213.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 1080.85
            },

            {
                'name': '动力火车',
                'value': 762.31
            },

            {
                'name': '超级联盟',
                'value': 718.85
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 585.08
            },

            {
                'name': '一起爱',
                'value': 504.70
            },

            {
                'name': '天荒地老',
                'value': 391.68
            } ],
        'date': '2019-05-23-9'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1235.39
            },

            {
                'name': '一起幸福一起飞',
                'value': 1082.85
            },

            {
                'name': '动力火车',
                'value': 762.31
            },

            {
                'name': '超级联盟',
                'value': 731.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 585.08
            },

            {
                'name': '一起爱',
                'value': 506.26
            },

            {
                'name': '天荒地老',
                'value': 401.38
            } ],
        'date': '2019-05-23-10'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1238.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 1082.85
            },

            {
                'name': '动力火车',
                'value': 787.35
            },

            {
                'name': '超级联盟',
                'value': 733.38
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 585.08
            },

            {
                'name': '一起爱',
                'value': 506.26
            },

            {
                'name': '天荒地老',
                'value': 406.82
            } ],
        'date': '2019-05-23-11'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1238.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 1084.67
            },

            {
                'name': '动力火车',
                'value': 787.35
            },

            {
                'name': '超级联盟',
                'value': 733.38
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 585.08
            },

            {
                'name': '一起爱',
                'value': 507.42
            },

            {
                'name': '天荒地老',
                'value': 406.82
            } ],
        'date': '2019-05-23-12'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1245.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 1084.67
            },

            {
                'name': '动力火车',
                'value': 787.35
            },

            {
                'name': '超级联盟',
                'value': 733.38
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 585.08
            },

            {
                'name': '一起爱',
                'value': 508.22
            },

            {
                'name': '天荒地老',
                'value': 406.82
            } ],
        'date': '2019-05-23-13'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1254.39
            },

            {
                'name': '一起幸福一起飞',
                'value': 1104.67
            },

            {
                'name': '动力火车',
                'value': 787.81
            },

            {
                'name': '超级联盟',
                'value': 735.37
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 585.08
            },

            {
                'name': '一起爱',
                'value': 508.22
            },

            {
                'name': '天荒地老',
                'value': 407.43
            } ],
        'date': '2019-05-23-14'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1256.91
            },

            {
                'name': '一起幸福一起飞',
                'value': 1104.67
            },

            {
                'name': '动力火车',
                'value': 787.81
            },

            {
                'name': '超级联盟',
                'value': 735.37
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 585.08
            },

            {
                'name': '一起爱',
                'value': 508.22
            },

            {
                'name': '天荒地老',
                'value': 407.60
            } ],
        'date': '2019-05-23-15'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1260.57
            },

            {
                'name': '一起幸福一起飞',
                'value': 1104.67
            },

            {
                'name': '动力火车',
                'value': 790.83
            },

            {
                'name': '超级联盟',
                'value': 740.31
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 585.08
            },

            {
                'name': '一起爱',
                'value': 509.47
            },

            {
                'name': '天荒地老',
                'value': 407.60
            } ],
        'date': '2019-05-23-16'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1260.67
            },

            {
                'name': '一起幸福一起飞',
                'value': 1104.67
            },

            {
                'name': '动力火车',
                'value': 791.42
            },

            {
                'name': '超级联盟',
                'value': 743.21
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 585.08
            },

            {
                'name': '一起爱',
                'value': 509.47
            },

            {
                'name': '天荒地老',
                'value': 407.60
            } ],
        'date': '2019-05-23-17'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1260.96
            },

            {
                'name': '一起幸福一起飞',
                'value': 1104.90
            },

            {
                'name': '动力火车',
                'value': 796.54
            },

            {
                'name': '超级联盟',
                'value': 750.06
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 585.08
            },

            {
                'name': '一起爱',
                'value': 511.67
            },

            {
                'name': '天荒地老',
                'value': 407.60
            } ],
        'date': '2019-05-23-18'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1267.73
            },

            {
                'name': '一起幸福一起飞',
                'value': 1106.49
            },

            {
                'name': '动力火车',
                'value': 799.14
            },

            {
                'name': '超级联盟',
                'value': 752.70
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 588.28
            },

            {
                'name': '一起爱',
                'value': 516.81
            },

            {
                'name': '天荒地老',
                'value': 410.62
            } ],
        'date': '2019-05-23-19'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1275.16
            },

            {
                'name': '一起幸福一起飞',
                'value': 1106.49
            },

            {
                'name': '动力火车',
                'value': 799.60
            },

            {
                'name': '超级联盟',
                'value': 783.23
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 591.23
            },

            {
                'name': '一起爱',
                'value': 523.80
            },

            {
                'name': '天荒地老',
                'value': 410.62
            } ],
        'date': '2019-05-23-20'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1291.74
            },

            {
                'name': '一起幸福一起飞',
                'value': 1111.45
            },

            {
                'name': '动力火车',
                'value': 801.30
            },

            {
                'name': '超级联盟',
                'value': 786.60
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 599.18
            },

            {
                'name': '一起爱',
                'value': 523.80
            },

            {
                'name': '天荒地老',
                'value': 410.62
            } ],
        'date': '2019-05-23-21'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1296.56
            },

            {
                'name': '一起幸福一起飞',
                'value': 1120.67
            },

            {
                'name': '动力火车',
                'value': 804.81
            },

            {
                'name': '超级联盟',
                'value': 799.31
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 600.98
            },

            {
                'name': '一起爱',
                'value': 526.83
            },

            {
                'name': '天荒地老',
                'value': 410.62
            } ],
        'date': '2019-05-23-22'
    },

    {
        'category': '2019-05-23',
        'data': [

            {
                'name': '行者无畏',
                'value': 1300.56
            },

            {
                'name': '一起幸福一起飞',
                'value': 1127.63
            },

            {
                'name': '动力火车',
                'value': 807.60
            },

            {
                'name': '超级联盟',
                'value': 807.49
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 611.75
            },

            {
                'name': '一起爱',
                'value': 528.18
            },

            {
                'name': '天荒地老',
                'value': 417.42
            } ],
        'date': '2019-05-23-23'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1301.34
            },

            {
                'name': '一起幸福一起飞',
                'value': 1145.14
            },

            {
                'name': '超级联盟',
                'value': 815.58
            },

            {
                'name': '动力火车',
                'value': 807.75
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 630.40
            },

            {
                'name': '一起爱',
                'value': 528.18
            },

            {
                'name': '天荒地老',
                'value': 417.42
            } ],
        'date': '2019-05-24-0'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1301.34
            },

            {
                'name': '一起幸福一起飞',
                'value': 1145.14
            },

            {
                'name': '超级联盟',
                'value': 815.58
            },

            {
                'name': '动力火车',
                'value': 807.75
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 630.40
            },

            {
                'name': '一起爱',
                'value': 529.07
            },

            {
                'name': '天荒地老',
                'value': 420.47
            } ],
        'date': '2019-05-24-1'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1304.51
            },

            {
                'name': '一起幸福一起飞',
                'value': 1145.14
            },

            {
                'name': '超级联盟',
                'value': 815.58
            },

            {
                'name': '动力火车',
                'value': 807.75
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 630.40
            },

            {
                'name': '一起爱',
                'value': 529.07
            },

            {
                'name': '天荒地老',
                'value': 420.93
            } ],
        'date': '2019-05-24-2'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1304.51
            },

            {
                'name': '一起幸福一起飞',
                'value': 1145.14
            },

            {
                'name': '超级联盟',
                'value': 815.58
            },

            {
                'name': '动力火车',
                'value': 807.75
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 630.40
            },

            {
                'name': '一起爱',
                'value': 529.07
            },

            {
                'name': '天荒地老',
                'value': 420.93
            } ],
        'date': '2019-05-24-3'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1304.51
            },

            {
                'name': '一起幸福一起飞',
                'value': 1145.14
            },

            {
                'name': '超级联盟',
                'value': 815.58
            },

            {
                'name': '动力火车',
                'value': 807.75
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 630.40
            },

            {
                'name': '一起爱',
                'value': 529.07
            },

            {
                'name': '天荒地老',
                'value': 420.93
            } ],
        'date': '2019-05-24-4'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1304.51
            },

            {
                'name': '一起幸福一起飞',
                'value': 1145.14
            },

            {
                'name': '超级联盟',
                'value': 815.58
            },

            {
                'name': '动力火车',
                'value': 809.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 630.40
            },

            {
                'name': '一起爱',
                'value': 529.07
            },

            {
                'name': '天荒地老',
                'value': 420.93
            } ],
        'date': '2019-05-24-5'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1304.51
            },

            {
                'name': '一起幸福一起飞',
                'value': 1145.14
            },

            {
                'name': '超级联盟',
                'value': 815.58
            },

            {
                'name': '动力火车',
                'value': 810.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 630.40
            },

            {
                'name': '一起爱',
                'value': 529.07
            },

            {
                'name': '天荒地老',
                'value': 420.93
            } ],
        'date': '2019-05-24-6'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1313.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 1151.16
            },

            {
                'name': '动力火车',
                'value': 827.01
            },

            {
                'name': '超级联盟',
                'value': 820.78
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 642.40
            },

            {
                'name': '一起爱',
                'value': 543.85
            },

            {
                'name': '天荒地老',
                'value': 440.14
            } ],
        'date': '2019-05-24-7'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1331.08
            },

            {
                'name': '一起幸福一起飞',
                'value': 1166.22
            },

            {
                'name': '超级联盟',
                'value': 887.53
            },

            {
                'name': '动力火车',
                'value': 834.03
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 673.11
            },

            {
                'name': '一起爱',
                'value': 551.32
            },

            {
                'name': '天荒地老',
                'value': 445.62
            } ],
        'date': '2019-05-24-8'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1349.66
            },

            {
                'name': '一起幸福一起飞',
                'value': 1197.13
            },

            {
                'name': '超级联盟',
                'value': 912.14
            },

            {
                'name': '动力火车',
                'value': 844.38
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 685.40
            },

            {
                'name': '一起爱',
                'value': 571.46
            },

            {
                'name': '天荒地老',
                'value': 447.02
            } ],
        'date': '2019-05-24-9'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1356.84
            },

            {
                'name': '一起幸福一起飞',
                'value': 1205.42
            },

            {
                'name': '超级联盟',
                'value': 912.14
            },

            {
                'name': '动力火车',
                'value': 847.58
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 702.01
            },

            {
                'name': '一起爱',
                'value': 571.46
            },

            {
                'name': '天荒地老',
                'value': 447.02
            } ],
        'date': '2019-05-24-10'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1357.38
            },

            {
                'name': '一起幸福一起飞',
                'value': 1205.42
            },

            {
                'name': '超级联盟',
                'value': 912.14
            },

            {
                'name': '动力火车',
                'value': 847.58
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 702.01
            },

            {
                'name': '一起爱',
                'value': 571.46
            },

            {
                'name': '天荒地老',
                'value': 447.02
            } ],
        'date': '2019-05-24-11'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1359.80
            },

            {
                'name': '一起幸福一起飞',
                'value': 1205.97
            },

            {
                'name': '超级联盟',
                'value': 912.14
            },

            {
                'name': '动力火车',
                'value': 847.58
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 702.01
            },

            {
                'name': '一起爱',
                'value': 573.33
            },

            {
                'name': '天荒地老',
                'value': 447.02
            } ],
        'date': '2019-05-24-12'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1367.68
            },

            {
                'name': '一起幸福一起飞',
                'value': 1205.97
            },

            {
                'name': '超级联盟',
                'value': 920.07
            },

            {
                'name': '动力火车',
                'value': 847.58
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 702.01
            },

            {
                'name': '一起爱',
                'value': 573.33
            },

            {
                'name': '天荒地老',
                'value': 447.02
            } ],
        'date': '2019-05-24-13'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1380.07
            },

            {
                'name': '一起幸福一起飞',
                'value': 1207.68
            },

            {
                'name': '超级联盟',
                'value': 929.14
            },

            {
                'name': '动力火车',
                'value': 852.73
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 720.39
            },

            {
                'name': '一起爱',
                'value': 575.09
            },

            {
                'name': '天荒地老',
                'value': 447.02
            } ],
        'date': '2019-05-24-14'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1380.07
            },

            {
                'name': '一起幸福一起飞',
                'value': 1207.68
            },

            {
                'name': '超级联盟',
                'value': 929.14
            },

            {
                'name': '动力火车',
                'value': 853.28
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 720.51
            },

            {
                'name': '一起爱',
                'value': 575.09
            },

            {
                'name': '天荒地老',
                'value': 450.40
            } ],
        'date': '2019-05-24-15'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1380.07
            },

            {
                'name': '一起幸福一起飞',
                'value': 1207.68
            },

            {
                'name': '超级联盟',
                'value': 930.09
            },

            {
                'name': '动力火车',
                'value': 853.28
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 720.51
            },

            {
                'name': '一起爱',
                'value': 575.09
            },

            {
                'name': '天荒地老',
                'value': 450.40
            } ],
        'date': '2019-05-24-16'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1385.19
            },

            {
                'name': '一起幸福一起飞',
                'value': 1209.35
            },

            {
                'name': '超级联盟',
                'value': 930.09
            },

            {
                'name': '动力火车',
                'value': 856.16
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 720.51
            },

            {
                'name': '一起爱',
                'value': 577.02
            },

            {
                'name': '天荒地老',
                'value': 450.40
            } ],
        'date': '2019-05-24-17'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1385.19
            },

            {
                'name': '一起幸福一起飞',
                'value': 1211.24
            },

            {
                'name': '超级联盟',
                'value': 930.32
            },

            {
                'name': '动力火车',
                'value': 856.44
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 722.63
            },

            {
                'name': '一起爱',
                'value': 579.40
            },

            {
                'name': '天荒地老',
                'value': 450.40
            } ],
        'date': '2019-05-24-18'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1394.01
            },

            {
                'name': '一起幸福一起飞',
                'value': 1211.24
            },

            {
                'name': '超级联盟',
                'value': 930.45
            },

            {
                'name': '动力火车',
                'value': 858.80
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 732.99
            },

            {
                'name': '一起爱',
                'value': 579.40
            },

            {
                'name': '天荒地老',
                'value': 450.40
            } ],
        'date': '2019-05-24-19'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1411.26
            },

            {
                'name': '一起幸福一起飞',
                'value': 1211.60
            },

            {
                'name': '超级联盟',
                'value': 935.82
            },

            {
                'name': '动力火车',
                'value': 858.80
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 734.00
            },

            {
                'name': '一起爱',
                'value': 580.40
            },

            {
                'name': '天荒地老',
                'value': 473.57
            } ],
        'date': '2019-05-24-20'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1419.35
            },

            {
                'name': '一起幸福一起飞',
                'value': 1211.60
            },

            {
                'name': '超级联盟',
                'value': 944.14
            },

            {
                'name': '动力火车',
                'value': 859.34
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 734.00
            },

            {
                'name': '一起爱',
                'value': 583.49
            },

            {
                'name': '天荒地老',
                'value': 476.11
            } ],
        'date': '2019-05-24-21'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1470.65
            },

            {
                'name': '一起幸福一起飞',
                'value': 1233.20
            },

            {
                'name': '超级联盟',
                'value': 948.91
            },

            {
                'name': '动力火车',
                'value': 869.37
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 738.56
            },

            {
                'name': '一起爱',
                'value': 593.53
            },

            {
                'name': '天荒地老',
                'value': 476.11
            } ],
        'date': '2019-05-24-22'
    },

    {
        'category': '2019-05-24',
        'data': [

            {
                'name': '行者无畏',
                'value': 1488.40
            },

            {
                'name': '一起幸福一起飞',
                'value': 1233.20
            },

            {
                'name': '超级联盟',
                'value': 954.48
            },

            {
                'name': '动力火车',
                'value': 870.34
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 738.56
            },

            {
                'name': '一起爱',
                'value': 593.53
            },

            {
                'name': '天荒地老',
                'value': 480.12
            } ],
        'date': '2019-05-24-23'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1496.43
            },

            {
                'name': '一起幸福一起飞',
                'value': 1233.20
            },

            {
                'name': '超级联盟',
                'value': 955.41
            },

            {
                'name': '动力火车',
                'value': 870.34
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 742.64
            },

            {
                'name': '一起爱',
                'value': 595.07
            },

            {
                'name': '天荒地老',
                'value': 483.92
            } ],
        'date': '2019-05-25-0'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1496.59
            },

            {
                'name': '一起幸福一起飞',
                'value': 1237.31
            },

            {
                'name': '超级联盟',
                'value': 955.41
            },

            {
                'name': '动力火车',
                'value': 870.34
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 742.64
            },

            {
                'name': '一起爱',
                'value': 595.07
            },

            {
                'name': '天荒地老',
                'value': 483.92
            } ],
        'date': '2019-05-25-1'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1496.59
            },

            {
                'name': '一起幸福一起飞',
                'value': 1237.31
            },

            {
                'name': '超级联盟',
                'value': 955.41
            },

            {
                'name': '动力火车',
                'value': 870.34
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 742.64
            },

            {
                'name': '一起爱',
                'value': 595.07
            },

            {
                'name': '天荒地老',
                'value': 483.92
            } ],
        'date': '2019-05-25-2'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1496.59
            },

            {
                'name': '一起幸福一起飞',
                'value': 1237.31
            },

            {
                'name': '超级联盟',
                'value': 955.41
            },

            {
                'name': '动力火车',
                'value': 870.34
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 742.64
            },

            {
                'name': '一起爱',
                'value': 595.07
            },

            {
                'name': '天荒地老',
                'value': 483.92
            } ],
        'date': '2019-05-25-3'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1496.59
            },

            {
                'name': '一起幸福一起飞',
                'value': 1237.31
            },

            {
                'name': '超级联盟',
                'value': 955.41
            },

            {
                'name': '动力火车',
                'value': 870.34
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 742.64
            },

            {
                'name': '一起爱',
                'value': 595.07
            },

            {
                'name': '天荒地老',
                'value': 483.92
            } ],
        'date': '2019-05-25-4'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1496.59
            },

            {
                'name': '一起幸福一起飞',
                'value': 1237.31
            },

            {
                'name': '超级联盟',
                'value': 955.41
            },

            {
                'name': '动力火车',
                'value': 870.34
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 742.64
            },

            {
                'name': '一起爱',
                'value': 595.07
            },

            {
                'name': '天荒地老',
                'value': 483.92
            } ],
        'date': '2019-05-25-5'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1496.59
            },

            {
                'name': '一起幸福一起飞',
                'value': 1251.44
            },

            {
                'name': '超级联盟',
                'value': 955.41
            },

            {
                'name': '动力火车',
                'value': 870.34
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 743.59
            },

            {
                'name': '一起爱',
                'value': 595.07
            },

            {
                'name': '天荒地老',
                'value': 483.92
            } ],
        'date': '2019-05-25-6'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1504.87
            },

            {
                'name': '一起幸福一起飞',
                'value': 1273.51
            },

            {
                'name': '超级联盟',
                'value': 966.56
            },

            {
                'name': '动力火车',
                'value': 870.34
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 755.76
            },

            {
                'name': '一起爱',
                'value': 598.93
            },

            {
                'name': '天荒地老',
                'value': 495.92
            } ],
        'date': '2019-05-25-7'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1522.42
            },

            {
                'name': '一起幸福一起飞',
                'value': 1305.83
            },

            {
                'name': '超级联盟',
                'value': 1018.00
            },

            {
                'name': '动力火车',
                'value': 913.76
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 773.76
            },

            {
                'name': '一起爱',
                'value': 606.27
            },

            {
                'name': '天荒地老',
                'value': 495.92
            } ],
        'date': '2019-05-25-8'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1558.84
            },

            {
                'name': '一起幸福一起飞',
                'value': 1329.27
            },

            {
                'name': '超级联盟',
                'value': 1042.87
            },

            {
                'name': '动力火车',
                'value': 921.58
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 773.76
            },

            {
                'name': '一起爱',
                'value': 615.78
            },

            {
                'name': '天荒地老',
                'value': 503.41
            } ],
        'date': '2019-05-25-9'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1567.91
            },

            {
                'name': '一起幸福一起飞',
                'value': 1338.42
            },

            {
                'name': '超级联盟',
                'value': 1063.03
            },

            {
                'name': '动力火车',
                'value': 936.59
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 786.12
            },

            {
                'name': '一起爱',
                'value': 619.89
            },

            {
                'name': '天荒地老',
                'value': 514.52
            } ],
        'date': '2019-05-25-10'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1572.24
            },

            {
                'name': '一起幸福一起飞',
                'value': 1338.79
            },

            {
                'name': '超级联盟',
                'value': 1096.21
            },

            {
                'name': '动力火车',
                'value': 937.84
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 807.36
            },

            {
                'name': '一起爱',
                'value': 631.36
            },

            {
                'name': '天荒地老',
                'value': 517.36
            } ],
        'date': '2019-05-25-11'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1573.11
            },

            {
                'name': '一起幸福一起飞',
                'value': 1344.33
            },

            {
                'name': '超级联盟',
                'value': 1096.21
            },

            {
                'name': '动力火车',
                'value': 938.74
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 807.36
            },

            {
                'name': '一起爱',
                'value': 640.32
            },

            {
                'name': '天荒地老',
                'value': 517.36
            } ],
        'date': '2019-05-25-12'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1585.75
            },

            {
                'name': '一起幸福一起飞',
                'value': 1350.23
            },

            {
                'name': '超级联盟',
                'value': 1106.16
            },

            {
                'name': '动力火车',
                'value': 945.40
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 807.36
            },

            {
                'name': '一起爱',
                'value': 640.32
            },

            {
                'name': '天荒地老',
                'value': 518.28
            } ],
        'date': '2019-05-25-13'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1587.99
            },

            {
                'name': '一起幸福一起飞',
                'value': 1352.60
            },

            {
                'name': '超级联盟',
                'value': 1121.50
            },

            {
                'name': '动力火车',
                'value': 992.55
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 847.36
            },

            {
                'name': '一起爱',
                'value': 640.32
            },

            {
                'name': '天荒地老',
                'value': 518.28
            } ],
        'date': '2019-05-25-14'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1587.99
            },

            {
                'name': '一起幸福一起飞',
                'value': 1352.60
            },

            {
                'name': '超级联盟',
                'value': 1122.16
            },

            {
                'name': '动力火车',
                'value': 999.36
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 847.36
            },

            {
                'name': '一起爱',
                'value': 640.32
            },

            {
                'name': '天荒地老',
                'value': 518.41
            } ],
        'date': '2019-05-25-15'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1589.02
            },

            {
                'name': '一起幸福一起飞',
                'value': 1363.10
            },

            {
                'name': '超级联盟',
                'value': 1122.16
            },

            {
                'name': '动力火车',
                'value': 999.36
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 847.36
            },

            {
                'name': '一起爱',
                'value': 643.45
            },

            {
                'name': '天荒地老',
                'value': 518.41
            } ],
        'date': '2019-05-25-16'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1591.22
            },

            {
                'name': '一起幸福一起飞',
                'value': 1363.10
            },

            {
                'name': '超级联盟',
                'value': 1126.33
            },

            {
                'name': '动力火车',
                'value': 1010.34
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 847.36
            },

            {
                'name': '一起爱',
                'value': 643.54
            },

            {
                'name': '天荒地老',
                'value': 520.85
            } ],
        'date': '2019-05-25-17'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1595.25
            },

            {
                'name': '一起幸福一起飞',
                'value': 1364.09
            },

            {
                'name': '超级联盟',
                'value': 1126.85
            },

            {
                'name': '动力火车',
                'value': 1016.69
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 847.36
            },

            {
                'name': '一起爱',
                'value': 644.88
            },

            {
                'name': '天荒地老',
                'value': 521.44
            } ],
        'date': '2019-05-25-18'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1603.33
            },

            {
                'name': '一起幸福一起飞',
                'value': 1375.35
            },

            {
                'name': '超级联盟',
                'value': 1139.74
            },

            {
                'name': '动力火车',
                'value': 1023.29
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 849.87
            },

            {
                'name': '一起爱',
                'value': 646.27
            },

            {
                'name': '天荒地老',
                'value': 521.44
            } ],
        'date': '2019-05-25-19'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1603.56
            },

            {
                'name': '一起幸福一起飞',
                'value': 1382.52
            },

            {
                'name': '超级联盟',
                'value': 1161.96
            },

            {
                'name': '动力火车',
                'value': 1029.87
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 850.88
            },

            {
                'name': '一起爱',
                'value': 660.32
            },

            {
                'name': '天荒地老',
                'value': 521.44
            } ],
        'date': '2019-05-25-20'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1619.20
            },

            {
                'name': '一起幸福一起飞',
                'value': 1382.83
            },

            {
                'name': '超级联盟',
                'value': 1161.96
            },

            {
                'name': '动力火车',
                'value': 1047.75
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 860.91
            },

            {
                'name': '一起爱',
                'value': 676.96
            },

            {
                'name': '天荒地老',
                'value': 521.44
            } ],
        'date': '2019-05-25-21'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1634.72
            },

            {
                'name': '一起幸福一起飞',
                'value': 1410.02
            },

            {
                'name': '超级联盟',
                'value': 1161.96
            },

            {
                'name': '动力火车',
                'value': 1060.75
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 870.07
            },

            {
                'name': '一起爱',
                'value': 676.96
            },

            {
                'name': '天荒地老',
                'value': 521.44
            } ],
        'date': '2019-05-25-22'
    },

    {
        'category': '2019-05-25',
        'data': [

            {
                'name': '行者无畏',
                'value': 1655.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 1410.85
            },

            {
                'name': '超级联盟',
                'value': 1167.15
            },

            {
                'name': '动力火车',
                'value': 1060.75
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 870.07
            },

            {
                'name': '一起爱',
                'value': 676.96
            },

            {
                'name': '天荒地老',
                'value': 523.56
            } ],
        'date': '2019-05-25-23'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1655.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 1416.76
            },

            {
                'name': '超级联盟',
                'value': 1167.15
            },

            {
                'name': '动力火车',
                'value': 1060.75
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 876.08
            },

            {
                'name': '一起爱',
                'value': 676.96
            },

            {
                'name': '天荒地老',
                'value': 523.56
            } ],
        'date': '2019-05-26-0'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1655.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 1416.76
            },

            {
                'name': '超级联盟',
                'value': 1167.15
            },

            {
                'name': '动力火车',
                'value': 1060.75
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 882.62
            },

            {
                'name': '一起爱',
                'value': 676.96
            },

            {
                'name': '天荒地老',
                'value': 523.56
            } ],
        'date': '2019-05-26-1'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1656.53
            },

            {
                'name': '一起幸福一起飞',
                'value': 1416.76
            },

            {
                'name': '超级联盟',
                'value': 1167.15
            },

            {
                'name': '动力火车',
                'value': 1060.75
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 882.62
            },

            {
                'name': '一起爱',
                'value': 676.96
            },

            {
                'name': '天荒地老',
                'value': 523.56
            } ],
        'date': '2019-05-26-2'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1656.53
            },

            {
                'name': '一起幸福一起飞',
                'value': 1416.76
            },

            {
                'name': '超级联盟',
                'value': 1167.15
            },

            {
                'name': '动力火车',
                'value': 1062.57
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 882.62
            },

            {
                'name': '一起爱',
                'value': 676.96
            },

            {
                'name': '天荒地老',
                'value': 523.56
            } ],
        'date': '2019-05-26-3'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1656.53
            },

            {
                'name': '一起幸福一起飞',
                'value': 1416.76
            },

            {
                'name': '超级联盟',
                'value': 1167.15
            },

            {
                'name': '动力火车',
                'value': 1064.33
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 882.62
            },

            {
                'name': '一起爱',
                'value': 676.96
            },

            {
                'name': '天荒地老',
                'value': 523.56
            } ],
        'date': '2019-05-26-4'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1656.53
            },

            {
                'name': '一起幸福一起飞',
                'value': 1416.76
            },

            {
                'name': '超级联盟',
                'value': 1167.15
            },

            {
                'name': '动力火车',
                'value': 1064.33
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 882.62
            },

            {
                'name': '一起爱',
                'value': 676.96
            },

            {
                'name': '天荒地老',
                'value': 523.56
            } ],
        'date': '2019-05-26-5'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1658.51
            },

            {
                'name': '一起幸福一起飞',
                'value': 1416.76
            },

            {
                'name': '超级联盟',
                'value': 1167.15
            },

            {
                'name': '动力火车',
                'value': 1064.33
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 882.62
            },

            {
                'name': '一起爱',
                'value': 676.96
            },

            {
                'name': '天荒地老',
                'value': 523.56
            } ],
        'date': '2019-05-26-6'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1660.12
            },

            {
                'name': '一起幸福一起飞',
                'value': 1436.88
            },

            {
                'name': '超级联盟',
                'value': 1172.36
            },

            {
                'name': '动力火车',
                'value': 1064.33
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 902.62
            },

            {
                'name': '一起爱',
                'value': 685.24
            },

            {
                'name': '天荒地老',
                'value': 523.56
            } ],
        'date': '2019-05-26-7'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1675.93
            },

            {
                'name': '一起幸福一起飞',
                'value': 1448.88
            },

            {
                'name': '超级联盟',
                'value': 1184.17
            },

            {
                'name': '动力火车',
                'value': 1083.91
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 914.19
            },

            {
                'name': '一起爱',
                'value': 685.24
            },

            {
                'name': '天荒地老',
                'value': 531.26
            } ],
        'date': '2019-05-26-8'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1729.92
            },

            {
                'name': '一起幸福一起飞',
                'value': 1469.66
            },

            {
                'name': '超级联盟',
                'value': 1211.64
            },

            {
                'name': '动力火车',
                'value': 1098.74
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 922.99
            },

            {
                'name': '一起爱',
                'value': 687.36
            },

            {
                'name': '天荒地老',
                'value': 538.29
            } ],
        'date': '2019-05-26-9'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1822.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 1477.43
            },

            {
                'name': '超级联盟',
                'value': 1211.64
            },

            {
                'name': '动力火车',
                'value': 1141.75
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 942.99
            },

            {
                'name': '一起爱',
                'value': 752.12
            },

            {
                'name': '天荒地老',
                'value': 538.29
            } ],
        'date': '2019-05-26-10'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1944.50
            },

            {
                'name': '一起幸福一起飞',
                'value': 1497.43
            },

            {
                'name': '动力火车',
                'value': 1225.27
            },

            {
                'name': '超级联盟',
                'value': 1220.40
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 962.99
            },

            {
                'name': '一起爱',
                'value': 884.12
            },

            {
                'name': '天荒地老',
                'value': 538.29
            } ],
        'date': '2019-05-26-11'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1946.24
            },

            {
                'name': '一起幸福一起飞',
                'value': 1540.73
            },

            {
                'name': '超级联盟',
                'value': 1236.72
            },

            {
                'name': '动力火车',
                'value': 1232.63
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1042.99
            },

            {
                'name': '一起爱',
                'value': 885.79
            },

            {
                'name': '天荒地老',
                'value': 538.29
            } ],
        'date': '2019-05-26-12'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1949.61
            },

            {
                'name': '一起幸福一起飞',
                'value': 1541.54
            },

            {
                'name': '超级联盟',
                'value': 1281.53
            },

            {
                'name': '动力火车',
                'value': 1235.01
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1082.99
            },

            {
                'name': '一起爱',
                'value': 885.79
            },

            {
                'name': '天荒地老',
                'value': 579.84
            } ],
        'date': '2019-05-26-13'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1950.86
            },

            {
                'name': '一起幸福一起飞',
                'value': 1583.51
            },

            {
                'name': '超级联盟',
                'value': 1296.14
            },

            {
                'name': '动力火车',
                'value': 1235.01
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1102.99
            },

            {
                'name': '一起爱',
                'value': 885.79
            },

            {
                'name': '天荒地老',
                'value': 584.93
            } ],
        'date': '2019-05-26-14'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1957.74
            },

            {
                'name': '一起幸福一起飞',
                'value': 1585.51
            },

            {
                'name': '超级联盟',
                'value': 1296.14
            },

            {
                'name': '动力火车',
                'value': 1276.78
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1102.99
            },

            {
                'name': '一起爱',
                'value': 907.51
            },

            {
                'name': '天荒地老',
                'value': 584.93
            } ],
        'date': '2019-05-26-15'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1966.51
            },

            {
                'name': '一起幸福一起飞',
                'value': 1588.58
            },

            {
                'name': '超级联盟',
                'value': 1296.89
            },

            {
                'name': '动力火车',
                'value': 1276.78
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1102.99
            },

            {
                'name': '一起爱',
                'value': 911.31
            },

            {
                'name': '天荒地老',
                'value': 584.93
            } ],
        'date': '2019-05-26-16'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1966.51
            },

            {
                'name': '一起幸福一起飞',
                'value': 1602.33
            },

            {
                'name': '超级联盟',
                'value': 1311.11
            },

            {
                'name': '动力火车',
                'value': 1278.18
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1103.08
            },

            {
                'name': '一起爱',
                'value': 911.31
            },

            {
                'name': '天荒地老',
                'value': 584.93
            } ],
        'date': '2019-05-26-17'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1982.64
            },

            {
                'name': '一起幸福一起飞',
                'value': 1613.26
            },

            {
                'name': '超级联盟',
                'value': 1337.75
            },

            {
                'name': '动力火车',
                'value': 1289.99
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1106.58
            },

            {
                'name': '一起爱',
                'value': 911.31
            },

            {
                'name': '天荒地老',
                'value': 584.93
            } ],
        'date': '2019-05-26-18'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1989.42
            },

            {
                'name': '一起幸福一起飞',
                'value': 1628.84
            },

            {
                'name': '超级联盟',
                'value': 1338.16
            },

            {
                'name': '动力火车',
                'value': 1316.61
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1125.61
            },

            {
                'name': '一起爱',
                'value': 911.31
            },

            {
                'name': '天荒地老',
                'value': 584.93
            } ],
        'date': '2019-05-26-19'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 1996.37
            },

            {
                'name': '一起幸福一起飞',
                'value': 1628.84
            },

            {
                'name': '超级联盟',
                'value': 1357.00
            },

            {
                'name': '动力火车',
                'value': 1319.16
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1126.61
            },

            {
                'name': '一起爱',
                'value': 916.36
            },

            {
                'name': '天荒地老',
                'value': 584.93
            } ],
        'date': '2019-05-26-20'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 2001.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 1638.84
            },

            {
                'name': '超级联盟',
                'value': 1362.05
            },

            {
                'name': '动力火车',
                'value': 1352.37
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1126.61
            },

            {
                'name': '一起爱',
                'value': 920.52
            },

            {
                'name': '天荒地老',
                'value': 584.93
            } ],
        'date': '2019-05-26-21'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 2016.18
            },

            {
                'name': '一起幸福一起飞',
                'value': 1660.35
            },

            {
                'name': '超级联盟',
                'value': 1364.98
            },

            {
                'name': '动力火车',
                'value': 1353.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1134.08
            },

            {
                'name': '一起爱',
                'value': 932.52
            },

            {
                'name': '天荒地老',
                'value': 621.46
            } ],
        'date': '2019-05-26-22'
    },

    {
        'category': '2019-05-26',
        'data': [

            {
                'name': '行者无畏',
                'value': 2023.70
            },

            {
                'name': '一起幸福一起飞',
                'value': 1664.50
            },

            {
                'name': '超级联盟',
                'value': 1370.18
            },

            {
                'name': '动力火车',
                'value': 1353.93
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1135.33
            },

            {
                'name': '一起爱',
                'value': 939.12
            },

            {
                'name': '天荒地老',
                'value': 626.47
            } ],
        'date': '2019-05-26-23'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2023.70
            },

            {
                'name': '一起幸福一起飞',
                'value': 1675.42
            },

            {
                'name': '超级联盟',
                'value': 1370.18
            },

            {
                'name': '动力火车',
                'value': 1353.93
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1137.62
            },

            {
                'name': '一起爱',
                'value': 939.12
            },

            {
                'name': '天荒地老',
                'value': 626.47
            } ],
        'date': '2019-05-27-0'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2023.70
            },

            {
                'name': '一起幸福一起飞',
                'value': 1675.42
            },

            {
                'name': '超级联盟',
                'value': 1370.18
            },

            {
                'name': '动力火车',
                'value': 1353.93
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1137.62
            },

            {
                'name': '一起爱',
                'value': 939.12
            },

            {
                'name': '天荒地老',
                'value': 626.47
            } ],
        'date': '2019-05-27-1'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2023.70
            },

            {
                'name': '一起幸福一起飞',
                'value': 1675.42
            },

            {
                'name': '超级联盟',
                'value': 1370.18
            },

            {
                'name': '动力火车',
                'value': 1353.93
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1137.62
            },

            {
                'name': '一起爱',
                'value': 939.12
            },

            {
                'name': '天荒地老',
                'value': 626.47
            } ],
        'date': '2019-05-27-2'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2023.70
            },

            {
                'name': '一起幸福一起飞',
                'value': 1675.42
            },

            {
                'name': '超级联盟',
                'value': 1370.18
            },

            {
                'name': '动力火车',
                'value': 1353.93
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1137.62
            },

            {
                'name': '一起爱',
                'value': 939.12
            },

            {
                'name': '天荒地老',
                'value': 626.47
            } ],
        'date': '2019-05-27-3'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2023.70
            },

            {
                'name': '一起幸福一起飞',
                'value': 1675.42
            },

            {
                'name': '超级联盟',
                'value': 1370.18
            },

            {
                'name': '动力火车',
                'value': 1353.93
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1137.62
            },

            {
                'name': '一起爱',
                'value': 939.12
            },

            {
                'name': '天荒地老',
                'value': 626.47
            } ],
        'date': '2019-05-27-4'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2023.70
            },

            {
                'name': '一起幸福一起飞',
                'value': 1675.42
            },

            {
                'name': '超级联盟',
                'value': 1370.18
            },

            {
                'name': '动力火车',
                'value': 1353.93
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1137.62
            },

            {
                'name': '一起爱',
                'value': 939.12
            },

            {
                'name': '天荒地老',
                'value': 626.47
            } ],
        'date': '2019-05-27-5'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2023.70
            },

            {
                'name': '一起幸福一起飞',
                'value': 1675.42
            },

            {
                'name': '超级联盟',
                'value': 1371.26
            },

            {
                'name': '动力火车',
                'value': 1353.93
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1137.62
            },

            {
                'name': '一起爱',
                'value': 939.12
            },

            {
                'name': '天荒地老',
                'value': 626.47
            } ],
        'date': '2019-05-27-6'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2031.54
            },

            {
                'name': '一起幸福一起飞',
                'value': 1686.98
            },

            {
                'name': '超级联盟',
                'value': 1377.53
            },

            {
                'name': '动力火车',
                'value': 1367.26
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1145.15
            },

            {
                'name': '一起爱',
                'value': 950.08
            },

            {
                'name': '天荒地老',
                'value': 626.73
            } ],
        'date': '2019-05-27-7'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2046.67
            },

            {
                'name': '一起幸福一起飞',
                'value': 1731.90
            },

            {
                'name': '超级联盟',
                'value': 1405.83
            },

            {
                'name': '动力火车',
                'value': 1373.91
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1165.24
            },

            {
                'name': '一起爱',
                'value': 953.42
            },

            {
                'name': '天荒地老',
                'value': 627.01
            } ],
        'date': '2019-05-27-8'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2068.93
            },

            {
                'name': '一起幸福一起飞',
                'value': 1742.98
            },

            {
                'name': '超级联盟',
                'value': 1426.72
            },

            {
                'name': '动力火车',
                'value': 1406.38
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1169.62
            },

            {
                'name': '一起爱',
                'value': 968.59
            },

            {
                'name': '天荒地老',
                'value': 629.43
            } ],
        'date': '2019-05-27-9'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2071.06
            },

            {
                'name': '一起幸福一起飞',
                'value': 1748.48
            },

            {
                'name': '超级联盟',
                'value': 1426.72
            },

            {
                'name': '动力火车',
                'value': 1419.66
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1170.22
            },

            {
                'name': '一起爱',
                'value': 970.60
            },

            {
                'name': '天荒地老',
                'value': 641.14
            } ],
        'date': '2019-05-27-10'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2071.06
            },

            {
                'name': '一起幸福一起飞',
                'value': 1763.50
            },

            {
                'name': '超级联盟',
                'value': 1438.52
            },

            {
                'name': '动力火车',
                'value': 1421.66
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1173.30
            },

            {
                'name': '一起爱',
                'value': 970.60
            },

            {
                'name': '天荒地老',
                'value': 641.14
            } ],
        'date': '2019-05-27-11'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2075.78
            },

            {
                'name': '一起幸福一起飞',
                'value': 1763.50
            },

            {
                'name': '超级联盟',
                'value': 1438.52
            },

            {
                'name': '动力火车',
                'value': 1434.69
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1190.50
            },

            {
                'name': '一起爱',
                'value': 970.60
            },

            {
                'name': '天荒地老',
                'value': 641.14
            } ],
        'date': '2019-05-27-12'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2079.76
            },

            {
                'name': '一起幸福一起飞',
                'value': 1763.50
            },

            {
                'name': '超级联盟',
                'value': 1438.52
            },

            {
                'name': '动力火车',
                'value': 1435.59
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1190.50
            },

            {
                'name': '一起爱',
                'value': 974.23
            },

            {
                'name': '天荒地老',
                'value': 641.14
            } ],
        'date': '2019-05-27-13'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2104.18
            },

            {
                'name': '一起幸福一起飞',
                'value': 1764.19
            },

            {
                'name': '超级联盟',
                'value': 1438.52
            },

            {
                'name': '动力火车',
                'value': 1435.59
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1199.68
            },

            {
                'name': '一起爱',
                'value': 974.23
            },

            {
                'name': '天荒地老',
                'value': 641.14
            } ],
        'date': '2019-05-27-14'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2105.86
            },

            {
                'name': '一起幸福一起飞',
                'value': 1764.19
            },

            {
                'name': '超级联盟',
                'value': 1439.73
            },

            {
                'name': '动力火车',
                'value': 1435.59
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1199.68
            },

            {
                'name': '一起爱',
                'value': 975.35
            },

            {
                'name': '天荒地老',
                'value': 641.38
            } ],
        'date': '2019-05-27-15'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2107.68
            },

            {
                'name': '一起幸福一起飞',
                'value': 1764.19
            },

            {
                'name': '超级联盟',
                'value': 1439.73
            },

            {
                'name': '动力火车',
                'value': 1435.59
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1199.68
            },

            {
                'name': '一起爱',
                'value': 979.18
            },

            {
                'name': '天荒地老',
                'value': 641.38
            } ],
        'date': '2019-05-27-16'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2107.68
            },

            {
                'name': '一起幸福一起飞',
                'value': 1773.25
            },

            {
                'name': '超级联盟',
                'value': 1439.73
            },

            {
                'name': '动力火车',
                'value': 1435.59
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1199.68
            },

            {
                'name': '一起爱',
                'value': 979.18
            },

            {
                'name': '天荒地老',
                'value': 641.38
            } ],
        'date': '2019-05-27-17'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2107.80
            },

            {
                'name': '一起幸福一起飞',
                'value': 1773.25
            },

            {
                'name': '超级联盟',
                'value': 1451.73
            },

            {
                'name': '动力火车',
                'value': 1443.46
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1209.87
            },

            {
                'name': '一起爱',
                'value': 983.68
            },

            {
                'name': '天荒地老',
                'value': 641.38
            } ],
        'date': '2019-05-27-18'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2110.72
            },

            {
                'name': '一起幸福一起飞',
                'value': 1776.09
            },

            {
                'name': '超级联盟',
                'value': 1452.48
            },

            {
                'name': '动力火车',
                'value': 1446.80
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1209.87
            },

            {
                'name': '一起爱',
                'value': 984.01
            },

            {
                'name': '天荒地老',
                'value': 647.69
            } ],
        'date': '2019-05-27-19'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2117.76
            },

            {
                'name': '一起幸福一起飞',
                'value': 1776.51
            },

            {
                'name': '动力火车',
                'value': 1458.28
            },

            {
                'name': '超级联盟',
                'value': 1452.48
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1209.87
            },

            {
                'name': '一起爱',
                'value': 988.05
            },

            {
                'name': '天荒地老',
                'value': 647.84
            } ],
        'date': '2019-05-27-20'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2151.79
            },

            {
                'name': '一起幸福一起飞',
                'value': 1779.63
            },

            {
                'name': '动力火车',
                'value': 1481.32
            },

            {
                'name': '超级联盟',
                'value': 1457.66
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1211.75
            },

            {
                'name': '一起爱',
                'value': 996.12
            },

            {
                'name': '天荒地老',
                'value': 647.84
            } ],
        'date': '2019-05-27-21'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2197.53
            },

            {
                'name': '一起幸福一起飞',
                'value': 1798.59
            },

            {
                'name': '动力火车',
                'value': 1493.86
            },

            {
                'name': '超级联盟',
                'value': 1471.49
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1212.05
            },

            {
                'name': '一起爱',
                'value': 1011.31
            },

            {
                'name': '天荒地老',
                'value': 647.84
            } ],
        'date': '2019-05-27-22'
    },

    {
        'category': '2019-05-27',
        'data': [

            {
                'name': '行者无畏',
                'value': 2219.87
            },

            {
                'name': '一起幸福一起飞',
                'value': 1798.79
            },

            {
                'name': '动力火车',
                'value': 1499.99
            },

            {
                'name': '超级联盟',
                'value': 1482.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1212.05
            },

            {
                'name': '一起爱',
                'value': 1023.99
            },

            {
                'name': '天荒地老',
                'value': 650.71
            } ],
        'date': '2019-05-27-23'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2226.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 1809.17
            },

            {
                'name': '动力火车',
                'value': 1499.99
            },

            {
                'name': '超级联盟',
                'value': 1482.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1222.13
            },

            {
                'name': '一起爱',
                'value': 1023.99
            },

            {
                'name': '天荒地老',
                'value': 650.71
            } ],
        'date': '2019-05-28-0'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2226.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 1809.17
            },

            {
                'name': '动力火车',
                'value': 1499.99
            },

            {
                'name': '超级联盟',
                'value': 1482.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1222.13
            },

            {
                'name': '一起爱',
                'value': 1023.99
            },

            {
                'name': '天荒地老',
                'value': 650.71
            } ],
        'date': '2019-05-28-1'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2226.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 1809.17
            },

            {
                'name': '动力火车',
                'value': 1499.99
            },

            {
                'name': '超级联盟',
                'value': 1482.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1222.13
            },

            {
                'name': '一起爱',
                'value': 1023.99
            },

            {
                'name': '天荒地老',
                'value': 650.71
            } ],
        'date': '2019-05-28-2'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2226.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 1809.17
            },

            {
                'name': '动力火车',
                'value': 1511.99
            },

            {
                'name': '超级联盟',
                'value': 1482.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1222.13
            },

            {
                'name': '一起爱',
                'value': 1023.99
            },

            {
                'name': '天荒地老',
                'value': 650.71
            } ],
        'date': '2019-05-28-3'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2226.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 1809.17
            },

            {
                'name': '动力火车',
                'value': 1511.99
            },

            {
                'name': '超级联盟',
                'value': 1482.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1222.13
            },

            {
                'name': '一起爱',
                'value': 1023.99
            },

            {
                'name': '天荒地老',
                'value': 650.71
            } ],
        'date': '2019-05-28-4'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2226.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 1809.17
            },

            {
                'name': '动力火车',
                'value': 1511.99
            },

            {
                'name': '超级联盟',
                'value': 1482.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1222.13
            },

            {
                'name': '一起爱',
                'value': 1023.99
            },

            {
                'name': '天荒地老',
                'value': 650.71
            } ],
        'date': '2019-05-28-5'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2226.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 1809.17
            },

            {
                'name': '动力火车',
                'value': 1511.99
            },

            {
                'name': '超级联盟',
                'value': 1482.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1222.13
            },

            {
                'name': '一起爱',
                'value': 1024.20
            },

            {
                'name': '天荒地老',
                'value': 650.71
            } ],
        'date': '2019-05-28-6'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2246.09
            },

            {
                'name': '一起幸福一起飞',
                'value': 1842.25
            },

            {
                'name': '动力火车',
                'value': 1519.03
            },

            {
                'name': '超级联盟',
                'value': 1495.50
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1248.53
            },

            {
                'name': '一起爱',
                'value': 1048.23
            },

            {
                'name': '天荒地老',
                'value': 650.71
            } ],
        'date': '2019-05-28-7'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2286.70
            },

            {
                'name': '一起幸福一起飞',
                'value': 1873.49
            },

            {
                'name': '动力火车',
                'value': 1544.64
            },

            {
                'name': '超级联盟',
                'value': 1535.76
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1259.95
            },

            {
                'name': '一起爱',
                'value': 1059.41
            },

            {
                'name': '天荒地老',
                'value': 662.71
            } ],
        'date': '2019-05-28-8'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2327.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 1875.07
            },

            {
                'name': '动力火车',
                'value': 1579.10
            },

            {
                'name': '超级联盟',
                'value': 1573.11
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1263.07
            },

            {
                'name': '一起爱',
                'value': 1077.25
            },

            {
                'name': '天荒地老',
                'value': 663.45
            } ],
        'date': '2019-05-28-9'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2327.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 1882.78
            },

            {
                'name': '动力火车',
                'value': 1589.23
            },

            {
                'name': '超级联盟',
                'value': 1573.11
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1273.71
            },

            {
                'name': '一起爱',
                'value': 1077.25
            },

            {
                'name': '天荒地老',
                'value': 666.66
            } ],
        'date': '2019-05-28-10'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2332.56
            },

            {
                'name': '一起幸福一起飞',
                'value': 1882.78
            },

            {
                'name': '动力火车',
                'value': 1609.23
            },

            {
                'name': '超级联盟',
                'value': 1575.46
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1279.08
            },

            {
                'name': '一起爱',
                'value': 1077.25
            },

            {
                'name': '天荒地老',
                'value': 666.89
            } ],
        'date': '2019-05-28-11'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2340.69
            },

            {
                'name': '一起幸福一起飞',
                'value': 1883.78
            },

            {
                'name': '动力火车',
                'value': 1614.57
            },

            {
                'name': '超级联盟',
                'value': 1575.46
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1279.08
            },

            {
                'name': '一起爱',
                'value': 1077.25
            },

            {
                'name': '天荒地老',
                'value': 678.89
            } ],
        'date': '2019-05-28-12'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2344.10
            },

            {
                'name': '一起幸福一起飞',
                'value': 1889.98
            },

            {
                'name': '动力火车',
                'value': 1616.91
            },

            {
                'name': '超级联盟',
                'value': 1575.46
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1289.60
            },

            {
                'name': '一起爱',
                'value': 1078.84
            },

            {
                'name': '天荒地老',
                'value': 678.89
            } ],
        'date': '2019-05-28-13'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2352.70
            },

            {
                'name': '一起幸福一起飞',
                'value': 1899.81
            },

            {
                'name': '动力火车',
                'value': 1618.80
            },

            {
                'name': '超级联盟',
                'value': 1579.29
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1298.18
            },

            {
                'name': '一起爱',
                'value': 1078.84
            },

            {
                'name': '天荒地老',
                'value': 678.89
            } ],
        'date': '2019-05-28-14'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2352.70
            },

            {
                'name': '一起幸福一起飞',
                'value': 1903.94
            },

            {
                'name': '动力火车',
                'value': 1619.08
            },

            {
                'name': '超级联盟',
                'value': 1579.29
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1298.33
            },

            {
                'name': '一起爱',
                'value': 1079.80
            },

            {
                'name': '天荒地老',
                'value': 678.89
            } ],
        'date': '2019-05-28-15'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2354.06
            },

            {
                'name': '一起幸福一起飞',
                'value': 1903.94
            },

            {
                'name': '动力火车',
                'value': 1619.78
            },

            {
                'name': '超级联盟',
                'value': 1579.29
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1298.33
            },

            {
                'name': '一起爱',
                'value': 1080.35
            },

            {
                'name': '天荒地老',
                'value': 678.89
            } ],
        'date': '2019-05-28-16'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2357.10
            },

            {
                'name': '一起幸福一起飞',
                'value': 1904.51
            },

            {
                'name': '动力火车',
                'value': 1619.78
            },

            {
                'name': '超级联盟',
                'value': 1599.83
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1298.43
            },

            {
                'name': '一起爱',
                'value': 1081.71
            },

            {
                'name': '天荒地老',
                'value': 678.89
            } ],
        'date': '2019-05-28-17'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2368.37
            },

            {
                'name': '一起幸福一起飞',
                'value': 1904.51
            },

            {
                'name': '动力火车',
                'value': 1628.73
            },

            {
                'name': '超级联盟',
                'value': 1599.83
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1309.03
            },

            {
                'name': '一起爱',
                'value': 1083.75
            },

            {
                'name': '天荒地老',
                'value': 678.89
            } ],
        'date': '2019-05-28-18'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2379.42
            },

            {
                'name': '一起幸福一起飞',
                'value': 1909.07
            },

            {
                'name': '动力火车',
                'value': 1639.52
            },

            {
                'name': '超级联盟',
                'value': 1600.33
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1310.03
            },

            {
                'name': '一起爱',
                'value': 1083.75
            },

            {
                'name': '天荒地老',
                'value': 678.89
            } ],
        'date': '2019-05-28-19'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2400.32
            },

            {
                'name': '一起幸福一起飞',
                'value': 1933.53
            },

            {
                'name': '动力火车',
                'value': 1646.78
            },

            {
                'name': '超级联盟',
                'value': 1608.41
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1310.73
            },

            {
                'name': '一起爱',
                'value': 1092.47
            },

            {
                'name': '天荒地老',
                'value': 700.23
            } ],
        'date': '2019-05-28-20'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2418.56
            },

            {
                'name': '一起幸福一起飞',
                'value': 1934.70
            },

            {
                'name': '动力火车',
                'value': 1652.04
            },

            {
                'name': '超级联盟',
                'value': 1626.28
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1320.77
            },

            {
                'name': '一起爱',
                'value': 1096.07
            },

            {
                'name': '天荒地老',
                'value': 712.23
            } ],
        'date': '2019-05-28-21'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2437.17
            },

            {
                'name': '一起幸福一起飞',
                'value': 1934.70
            },

            {
                'name': '动力火车',
                'value': 1657.43
            },

            {
                'name': '超级联盟',
                'value': 1631.35
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1321.68
            },

            {
                'name': '一起爱',
                'value': 1107.54
            },

            {
                'name': '天荒地老',
                'value': 720.44
            } ],
        'date': '2019-05-28-22'
    },

    {
        'category': '2019-05-28',
        'data': [

            {
                'name': '行者无畏',
                'value': 2455.54
            },

            {
                'name': '一起幸福一起飞',
                'value': 1945.39
            },

            {
                'name': '动力火车',
                'value': 1657.43
            },

            {
                'name': '超级联盟',
                'value': 1647.93
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1321.68
            },

            {
                'name': '一起爱',
                'value': 1115.51
            },

            {
                'name': '天荒地老',
                'value': 720.44
            } ],
        'date': '2019-05-28-23'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2455.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 1957.39
            },

            {
                'name': '动力火车',
                'value': 1657.43
            },

            {
                'name': '超级联盟',
                'value': 1652.94
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1327.15
            },

            {
                'name': '一起爱',
                'value': 1115.51
            },

            {
                'name': '天荒地老',
                'value': 720.44
            } ],
        'date': '2019-05-29-0'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2455.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 1957.39
            },

            {
                'name': '动力火车',
                'value': 1657.43
            },

            {
                'name': '超级联盟',
                'value': 1652.94
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1327.15
            },

            {
                'name': '一起爱',
                'value': 1115.51
            },

            {
                'name': '天荒地老',
                'value': 720.44
            } ],
        'date': '2019-05-29-1'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2455.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 1957.39
            },

            {
                'name': '动力火车',
                'value': 1660.64
            },

            {
                'name': '超级联盟',
                'value': 1652.94
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1327.15
            },

            {
                'name': '一起爱',
                'value': 1115.51
            },

            {
                'name': '天荒地老',
                'value': 720.44
            } ],
        'date': '2019-05-29-2'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2455.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 1957.39
            },

            {
                'name': '动力火车',
                'value': 1660.64
            },

            {
                'name': '超级联盟',
                'value': 1655.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1327.15
            },

            {
                'name': '一起爱',
                'value': 1115.51
            },

            {
                'name': '天荒地老',
                'value': 720.44
            } ],
        'date': '2019-05-29-3'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2455.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 1957.39
            },

            {
                'name': '动力火车',
                'value': 1660.64
            },

            {
                'name': '超级联盟',
                'value': 1655.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1327.15
            },

            {
                'name': '一起爱',
                'value': 1115.51
            },

            {
                'name': '天荒地老',
                'value': 720.44
            } ],
        'date': '2019-05-29-4'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2455.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 1957.39
            },

            {
                'name': '动力火车',
                'value': 1660.64
            },

            {
                'name': '超级联盟',
                'value': 1655.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1327.15
            },

            {
                'name': '一起爱',
                'value': 1117.69
            },

            {
                'name': '天荒地老',
                'value': 720.44
            } ],
        'date': '2019-05-29-5'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2455.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 1957.39
            },

            {
                'name': '动力火车',
                'value': 1660.64
            },

            {
                'name': '超级联盟',
                'value': 1655.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1331.69
            },

            {
                'name': '一起爱',
                'value': 1118.79
            },

            {
                'name': '天荒地老',
                'value': 720.44
            } ],
        'date': '2019-05-29-6'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2471.24
            },

            {
                'name': '一起幸福一起飞',
                'value': 1957.39
            },

            {
                'name': '超级联盟',
                'value': 1679.08
            },

            {
                'name': '动力火车',
                'value': 1665.89
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1337.28
            },

            {
                'name': '一起爱',
                'value': 1136.39
            },

            {
                'name': '天荒地老',
                'value': 720.44
            } ],
        'date': '2019-05-29-7'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2496.99
            },

            {
                'name': '一起幸福一起飞',
                'value': 1981.14
            },

            {
                'name': '动力火车',
                'value': 1708.65
            },

            {
                'name': '超级联盟',
                'value': 1696.03
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1352.33
            },

            {
                'name': '一起爱',
                'value': 1150.42
            },

            {
                'name': '天荒地老',
                'value': 735.47
            } ],
        'date': '2019-05-29-8'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2554.26
            },

            {
                'name': '一起幸福一起飞',
                'value': 1997.61
            },

            {
                'name': '动力火车',
                'value': 1720.73
            },

            {
                'name': '超级联盟',
                'value': 1718.16
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1360.08
            },

            {
                'name': '一起爱',
                'value': 1158.50
            },

            {
                'name': '天荒地老',
                'value': 743.22
            } ],
        'date': '2019-05-29-9'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2567.01
            },

            {
                'name': '一起幸福一起飞',
                'value': 1999.35
            },

            {
                'name': '动力火车',
                'value': 1727.88
            },

            {
                'name': '超级联盟',
                'value': 1720.38
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1370.20
            },

            {
                'name': '一起爱',
                'value': 1158.50
            },

            {
                'name': '天荒地老',
                'value': 743.22
            } ],
        'date': '2019-05-29-10'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2568.28
            },

            {
                'name': '一起幸福一起飞',
                'value': 2005.79
            },

            {
                'name': '动力火车',
                'value': 1748.31
            },

            {
                'name': '超级联盟',
                'value': 1722.46
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1380.24
            },

            {
                'name': '一起爱',
                'value': 1158.50
            },

            {
                'name': '天荒地老',
                'value': 755.22
            } ],
        'date': '2019-05-29-11'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2570.86
            },

            {
                'name': '一起幸福一起飞',
                'value': 2005.79
            },

            {
                'name': '动力火车',
                'value': 1750.59
            },

            {
                'name': '超级联盟',
                'value': 1723.31
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1381.09
            },

            {
                'name': '一起爱',
                'value': 1158.50
            },

            {
                'name': '天荒地老',
                'value': 755.22
            } ],
        'date': '2019-05-29-12'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2573.87
            },

            {
                'name': '一起幸福一起飞',
                'value': 2005.79
            },

            {
                'name': '动力火车',
                'value': 1754.78
            },

            {
                'name': '超级联盟',
                'value': 1723.31
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1382.00
            },

            {
                'name': '一起爱',
                'value': 1158.50
            },

            {
                'name': '天荒地老',
                'value': 755.22
            } ],
        'date': '2019-05-29-13'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2581.18
            },

            {
                'name': '一起幸福一起飞',
                'value': 2005.79
            },

            {
                'name': '动力火车',
                'value': 1759.10
            },

            {
                'name': '超级联盟',
                'value': 1726.32
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1392.31
            },

            {
                'name': '一起爱',
                'value': 1160.46
            },

            {
                'name': '天荒地老',
                'value': 757.11
            } ],
        'date': '2019-05-29-14'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2586.48
            },

            {
                'name': '一起幸福一起飞',
                'value': 2005.79
            },

            {
                'name': '动力火车',
                'value': 1763.27
            },

            {
                'name': '超级联盟',
                'value': 1726.32
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1402.27
            },

            {
                'name': '一起爱',
                'value': 1160.85
            },

            {
                'name': '天荒地老',
                'value': 758.43
            } ],
        'date': '2019-05-29-15'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2596.67
            },

            {
                'name': '一起幸福一起飞',
                'value': 2010.61
            },

            {
                'name': '动力火车',
                'value': 1763.27
            },

            {
                'name': '超级联盟',
                'value': 1726.32
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1402.27
            },

            {
                'name': '一起爱',
                'value': 1162.03
            },

            {
                'name': '天荒地老',
                'value': 758.57
            } ],
        'date': '2019-05-29-16'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2609.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 2010.61
            },

            {
                'name': '动力火车',
                'value': 1763.27
            },

            {
                'name': '超级联盟',
                'value': 1726.51
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1402.27
            },

            {
                'name': '一起爱',
                'value': 1162.03
            },

            {
                'name': '天荒地老',
                'value': 758.57
            } ],
        'date': '2019-05-29-17'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2611.77
            },

            {
                'name': '一起幸福一起飞',
                'value': 2015.38
            },

            {
                'name': '动力火车',
                'value': 1769.23
            },

            {
                'name': '超级联盟',
                'value': 1742.21
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1402.27
            },

            {
                'name': '一起爱',
                'value': 1162.03
            },

            {
                'name': '天荒地老',
                'value': 758.57
            } ],
        'date': '2019-05-29-18'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2619.28
            },

            {
                'name': '一起幸福一起飞',
                'value': 2029.65
            },

            {
                'name': '动力火车',
                'value': 1785.26
            },

            {
                'name': '超级联盟',
                'value': 1743.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1402.27
            },

            {
                'name': '一起爱',
                'value': 1172.95
            },

            {
                'name': '天荒地老',
                'value': 758.57
            } ],
        'date': '2019-05-29-19'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2637.35
            },

            {
                'name': '一起幸福一起飞',
                'value': 2045.54
            },

            {
                'name': '动力火车',
                'value': 1789.02
            },

            {
                'name': '超级联盟',
                'value': 1768.77
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1402.27
            },

            {
                'name': '一起爱',
                'value': 1184.38
            },

            {
                'name': '天荒地老',
                'value': 758.57
            } ],
        'date': '2019-05-29-20'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2648.30
            },

            {
                'name': '一起幸福一起飞',
                'value': 2064.39
            },

            {
                'name': '动力火车',
                'value': 1793.42
            },

            {
                'name': '超级联盟',
                'value': 1784.26
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1402.27
            },

            {
                'name': '一起爱',
                'value': 1187.56
            },

            {
                'name': '天荒地老',
                'value': 758.57
            } ],
        'date': '2019-05-29-21'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2651.76
            },

            {
                'name': '一起幸福一起飞',
                'value': 2067.67
            },

            {
                'name': '动力火车',
                'value': 1807.34
            },

            {
                'name': '超级联盟',
                'value': 1791.37
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1411.03
            },

            {
                'name': '一起爱',
                'value': 1194.91
            },

            {
                'name': '天荒地老',
                'value': 758.57
            } ],
        'date': '2019-05-29-22'
    },

    {
        'category': '2019-05-29',
        'data': [

            {
                'name': '行者无畏',
                'value': 2671.56
            },

            {
                'name': '一起幸福一起飞',
                'value': 2068.75
            },

            {
                'name': '动力火车',
                'value': 1807.34
            },

            {
                'name': '超级联盟',
                'value': 1794.39
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1411.03
            },

            {
                'name': '一起爱',
                'value': 1194.91
            },

            {
                'name': '天荒地老',
                'value': 758.57
            } ],
        'date': '2019-05-29-23'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2673.63
            },

            {
                'name': '一起幸福一起飞',
                'value': 2071.32
            },

            {
                'name': '动力火车',
                'value': 1807.34
            },

            {
                'name': '超级联盟',
                'value': 1794.39
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1411.03
            },

            {
                'name': '一起爱',
                'value': 1194.91
            },

            {
                'name': '天荒地老',
                'value': 758.57
            } ],
        'date': '2019-05-30-0'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2675.34
            },

            {
                'name': '一起幸福一起飞',
                'value': 2071.32
            },

            {
                'name': '动力火车',
                'value': 1807.34
            },

            {
                'name': '超级联盟',
                'value': 1799.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1411.03
            },

            {
                'name': '一起爱',
                'value': 1194.91
            },

            {
                'name': '天荒地老',
                'value': 758.57
            } ],
        'date': '2019-05-30-1'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2675.34
            },

            {
                'name': '一起幸福一起飞',
                'value': 2071.32
            },

            {
                'name': '动力火车',
                'value': 1807.34
            },

            {
                'name': '超级联盟',
                'value': 1799.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1411.03
            },

            {
                'name': '一起爱',
                'value': 1194.91
            },

            {
                'name': '天荒地老',
                'value': 758.57
            } ],
        'date': '2019-05-30-2'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2675.34
            },

            {
                'name': '一起幸福一起飞',
                'value': 2071.32
            },

            {
                'name': '动力火车',
                'value': 1807.34
            },

            {
                'name': '超级联盟',
                'value': 1799.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1411.03
            },

            {
                'name': '一起爱',
                'value': 1194.91
            },

            {
                'name': '天荒地老',
                'value': 758.57
            } ],
        'date': '2019-05-30-3'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2675.34
            },

            {
                'name': '一起幸福一起飞',
                'value': 2071.32
            },

            {
                'name': '动力火车',
                'value': 1807.34
            },

            {
                'name': '超级联盟',
                'value': 1799.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1411.03
            },

            {
                'name': '一起爱',
                'value': 1194.91
            },

            {
                'name': '天荒地老',
                'value': 758.57
            } ],
        'date': '2019-05-30-4'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2675.34
            },

            {
                'name': '一起幸福一起飞',
                'value': 2071.32
            },

            {
                'name': '动力火车',
                'value': 1807.34
            },

            {
                'name': '超级联盟',
                'value': 1799.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1411.03
            },

            {
                'name': '一起爱',
                'value': 1194.91
            },

            {
                'name': '天荒地老',
                'value': 758.57
            } ],
        'date': '2019-05-30-5'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2675.34
            },

            {
                'name': '一起幸福一起飞',
                'value': 2087.54
            },

            {
                'name': '动力火车',
                'value': 1807.34
            },

            {
                'name': '超级联盟',
                'value': 1799.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1411.03
            },

            {
                'name': '一起爱',
                'value': 1195.00
            },

            {
                'name': '天荒地老',
                'value': 759.29
            } ],
        'date': '2019-05-30-6'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2690.13
            },

            {
                'name': '一起幸福一起飞',
                'value': 2097.03
            },

            {
                'name': '动力火车',
                'value': 1812.66
            },

            {
                'name': '超级联盟',
                'value': 1805.17
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1427.72
            },

            {
                'name': '一起爱',
                'value': 1214.39
            },

            {
                'name': '天荒地老',
                'value': 763.17
            } ],
        'date': '2019-05-30-7'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2750.17
            },

            {
                'name': '一起幸福一起飞',
                'value': 2149.96
            },

            {
                'name': '超级联盟',
                'value': 1843.54
            },

            {
                'name': '动力火车',
                'value': 1821.95
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1437.82
            },

            {
                'name': '一起爱',
                'value': 1225.07
            },

            {
                'name': '天荒地老',
                'value': 767.40
            } ],
        'date': '2019-05-30-8'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2756.63
            },

            {
                'name': '一起幸福一起飞',
                'value': 2173.96
            },

            {
                'name': '超级联盟',
                'value': 1857.18
            },

            {
                'name': '动力火车',
                'value': 1848.12
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1437.82
            },

            {
                'name': '一起爱',
                'value': 1240.71
            },

            {
                'name': '天荒地老',
                'value': 767.40
            } ],
        'date': '2019-05-30-9'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2765.81
            },

            {
                'name': '一起幸福一起飞',
                'value': 2187.34
            },

            {
                'name': '动力火车',
                'value': 1874.88
            },

            {
                'name': '超级联盟',
                'value': 1858.83
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1439.11
            },

            {
                'name': '一起爱',
                'value': 1240.71
            },

            {
                'name': '天荒地老',
                'value': 770.65
            } ],
        'date': '2019-05-30-10'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2767.98
            },

            {
                'name': '一起幸福一起飞',
                'value': 2187.68
            },

            {
                'name': '动力火车',
                'value': 1876.21
            },

            {
                'name': '超级联盟',
                'value': 1859.57
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1443.84
            },

            {
                'name': '一起爱',
                'value': 1240.71
            },

            {
                'name': '天荒地老',
                'value': 770.65
            } ],
        'date': '2019-05-30-11'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2769.09
            },

            {
                'name': '一起幸福一起飞',
                'value': 2188.76
            },

            {
                'name': '动力火车',
                'value': 1876.21
            },

            {
                'name': '超级联盟',
                'value': 1859.57
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1443.84
            },

            {
                'name': '一起爱',
                'value': 1240.71
            },

            {
                'name': '天荒地老',
                'value': 770.65
            } ],
        'date': '2019-05-30-12'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2781.08
            },

            {
                'name': '一起幸福一起飞',
                'value': 2188.76
            },

            {
                'name': '动力火车',
                'value': 1881.31
            },

            {
                'name': '超级联盟',
                'value': 1863.06
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1443.84
            },

            {
                'name': '一起爱',
                'value': 1240.71
            },

            {
                'name': '天荒地老',
                'value': 771.14
            } ],
        'date': '2019-05-30-13'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2785.22
            },

            {
                'name': '一起幸福一起飞',
                'value': 2189.91
            },

            {
                'name': '动力火车',
                'value': 1882.25
            },

            {
                'name': '超级联盟',
                'value': 1868.12
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1443.84
            },

            {
                'name': '一起爱',
                'value': 1245.23
            },

            {
                'name': '天荒地老',
                'value': 772.02
            } ],
        'date': '2019-05-30-14'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2787.48
            },

            {
                'name': '一起幸福一起飞',
                'value': 2191.38
            },

            {
                'name': '动力火车',
                'value': 1885.00
            },

            {
                'name': '超级联盟',
                'value': 1869.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1443.84
            },

            {
                'name': '一起爱',
                'value': 1245.74
            },

            {
                'name': '天荒地老',
                'value': 772.02
            } ],
        'date': '2019-05-30-15'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2795.07
            },

            {
                'name': '一起幸福一起飞',
                'value': 2191.38
            },

            {
                'name': '动力火车',
                'value': 1887.77
            },

            {
                'name': '超级联盟',
                'value': 1870.45
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1445.02
            },

            {
                'name': '一起爱',
                'value': 1246.65
            },

            {
                'name': '天荒地老',
                'value': 774.89
            } ],
        'date': '2019-05-30-16'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2798.50
            },

            {
                'name': '一起幸福一起飞',
                'value': 2191.38
            },

            {
                'name': '动力火车',
                'value': 1887.77
            },

            {
                'name': '超级联盟',
                'value': 1872.03
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1445.02
            },

            {
                'name': '一起爱',
                'value': 1247.04
            },

            {
                'name': '天荒地老',
                'value': 774.89
            } ],
        'date': '2019-05-30-17'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2801.59
            },

            {
                'name': '一起幸福一起飞',
                'value': 2193.15
            },

            {
                'name': '动力火车',
                'value': 1901.43
            },

            {
                'name': '超级联盟',
                'value': 1872.20
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1445.02
            },

            {
                'name': '一起爱',
                'value': 1249.11
            },

            {
                'name': '天荒地老',
                'value': 774.89
            } ],
        'date': '2019-05-30-18'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2806.95
            },

            {
                'name': '一起幸福一起飞',
                'value': 2197.97
            },

            {
                'name': '动力火车',
                'value': 1903.31
            },

            {
                'name': '超级联盟',
                'value': 1881.29
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1445.14
            },

            {
                'name': '一起爱',
                'value': 1250.00
            },

            {
                'name': '天荒地老',
                'value': 788.77
            } ],
        'date': '2019-05-30-19'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2823.66
            },

            {
                'name': '一起幸福一起飞',
                'value': 2198.38
            },

            {
                'name': '动力火车',
                'value': 1908.07
            },

            {
                'name': '超级联盟',
                'value': 1881.29
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1455.54
            },

            {
                'name': '一起爱',
                'value': 1251.43
            },

            {
                'name': '天荒地老',
                'value': 788.77
            } ],
        'date': '2019-05-30-20'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2846.63
            },

            {
                'name': '一起幸福一起飞',
                'value': 2199.52
            },

            {
                'name': '动力火车',
                'value': 1910.83
            },

            {
                'name': '超级联盟',
                'value': 1886.10
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1458.36
            },

            {
                'name': '一起爱',
                'value': 1260.62
            },

            {
                'name': '天荒地老',
                'value': 812.06
            } ],
        'date': '2019-05-30-21'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2883.76
            },

            {
                'name': '一起幸福一起飞',
                'value': 2211.52
            },

            {
                'name': '动力火车',
                'value': 1922.43
            },

            {
                'name': '超级联盟',
                'value': 1894.40
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1462.95
            },

            {
                'name': '一起爱',
                'value': 1266.42
            },

            {
                'name': '天荒地老',
                'value': 812.06
            } ],
        'date': '2019-05-30-22'
    },

    {
        'category': '2019-05-30',
        'data': [

            {
                'name': '行者无畏',
                'value': 2919.28
            },

            {
                'name': '一起幸福一起飞',
                'value': 2212.62
            },

            {
                'name': '超级联盟',
                'value': 1929.37
            },

            {
                'name': '动力火车',
                'value': 1922.43
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1479.44
            },

            {
                'name': '一起爱',
                'value': 1266.42
            },

            {
                'name': '天荒地老',
                'value': 814.98
            } ],
        'date': '2019-05-30-23'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 2926.87
            },

            {
                'name': '一起幸福一起飞',
                'value': 2216.47
            },

            {
                'name': '超级联盟',
                'value': 1932.86
            },

            {
                'name': '动力火车',
                'value': 1930.42
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1481.51
            },

            {
                'name': '一起爱',
                'value': 1276.68
            },

            {
                'name': '天荒地老',
                'value': 814.98
            } ],
        'date': '2019-05-31-0'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 2926.87
            },

            {
                'name': '一起幸福一起飞',
                'value': 2216.47
            },

            {
                'name': '动力火车',
                'value': 1934.49
            },

            {
                'name': '超级联盟',
                'value': 1932.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1481.51
            },

            {
                'name': '一起爱',
                'value': 1276.68
            },

            {
                'name': '天荒地老',
                'value': 814.98
            } ],
        'date': '2019-05-31-1'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 2926.87
            },

            {
                'name': '一起幸福一起飞',
                'value': 2216.47
            },

            {
                'name': '动力火车',
                'value': 1934.49
            },

            {
                'name': '超级联盟',
                'value': 1932.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1481.51
            },

            {
                'name': '一起爱',
                'value': 1278.54
            },

            {
                'name': '天荒地老',
                'value': 814.98
            } ],
        'date': '2019-05-31-2'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 2926.87
            },

            {
                'name': '一起幸福一起飞',
                'value': 2216.47
            },

            {
                'name': '动力火车',
                'value': 1934.49
            },

            {
                'name': '超级联盟',
                'value': 1932.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1481.51
            },

            {
                'name': '一起爱',
                'value': 1278.54
            },

            {
                'name': '天荒地老',
                'value': 814.98
            } ],
        'date': '2019-05-31-3'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 2926.87
            },

            {
                'name': '一起幸福一起飞',
                'value': 2216.47
            },

            {
                'name': '动力火车',
                'value': 1934.49
            },

            {
                'name': '超级联盟',
                'value': 1932.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1481.51
            },

            {
                'name': '一起爱',
                'value': 1278.54
            },

            {
                'name': '天荒地老',
                'value': 814.98
            } ],
        'date': '2019-05-31-4'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 2926.87
            },

            {
                'name': '一起幸福一起飞',
                'value': 2216.47
            },

            {
                'name': '动力火车',
                'value': 1934.49
            },

            {
                'name': '超级联盟',
                'value': 1932.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1481.51
            },

            {
                'name': '一起爱',
                'value': 1278.54
            },

            {
                'name': '天荒地老',
                'value': 814.98
            } ],
        'date': '2019-05-31-5'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 2926.87
            },

            {
                'name': '一起幸福一起飞',
                'value': 2216.47
            },

            {
                'name': '动力火车',
                'value': 1934.49
            },

            {
                'name': '超级联盟',
                'value': 1932.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1481.51
            },

            {
                'name': '一起爱',
                'value': 1278.54
            },

            {
                'name': '天荒地老',
                'value': 814.98
            } ],
        'date': '2019-05-31-6'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 2930.52
            },

            {
                'name': '一起幸福一起飞',
                'value': 2226.67
            },

            {
                'name': '动力火车',
                'value': 1936.56
            },

            {
                'name': '超级联盟',
                'value': 1936.17
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1483.18
            },

            {
                'name': '一起爱',
                'value': 1281.13
            },

            {
                'name': '天荒地老',
                'value': 833.32
            } ],
        'date': '2019-05-31-7'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 2969.55
            },

            {
                'name': '一起幸福一起飞',
                'value': 2262.14
            },

            {
                'name': '超级联盟',
                'value': 1972.78
            },

            {
                'name': '动力火车',
                'value': 1955.77
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1523.60
            },

            {
                'name': '一起爱',
                'value': 1291.20
            },

            {
                'name': '天荒地老',
                'value': 842.83
            } ],
        'date': '2019-05-31-8'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 2991.20
            },

            {
                'name': '一起幸福一起飞',
                'value': 2264.52
            },

            {
                'name': '超级联盟',
                'value': 2010.75
            },

            {
                'name': '动力火车',
                'value': 1966.06
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1526.79
            },

            {
                'name': '一起爱',
                'value': 1298.82
            },

            {
                'name': '天荒地老',
                'value': 846.44
            } ],
        'date': '2019-05-31-9'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 3001.97
            },

            {
                'name': '一起幸福一起飞',
                'value': 2264.52
            },

            {
                'name': '超级联盟',
                'value': 2020.80
            },

            {
                'name': '动力火车',
                'value': 1980.03
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1532.00
            },

            {
                'name': '一起爱',
                'value': 1307.83
            },

            {
                'name': '天荒地老',
                'value': 852.59
            } ],
        'date': '2019-05-31-10'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 3008.83
            },

            {
                'name': '一起幸福一起飞',
                'value': 2266.50
            },

            {
                'name': '超级联盟',
                'value': 2020.80
            },

            {
                'name': '动力火车',
                'value': 1980.15
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1536.40
            },

            {
                'name': '一起爱',
                'value': 1307.83
            },

            {
                'name': '天荒地老',
                'value': 852.59
            } ],
        'date': '2019-05-31-11'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 3013.94
            },

            {
                'name': '一起幸福一起飞',
                'value': 2270.09
            },

            {
                'name': '超级联盟',
                'value': 2026.85
            },

            {
                'name': '动力火车',
                'value': 1980.25
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1536.40
            },

            {
                'name': '一起爱',
                'value': 1307.83
            },

            {
                'name': '天荒地老',
                'value': 852.59
            } ],
        'date': '2019-05-31-12'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 3032.71
            },

            {
                'name': '一起幸福一起飞',
                'value': 2270.09
            },

            {
                'name': '超级联盟',
                'value': 2029.28
            },

            {
                'name': '动力火车',
                'value': 1980.47
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1536.40
            },

            {
                'name': '一起爱',
                'value': 1307.83
            },

            {
                'name': '天荒地老',
                'value': 883.12
            } ],
        'date': '2019-05-31-13'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 3033.97
            },

            {
                'name': '一起幸福一起飞',
                'value': 2290.09
            },

            {
                'name': '超级联盟',
                'value': 2034.87
            },

            {
                'name': '动力火车',
                'value': 1980.47
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1555.77
            },

            {
                'name': '一起爱',
                'value': 1312.31
            },

            {
                'name': '天荒地老',
                'value': 888.30
            } ],
        'date': '2019-05-31-14'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 3033.97
            },

            {
                'name': '一起幸福一起飞',
                'value': 2290.09
            },

            {
                'name': '超级联盟',
                'value': 2034.87
            },

            {
                'name': '动力火车',
                'value': 1980.47
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1556.90
            },

            {
                'name': '一起爱',
                'value': 1312.95
            },

            {
                'name': '天荒地老',
                'value': 888.30
            } ],
        'date': '2019-05-31-15'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 3038.94
            },

            {
                'name': '一起幸福一起飞',
                'value': 2294.93
            },

            {
                'name': '超级联盟',
                'value': 2036.50
            },

            {
                'name': '动力火车',
                'value': 1980.47
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1559.07
            },

            {
                'name': '一起爱',
                'value': 1312.95
            },

            {
                'name': '天荒地老',
                'value': 888.30
            } ],
        'date': '2019-05-31-16'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 3042.41
            },

            {
                'name': '一起幸福一起飞',
                'value': 2295.69
            },

            {
                'name': '超级联盟',
                'value': 2036.50
            },

            {
                'name': '动力火车',
                'value': 1981.40
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1559.07
            },

            {
                'name': '一起爱',
                'value': 1323.16
            },

            {
                'name': '天荒地老',
                'value': 888.30
            } ],
        'date': '2019-05-31-17'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 3057.66
            },

            {
                'name': '一起幸福一起飞',
                'value': 2295.69
            },

            {
                'name': '超级联盟',
                'value': 2060.74
            },

            {
                'name': '动力火车',
                'value': 1984.27
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1559.71
            },

            {
                'name': '一起爱',
                'value': 1323.16
            },

            {
                'name': '天荒地老',
                'value': 890.62
            } ],
        'date': '2019-05-31-18'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 3065.08
            },

            {
                'name': '一起幸福一起飞',
                'value': 2297.59
            },

            {
                'name': '超级联盟',
                'value': 2071.61
            },

            {
                'name': '动力火车',
                'value': 1989.73
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1559.71
            },

            {
                'name': '一起爱',
                'value': 1332.44
            },

            {
                'name': '天荒地老',
                'value': 890.62
            } ],
        'date': '2019-05-31-19'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 3066.80
            },

            {
                'name': '一起幸福一起飞',
                'value': 2310.42
            },

            {
                'name': '超级联盟',
                'value': 2102.20
            },

            {
                'name': '动力火车',
                'value': 1989.73
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1572.37
            },

            {
                'name': '一起爱',
                'value': 1335.15
            },

            {
                'name': '天荒地老',
                'value': 890.62
            } ],
        'date': '2019-05-31-20'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 3082.00
            },

            {
                'name': '一起幸福一起飞',
                'value': 2320.09
            },

            {
                'name': '超级联盟',
                'value': 2128.32
            },

            {
                'name': '动力火车',
                'value': 1993.05
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1579.00
            },

            {
                'name': '一起爱',
                'value': 1337.10
            },

            {
                'name': '天荒地老',
                'value': 891.19
            } ],
        'date': '2019-05-31-21'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 3094.37
            },

            {
                'name': '一起幸福一起飞',
                'value': 2320.09
            },

            {
                'name': '超级联盟',
                'value': 2145.47
            },

            {
                'name': '动力火车',
                'value': 2008.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1583.41
            },

            {
                'name': '一起爱',
                'value': 1337.91
            },

            {
                'name': '天荒地老',
                'value': 891.19
            } ],
        'date': '2019-05-31-22'
    },

    {
        'category': '2019-05-31',
        'data': [

            {
                'name': '行者无畏',
                'value': 3109.37
            },

            {
                'name': '一起幸福一起飞',
                'value': 2348.24
            },

            {
                'name': '超级联盟',
                'value': 2156.93
            },

            {
                'name': '动力火车',
                'value': 2016.59
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1583.41
            },

            {
                'name': '一起爱',
                'value': 1339.31
            },

            {
                'name': '天荒地老',
                'value': 891.19
            } ],
        'date': '2019-05-31-23'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3111.23
            },

            {
                'name': '一起幸福一起飞',
                'value': 2352.15
            },

            {
                'name': '超级联盟',
                'value': 2156.93
            },

            {
                'name': '动力火车',
                'value': 2016.59
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1588.15
            },

            {
                'name': '一起爱',
                'value': 1339.31
            },

            {
                'name': '天荒地老',
                'value': 898.74
            } ],
        'date': '2019-06-01-0'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3111.40
            },

            {
                'name': '一起幸福一起飞',
                'value': 2355.87
            },

            {
                'name': '超级联盟',
                'value': 2156.93
            },

            {
                'name': '动力火车',
                'value': 2016.59
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1588.15
            },

            {
                'name': '一起爱',
                'value': 1340.76
            },

            {
                'name': '天荒地老',
                'value': 898.74
            } ],
        'date': '2019-06-01-1'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3111.40
            },

            {
                'name': '一起幸福一起飞',
                'value': 2355.87
            },

            {
                'name': '超级联盟',
                'value': 2156.93
            },

            {
                'name': '动力火车',
                'value': 2016.59
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1588.15
            },

            {
                'name': '一起爱',
                'value': 1340.76
            },

            {
                'name': '天荒地老',
                'value': 898.74
            } ],
        'date': '2019-06-01-2'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3111.40
            },

            {
                'name': '一起幸福一起飞',
                'value': 2355.87
            },

            {
                'name': '超级联盟',
                'value': 2156.93
            },

            {
                'name': '动力火车',
                'value': 2016.59
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1588.15
            },

            {
                'name': '一起爱',
                'value': 1340.76
            },

            {
                'name': '天荒地老',
                'value': 898.74
            } ],
        'date': '2019-06-01-3'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3111.40
            },

            {
                'name': '一起幸福一起飞',
                'value': 2355.87
            },

            {
                'name': '超级联盟',
                'value': 2156.93
            },

            {
                'name': '动力火车',
                'value': 2016.59
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1588.15
            },

            {
                'name': '一起爱',
                'value': 1340.76
            },

            {
                'name': '天荒地老',
                'value': 898.74
            } ],
        'date': '2019-06-01-4'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3111.40
            },

            {
                'name': '一起幸福一起飞',
                'value': 2355.87
            },

            {
                'name': '超级联盟',
                'value': 2156.93
            },

            {
                'name': '动力火车',
                'value': 2016.59
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1588.15
            },

            {
                'name': '一起爱',
                'value': 1340.76
            },

            {
                'name': '天荒地老',
                'value': 898.74
            } ],
        'date': '2019-06-01-5'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3111.40
            },

            {
                'name': '一起幸福一起飞',
                'value': 2355.87
            },

            {
                'name': '超级联盟',
                'value': 2156.93
            },

            {
                'name': '动力火车',
                'value': 2016.59
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1588.15
            },

            {
                'name': '一起爱',
                'value': 1340.76
            },

            {
                'name': '天荒地老',
                'value': 898.74
            } ],
        'date': '2019-06-01-6'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3116.70
            },

            {
                'name': '一起幸福一起飞',
                'value': 2384.74
            },

            {
                'name': '超级联盟',
                'value': 2167.06
            },

            {
                'name': '动力火车',
                'value': 2022.20
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1600.15
            },

            {
                'name': '一起爱',
                'value': 1340.76
            },

            {
                'name': '天荒地老',
                'value': 903.44
            } ],
        'date': '2019-06-01-7'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3167.02
            },

            {
                'name': '一起幸福一起飞',
                'value': 2415.55
            },

            {
                'name': '超级联盟',
                'value': 2201.23
            },

            {
                'name': '动力火车',
                'value': 2065.70
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1628.82
            },

            {
                'name': '一起爱',
                'value': 1366.01
            },

            {
                'name': '天荒地老',
                'value': 916.12
            } ],
        'date': '2019-06-01-8'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3182.23
            },

            {
                'name': '一起幸福一起飞',
                'value': 2440.91
            },

            {
                'name': '超级联盟',
                'value': 2267.62
            },

            {
                'name': '动力火车',
                'value': 2087.95
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1649.58
            },

            {
                'name': '一起爱',
                'value': 1368.51
            },

            {
                'name': '天荒地老',
                'value': 916.12
            } ],
        'date': '2019-06-01-9'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3200.16
            },

            {
                'name': '一起幸福一起飞',
                'value': 2448.66
            },

            {
                'name': '超级联盟',
                'value': 2279.62
            },

            {
                'name': '动力火车',
                'value': 2090.82
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1650.59
            },

            {
                'name': '一起爱',
                'value': 1369.82
            },

            {
                'name': '天荒地老',
                'value': 924.20
            } ],
        'date': '2019-06-01-10'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3224.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 2468.66
            },

            {
                'name': '超级联盟',
                'value': 2279.62
            },

            {
                'name': '动力火车',
                'value': 2112.56
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1651.86
            },

            {
                'name': '一起爱',
                'value': 1369.82
            },

            {
                'name': '天荒地老',
                'value': 924.79
            } ],
        'date': '2019-06-01-11'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3226.36
            },

            {
                'name': '一起幸福一起飞',
                'value': 2468.66
            },

            {
                'name': '超级联盟',
                'value': 2298.70
            },

            {
                'name': '动力火车',
                'value': 2119.15
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1651.86
            },

            {
                'name': '一起爱',
                'value': 1379.86
            },

            {
                'name': '天荒地老',
                'value': 931.68
            } ],
        'date': '2019-06-01-12'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3232.15
            },

            {
                'name': '一起幸福一起飞',
                'value': 2470.25
            },

            {
                'name': '超级联盟',
                'value': 2301.00
            },

            {
                'name': '动力火车',
                'value': 2129.80
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1651.86
            },

            {
                'name': '一起爱',
                'value': 1383.61
            },

            {
                'name': '天荒地老',
                'value': 931.68
            } ],
        'date': '2019-06-01-13'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3238.26
            },

            {
                'name': '一起幸福一起飞',
                'value': 2470.25
            },

            {
                'name': '超级联盟',
                'value': 2311.94
            },

            {
                'name': '动力火车',
                'value': 2136.17
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1662.03
            },

            {
                'name': '一起爱',
                'value': 1406.22
            },

            {
                'name': '天荒地老',
                'value': 933.81
            } ],
        'date': '2019-06-01-14'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3238.26
            },

            {
                'name': '一起幸福一起飞',
                'value': 2470.66
            },

            {
                'name': '超级联盟',
                'value': 2312.26
            },

            {
                'name': '动力火车',
                'value': 2136.41
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1665.45
            },

            {
                'name': '一起爱',
                'value': 1408.91
            },

            {
                'name': '天荒地老',
                'value': 933.81
            } ],
        'date': '2019-06-01-15'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3249.43
            },

            {
                'name': '一起幸福一起飞',
                'value': 2473.93
            },

            {
                'name': '超级联盟',
                'value': 2317.32
            },

            {
                'name': '动力火车',
                'value': 2137.87
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1665.45
            },

            {
                'name': '一起爱',
                'value': 1412.98
            },

            {
                'name': '天荒地老',
                'value': 944.93
            } ],
        'date': '2019-06-01-16'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3249.91
            },

            {
                'name': '一起幸福一起飞',
                'value': 2474.36
            },

            {
                'name': '超级联盟',
                'value': 2317.32
            },

            {
                'name': '动力火车',
                'value': 2139.91
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1665.45
            },

            {
                'name': '一起爱',
                'value': 1417.95
            },

            {
                'name': '天荒地老',
                'value': 944.93
            } ],
        'date': '2019-06-01-17'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3249.91
            },

            {
                'name': '一起幸福一起飞',
                'value': 2485.98
            },

            {
                'name': '超级联盟',
                'value': 2318.42
            },

            {
                'name': '动力火车',
                'value': 2148.33
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1675.49
            },

            {
                'name': '一起爱',
                'value': 1425.18
            },

            {
                'name': '天荒地老',
                'value': 944.93
            } ],
        'date': '2019-06-01-18'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3257.02
            },

            {
                'name': '一起幸福一起飞',
                'value': 2493.60
            },

            {
                'name': '超级联盟',
                'value': 2332.74
            },

            {
                'name': '动力火车',
                'value': 2148.33
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1675.49
            },

            {
                'name': '一起爱',
                'value': 1425.18
            },

            {
                'name': '天荒地老',
                'value': 948.50
            } ],
        'date': '2019-06-01-19'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3264.17
            },

            {
                'name': '一起幸福一起飞',
                'value': 2508.65
            },

            {
                'name': '超级联盟',
                'value': 2332.74
            },

            {
                'name': '动力火车',
                'value': 2153.80
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1675.49
            },

            {
                'name': '一起爱',
                'value': 1437.51
            },

            {
                'name': '天荒地老',
                'value': 948.50
            } ],
        'date': '2019-06-01-20'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3277.34
            },

            {
                'name': '一起幸福一起飞',
                'value': 2510.33
            },

            {
                'name': '超级联盟',
                'value': 2341.06
            },

            {
                'name': '动力火车',
                'value': 2162.90
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1694.93
            },

            {
                'name': '一起爱',
                'value': 1439.73
            },

            {
                'name': '天荒地老',
                'value': 949.55
            } ],
        'date': '2019-06-01-21'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3296.27
            },

            {
                'name': '一起幸福一起飞',
                'value': 2511.90
            },

            {
                'name': '超级联盟',
                'value': 2348.71
            },

            {
                'name': '动力火车',
                'value': 2162.90
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1696.41
            },

            {
                'name': '一起爱',
                'value': 1454.45
            },

            {
                'name': '天荒地老',
                'value': 949.91
            } ],
        'date': '2019-06-01-22'
    },

    {
        'category': '2019-06-01',
        'data': [

            {
                'name': '行者无畏',
                'value': 3319.42
            },

            {
                'name': '一起幸福一起飞',
                'value': 2530.15
            },

            {
                'name': '超级联盟',
                'value': 2357.43
            },

            {
                'name': '动力火车',
                'value': 2162.90
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1696.41
            },

            {
                'name': '一起爱',
                'value': 1454.45
            },

            {
                'name': '天荒地老',
                'value': 949.91
            } ],
        'date': '2019-06-01-23'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3319.42
            },

            {
                'name': '一起幸福一起飞',
                'value': 2553.09
            },

            {
                'name': '超级联盟',
                'value': 2357.43
            },

            {
                'name': '动力火车',
                'value': 2162.90
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1696.41
            },

            {
                'name': '一起爱',
                'value': 1454.45
            },

            {
                'name': '天荒地老',
                'value': 956.30
            } ],
        'date': '2019-06-02-0'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3321.26
            },

            {
                'name': '一起幸福一起飞',
                'value': 2553.09
            },

            {
                'name': '超级联盟',
                'value': 2357.43
            },

            {
                'name': '动力火车',
                'value': 2162.90
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1696.41
            },

            {
                'name': '一起爱',
                'value': 1454.45
            },

            {
                'name': '天荒地老',
                'value': 956.30
            } ],
        'date': '2019-06-02-1'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3321.26
            },

            {
                'name': '一起幸福一起飞',
                'value': 2553.09
            },

            {
                'name': '超级联盟',
                'value': 2357.43
            },

            {
                'name': '动力火车',
                'value': 2162.90
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1696.41
            },

            {
                'name': '一起爱',
                'value': 1454.45
            },

            {
                'name': '天荒地老',
                'value': 956.30
            } ],
        'date': '2019-06-02-2'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3321.26
            },

            {
                'name': '一起幸福一起飞',
                'value': 2553.09
            },

            {
                'name': '超级联盟',
                'value': 2357.43
            },

            {
                'name': '动力火车',
                'value': 2162.90
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1696.41
            },

            {
                'name': '一起爱',
                'value': 1454.45
            },

            {
                'name': '天荒地老',
                'value': 956.30
            } ],
        'date': '2019-06-02-3'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3321.26
            },

            {
                'name': '一起幸福一起飞',
                'value': 2553.09
            },

            {
                'name': '超级联盟',
                'value': 2357.43
            },

            {
                'name': '动力火车',
                'value': 2162.90
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1696.41
            },

            {
                'name': '一起爱',
                'value': 1454.45
            },

            {
                'name': '天荒地老',
                'value': 956.30
            } ],
        'date': '2019-06-02-4'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3321.26
            },

            {
                'name': '一起幸福一起飞',
                'value': 2553.09
            },

            {
                'name': '超级联盟',
                'value': 2357.43
            },

            {
                'name': '动力火车',
                'value': 2162.90
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1696.41
            },

            {
                'name': '一起爱',
                'value': 1454.45
            },

            {
                'name': '天荒地老',
                'value': 956.30
            } ],
        'date': '2019-06-02-5'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3321.26
            },

            {
                'name': '一起幸福一起飞',
                'value': 2553.09
            },

            {
                'name': '超级联盟',
                'value': 2357.43
            },

            {
                'name': '动力火车',
                'value': 2162.90
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1696.41
            },

            {
                'name': '一起爱',
                'value': 1454.45
            },

            {
                'name': '天荒地老',
                'value': 956.30
            } ],
        'date': '2019-06-02-6'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3324.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 2557.92
            },

            {
                'name': '超级联盟',
                'value': 2359.54
            },

            {
                'name': '动力火车',
                'value': 2173.41
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1708.41
            },

            {
                'name': '一起爱',
                'value': 1454.45
            },

            {
                'name': '天荒地老',
                'value': 964.41
            } ],
        'date': '2019-06-02-7'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3377.86
            },

            {
                'name': '一起幸福一起飞',
                'value': 2612.76
            },

            {
                'name': '超级联盟',
                'value': 2391.70
            },

            {
                'name': '动力火车',
                'value': 2207.11
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1740.55
            },

            {
                'name': '一起爱',
                'value': 1521.69
            },

            {
                'name': '天荒地老',
                'value': 980.74
            } ],
        'date': '2019-06-02-8'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3420.85
            },

            {
                'name': '一起幸福一起飞',
                'value': 2633.35
            },

            {
                'name': '超级联盟',
                'value': 2430.35
            },

            {
                'name': '动力火车',
                'value': 2254.97
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1793.17
            },

            {
                'name': '一起爱',
                'value': 1543.90
            },

            {
                'name': '天荒地老',
                'value': 995.50
            } ],
        'date': '2019-06-02-9'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3426.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 2633.78
            },

            {
                'name': '超级联盟',
                'value': 2444.15
            },

            {
                'name': '动力火车',
                'value': 2269.18
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1828.24
            },

            {
                'name': '一起爱',
                'value': 1546.02
            },

            {
                'name': '天荒地老',
                'value': 995.50
            } ],
        'date': '2019-06-02-10'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3447.83
            },

            {
                'name': '一起幸福一起飞',
                'value': 2634.14
            },

            {
                'name': '超级联盟',
                'value': 2452.38
            },

            {
                'name': '动力火车',
                'value': 2297.63
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1828.24
            },

            {
                'name': '一起爱',
                'value': 1556.15
            },

            {
                'name': '天荒地老',
                'value': 1002.61
            } ],
        'date': '2019-06-02-11'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3452.75
            },

            {
                'name': '一起幸福一起飞',
                'value': 2678.42
            },

            {
                'name': '超级联盟',
                'value': 2457.15
            },

            {
                'name': '动力火车',
                'value': 2306.64
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1828.24
            },

            {
                'name': '一起爱',
                'value': 1556.66
            },

            {
                'name': '天荒地老',
                'value': 1005.37
            } ],
        'date': '2019-06-02-12'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3458.16
            },

            {
                'name': '一起幸福一起飞',
                'value': 2695.24
            },

            {
                'name': '超级联盟',
                'value': 2465.24
            },

            {
                'name': '动力火车',
                'value': 2306.64
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1848.91
            },

            {
                'name': '一起爱',
                'value': 1557.10
            },

            {
                'name': '天荒地老',
                'value': 1006.26
            } ],
        'date': '2019-06-02-13'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3463.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 2702.47
            },

            {
                'name': '超级联盟',
                'value': 2470.59
            },

            {
                'name': '动力火车',
                'value': 2326.64
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1848.91
            },

            {
                'name': '一起爱',
                'value': 1578.51
            },

            {
                'name': '天荒地老',
                'value': 1006.26
            } ],
        'date': '2019-06-02-14'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3469.65
            },

            {
                'name': '一起幸福一起飞',
                'value': 2703.45
            },

            {
                'name': '超级联盟',
                'value': 2472.76
            },

            {
                'name': '动力火车',
                'value': 2336.39
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1848.91
            },

            {
                'name': '一起爱',
                'value': 1578.51
            },

            {
                'name': '天荒地老',
                'value': 1006.26
            } ],
        'date': '2019-06-02-15'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3480.37
            },

            {
                'name': '一起幸福一起飞',
                'value': 2705.88
            },

            {
                'name': '超级联盟',
                'value': 2477.40
            },

            {
                'name': '动力火车',
                'value': 2339.59
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1850.28
            },

            {
                'name': '一起爱',
                'value': 1590.51
            },

            {
                'name': '天荒地老',
                'value': 1006.26
            } ],
        'date': '2019-06-02-16'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3483.34
            },

            {
                'name': '一起幸福一起飞',
                'value': 2705.88
            },

            {
                'name': '超级联盟',
                'value': 2480.65
            },

            {
                'name': '动力火车',
                'value': 2340.35
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1854.04
            },

            {
                'name': '一起爱',
                'value': 1590.51
            },

            {
                'name': '天荒地老',
                'value': 1006.26
            } ],
        'date': '2019-06-02-17'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3502.85
            },

            {
                'name': '一起幸福一起飞',
                'value': 2721.25
            },

            {
                'name': '超级联盟',
                'value': 2481.14
            },

            {
                'name': '动力火车',
                'value': 2355.56
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1854.04
            },

            {
                'name': '一起爱',
                'value': 1602.45
            },

            {
                'name': '天荒地老',
                'value': 1006.26
            } ],
        'date': '2019-06-02-18'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3507.31
            },

            {
                'name': '一起幸福一起飞',
                'value': 2725.20
            },

            {
                'name': '超级联盟',
                'value': 2485.87
            },

            {
                'name': '动力火车',
                'value': 2356.45
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1860.44
            },

            {
                'name': '一起爱',
                'value': 1608.67
            },

            {
                'name': '天荒地老',
                'value': 1006.26
            } ],
        'date': '2019-06-02-19'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3510.51
            },

            {
                'name': '一起幸福一起飞',
                'value': 2768.24
            },

            {
                'name': '超级联盟',
                'value': 2485.87
            },

            {
                'name': '动力火车',
                'value': 2370.13
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1860.44
            },

            {
                'name': '一起爱',
                'value': 1608.67
            },

            {
                'name': '天荒地老',
                'value': 1006.26
            } ],
        'date': '2019-06-02-20'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3532.31
            },

            {
                'name': '一起幸福一起飞',
                'value': 2778.29
            },

            {
                'name': '超级联盟',
                'value': 2485.87
            },

            {
                'name': '动力火车',
                'value': 2377.10
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1870.48
            },

            {
                'name': '一起爱',
                'value': 1608.86
            },

            {
                'name': '天荒地老',
                'value': 1006.26
            } ],
        'date': '2019-06-02-21'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3540.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 2783.34
            },

            {
                'name': '超级联盟',
                'value': 2504.11
            },

            {
                'name': '动力火车',
                'value': 2377.46
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1870.48
            },

            {
                'name': '一起爱',
                'value': 1608.86
            },

            {
                'name': '天荒地老',
                'value': 1011.29
            } ],
        'date': '2019-06-02-22'
    },

    {
        'category': '2019-06-02',
        'data': [

            {
                'name': '行者无畏',
                'value': 3556.59
            },

            {
                'name': '一起幸福一起飞',
                'value': 2786.96
            },

            {
                'name': '超级联盟',
                'value': 2524.11
            },

            {
                'name': '动力火车',
                'value': 2380.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1871.54
            },

            {
                'name': '一起爱',
                'value': 1608.86
            },

            {
                'name': '天荒地老',
                'value': 1011.29
            } ],
        'date': '2019-06-02-23'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3559.60
            },

            {
                'name': '一起幸福一起飞',
                'value': 2798.21
            },

            {
                'name': '超级联盟',
                'value': 2533.62
            },

            {
                'name': '动力火车',
                'value': 2380.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1871.54
            },

            {
                'name': '一起爱',
                'value': 1608.86
            },

            {
                'name': '天荒地老',
                'value': 1011.29
            } ],
        'date': '2019-06-03-0'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3565.86
            },

            {
                'name': '一起幸福一起飞',
                'value': 2798.21
            },

            {
                'name': '超级联盟',
                'value': 2535.84
            },

            {
                'name': '动力火车',
                'value': 2380.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1874.04
            },

            {
                'name': '一起爱',
                'value': 1608.86
            },

            {
                'name': '天荒地老',
                'value': 1011.29
            } ],
        'date': '2019-06-03-1'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3565.86
            },

            {
                'name': '一起幸福一起飞',
                'value': 2798.21
            },

            {
                'name': '超级联盟',
                'value': 2535.84
            },

            {
                'name': '动力火车',
                'value': 2380.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1874.04
            },

            {
                'name': '一起爱',
                'value': 1608.86
            },

            {
                'name': '天荒地老',
                'value': 1011.29
            } ],
        'date': '2019-06-03-2'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3565.86
            },

            {
                'name': '一起幸福一起飞',
                'value': 2798.21
            },

            {
                'name': '超级联盟',
                'value': 2535.84
            },

            {
                'name': '动力火车',
                'value': 2380.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1874.04
            },

            {
                'name': '一起爱',
                'value': 1608.86
            },

            {
                'name': '天荒地老',
                'value': 1011.29
            } ],
        'date': '2019-06-03-3'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3565.86
            },

            {
                'name': '一起幸福一起飞',
                'value': 2798.21
            },

            {
                'name': '超级联盟',
                'value': 2535.84
            },

            {
                'name': '动力火车',
                'value': 2380.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1874.04
            },

            {
                'name': '一起爱',
                'value': 1608.86
            },

            {
                'name': '天荒地老',
                'value': 1011.29
            } ],
        'date': '2019-06-03-4'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3565.86
            },

            {
                'name': '一起幸福一起飞',
                'value': 2798.21
            },

            {
                'name': '超级联盟',
                'value': 2535.84
            },

            {
                'name': '动力火车',
                'value': 2380.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1874.04
            },

            {
                'name': '一起爱',
                'value': 1608.86
            },

            {
                'name': '天荒地老',
                'value': 1011.29
            } ],
        'date': '2019-06-03-5'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3565.86
            },

            {
                'name': '一起幸福一起飞',
                'value': 2798.21
            },

            {
                'name': '超级联盟',
                'value': 2535.84
            },

            {
                'name': '动力火车',
                'value': 2380.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1874.04
            },

            {
                'name': '一起爱',
                'value': 1608.86
            },

            {
                'name': '天荒地老',
                'value': 1011.29
            } ],
        'date': '2019-06-03-6'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3578.67
            },

            {
                'name': '一起幸福一起飞',
                'value': 2814.73
            },

            {
                'name': '超级联盟',
                'value': 2539.89
            },

            {
                'name': '动力火车',
                'value': 2390.79
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1902.49
            },

            {
                'name': '一起爱',
                'value': 1615.56
            },

            {
                'name': '天荒地老',
                'value': 1011.29
            } ],
        'date': '2019-06-03-7'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3597.92
            },

            {
                'name': '一起幸福一起飞',
                'value': 2842.56
            },

            {
                'name': '超级联盟',
                'value': 2560.45
            },

            {
                'name': '动力火车',
                'value': 2419.95
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1902.49
            },

            {
                'name': '一起爱',
                'value': 1623.57
            },

            {
                'name': '天荒地老',
                'value': 1014.35
            } ],
        'date': '2019-06-03-8'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3607.51
            },

            {
                'name': '一起幸福一起飞',
                'value': 2846.10
            },

            {
                'name': '超级联盟',
                'value': 2562.21
            },

            {
                'name': '动力火车',
                'value': 2429.43
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1918.23
            },

            {
                'name': '一起爱',
                'value': 1639.74
            },

            {
                'name': '天荒地老',
                'value': 1017.16
            } ],
        'date': '2019-06-03-9'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3634.87
            },

            {
                'name': '一起幸福一起飞',
                'value': 2846.77
            },

            {
                'name': '超级联盟',
                'value': 2573.40
            },

            {
                'name': '动力火车',
                'value': 2429.82
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1930.23
            },

            {
                'name': '一起爱',
                'value': 1639.74
            },

            {
                'name': '天荒地老',
                'value': 1017.78
            } ],
        'date': '2019-06-03-10'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3634.87
            },

            {
                'name': '一起幸福一起飞',
                'value': 2846.77
            },

            {
                'name': '超级联盟',
                'value': 2587.29
            },

            {
                'name': '动力火车',
                'value': 2441.82
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1930.23
            },

            {
                'name': '一起爱',
                'value': 1639.74
            },

            {
                'name': '天荒地老',
                'value': 1017.78
            } ],
        'date': '2019-06-03-11'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3642.83
            },

            {
                'name': '一起幸福一起飞',
                'value': 2851.00
            },

            {
                'name': '超级联盟',
                'value': 2587.59
            },

            {
                'name': '动力火车',
                'value': 2441.82
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1930.23
            },

            {
                'name': '一起爱',
                'value': 1639.74
            },

            {
                'name': '天荒地老',
                'value': 1018.53
            } ],
        'date': '2019-06-03-12'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3642.83
            },

            {
                'name': '一起幸福一起飞',
                'value': 2851.00
            },

            {
                'name': '超级联盟',
                'value': 2587.59
            },

            {
                'name': '动力火车',
                'value': 2446.93
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1930.23
            },

            {
                'name': '一起爱',
                'value': 1642.54
            },

            {
                'name': '天荒地老',
                'value': 1031.18
            } ],
        'date': '2019-06-03-13'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3643.11
            },

            {
                'name': '一起幸福一起飞',
                'value': 2857.47
            },

            {
                'name': '超级联盟',
                'value': 2587.59
            },

            {
                'name': '动力火车',
                'value': 2449.71
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1930.52
            },

            {
                'name': '一起爱',
                'value': 1649.00
            },

            {
                'name': '天荒地老',
                'value': 1033.37
            } ],
        'date': '2019-06-03-14'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3644.70
            },

            {
                'name': '一起幸福一起飞',
                'value': 2858.75
            },

            {
                'name': '超级联盟',
                'value': 2587.59
            },

            {
                'name': '动力火车',
                'value': 2450.72
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1930.52
            },

            {
                'name': '一起爱',
                'value': 1649.00
            },

            {
                'name': '天荒地老',
                'value': 1033.37
            } ],
        'date': '2019-06-03-15'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3644.70
            },

            {
                'name': '一起幸福一起飞',
                'value': 2858.75
            },

            {
                'name': '超级联盟',
                'value': 2594.57
            },

            {
                'name': '动力火车',
                'value': 2454.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1930.52
            },

            {
                'name': '一起爱',
                'value': 1649.00
            },

            {
                'name': '天荒地老',
                'value': 1033.37
            } ],
        'date': '2019-06-03-16'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3644.70
            },

            {
                'name': '一起幸福一起飞',
                'value': 2863.56
            },

            {
                'name': '超级联盟',
                'value': 2604.09
            },

            {
                'name': '动力火车',
                'value': 2454.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1930.52
            },

            {
                'name': '一起爱',
                'value': 1652.07
            },

            {
                'name': '天荒地老',
                'value': 1033.37
            } ],
        'date': '2019-06-03-17'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3661.01
            },

            {
                'name': '一起幸福一起飞',
                'value': 2870.75
            },

            {
                'name': '超级联盟',
                'value': 2604.79
            },

            {
                'name': '动力火车',
                'value': 2454.70
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1930.52
            },

            {
                'name': '一起爱',
                'value': 1652.07
            },

            {
                'name': '天荒地老',
                'value': 1033.37
            } ],
        'date': '2019-06-03-18'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3665.61
            },

            {
                'name': '一起幸福一起飞',
                'value': 2872.23
            },

            {
                'name': '超级联盟',
                'value': 2604.79
            },

            {
                'name': '动力火车',
                'value': 2455.63
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1930.52
            },

            {
                'name': '一起爱',
                'value': 1672.40
            },

            {
                'name': '天荒地老',
                'value': 1033.37
            } ],
        'date': '2019-06-03-19'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3681.94
            },

            {
                'name': '一起幸福一起飞',
                'value': 2882.62
            },

            {
                'name': '超级联盟',
                'value': 2604.79
            },

            {
                'name': '动力火车',
                'value': 2460.95
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1937.16
            },

            {
                'name': '一起爱',
                'value': 1682.48
            },

            {
                'name': '天荒地老',
                'value': 1033.37
            } ],
        'date': '2019-06-03-20'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3689.30
            },

            {
                'name': '一起幸福一起飞',
                'value': 2908.86
            },

            {
                'name': '超级联盟',
                'value': 2611.52
            },

            {
                'name': '动力火车',
                'value': 2487.10
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1945.29
            },

            {
                'name': '一起爱',
                'value': 1689.06
            },

            {
                'name': '天荒地老',
                'value': 1038.38
            } ],
        'date': '2019-06-03-21'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3710.61
            },

            {
                'name': '一起幸福一起飞',
                'value': 2917.95
            },

            {
                'name': '超级联盟',
                'value': 2625.12
            },

            {
                'name': '动力火车',
                'value': 2509.95
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1957.34
            },

            {
                'name': '一起爱',
                'value': 1696.45
            },

            {
                'name': '天荒地老',
                'value': 1039.37
            } ],
        'date': '2019-06-03-22'
    },

    {
        'category': '2019-06-03',
        'data': [

            {
                'name': '行者无畏',
                'value': 3733.62
            },

            {
                'name': '一起幸福一起飞',
                'value': 2918.33
            },

            {
                'name': '超级联盟',
                'value': 2638.84
            },

            {
                'name': '动力火车',
                'value': 2509.95
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1976.92
            },

            {
                'name': '一起爱',
                'value': 1696.45
            },

            {
                'name': '天荒地老',
                'value': 1044.40
            } ],
        'date': '2019-06-03-23'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3733.62
            },

            {
                'name': '一起幸福一起飞',
                'value': 2922.04
            },

            {
                'name': '超级联盟',
                'value': 2638.96
            },

            {
                'name': '动力火车',
                'value': 2512.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1976.92
            },

            {
                'name': '一起爱',
                'value': 1699.12
            },

            {
                'name': '天荒地老',
                'value': 1044.61
            } ],
        'date': '2019-06-04-0'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3733.62
            },

            {
                'name': '一起幸福一起飞',
                'value': 2922.04
            },

            {
                'name': '超级联盟',
                'value': 2643.70
            },

            {
                'name': '动力火车',
                'value': 2512.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1976.92
            },

            {
                'name': '一起爱',
                'value': 1699.12
            },

            {
                'name': '天荒地老',
                'value': 1044.61
            } ],
        'date': '2019-06-04-1'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3733.62
            },

            {
                'name': '一起幸福一起飞',
                'value': 2922.04
            },

            {
                'name': '超级联盟',
                'value': 2643.70
            },

            {
                'name': '动力火车',
                'value': 2512.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1977.26
            },

            {
                'name': '一起爱',
                'value': 1699.12
            },

            {
                'name': '天荒地老',
                'value': 1044.61
            } ],
        'date': '2019-06-04-2'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3733.62
            },

            {
                'name': '一起幸福一起飞',
                'value': 2922.04
            },

            {
                'name': '超级联盟',
                'value': 2643.70
            },

            {
                'name': '动力火车',
                'value': 2512.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1977.26
            },

            {
                'name': '一起爱',
                'value': 1699.12
            },

            {
                'name': '天荒地老',
                'value': 1044.61
            } ],
        'date': '2019-06-04-3'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3733.62
            },

            {
                'name': '一起幸福一起飞',
                'value': 2922.04
            },

            {
                'name': '超级联盟',
                'value': 2647.41
            },

            {
                'name': '动力火车',
                'value': 2512.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1977.26
            },

            {
                'name': '一起爱',
                'value': 1699.12
            },

            {
                'name': '天荒地老',
                'value': 1044.61
            } ],
        'date': '2019-06-04-4'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3733.62
            },

            {
                'name': '一起幸福一起飞',
                'value': 2922.04
            },

            {
                'name': '超级联盟',
                'value': 2647.41
            },

            {
                'name': '动力火车',
                'value': 2512.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1977.26
            },

            {
                'name': '一起爱',
                'value': 1699.12
            },

            {
                'name': '天荒地老',
                'value': 1044.61
            } ],
        'date': '2019-06-04-5'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3733.62
            },

            {
                'name': '一起幸福一起飞',
                'value': 2922.04
            },

            {
                'name': '超级联盟',
                'value': 2647.41
            },

            {
                'name': '动力火车',
                'value': 2512.86
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1979.86
            },

            {
                'name': '一起爱',
                'value': 1699.12
            },

            {
                'name': '天荒地老',
                'value': 1044.61
            } ],
        'date': '2019-06-04-6'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3755.91
            },

            {
                'name': '一起幸福一起飞',
                'value': 2945.54
            },

            {
                'name': '超级联盟',
                'value': 2656.08
            },

            {
                'name': '动力火车',
                'value': 2526.38
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1995.41
            },

            {
                'name': '一起爱',
                'value': 1709.67
            },

            {
                'name': '天荒地老',
                'value': 1055.12
            } ],
        'date': '2019-06-04-7'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3794.75
            },

            {
                'name': '一起幸福一起飞',
                'value': 2996.58
            },

            {
                'name': '超级联盟',
                'value': 2670.03
            },

            {
                'name': '动力火车',
                'value': 2542.84
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 1999.24
            },

            {
                'name': '一起爱',
                'value': 1737.22
            },

            {
                'name': '天荒地老',
                'value': 1070.94
            } ],
        'date': '2019-06-04-8'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3831.19
            },

            {
                'name': '一起幸福一起飞',
                'value': 3011.97
            },

            {
                'name': '超级联盟',
                'value': 2711.59
            },

            {
                'name': '动力火车',
                'value': 2584.98
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2038.04
            },

            {
                'name': '一起爱',
                'value': 1751.90
            },

            {
                'name': '天荒地老',
                'value': 1071.98
            } ],
        'date': '2019-06-04-9'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3843.65
            },

            {
                'name': '一起幸福一起飞',
                'value': 3016.53
            },

            {
                'name': '超级联盟',
                'value': 2711.59
            },

            {
                'name': '动力火车',
                'value': 2589.49
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2054.93
            },

            {
                'name': '一起爱',
                'value': 1755.55
            },

            {
                'name': '天荒地老',
                'value': 1072.42
            } ],
        'date': '2019-06-04-10'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3844.12
            },

            {
                'name': '一起幸福一起飞',
                'value': 3016.53
            },

            {
                'name': '超级联盟',
                'value': 2711.59
            },

            {
                'name': '动力火车',
                'value': 2590.18
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2056.09
            },

            {
                'name': '一起爱',
                'value': 1755.55
            },

            {
                'name': '天荒地老',
                'value': 1072.42
            } ],
        'date': '2019-06-04-11'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3845.71
            },

            {
                'name': '一起幸福一起飞',
                'value': 3017.86
            },

            {
                'name': '超级联盟',
                'value': 2731.59
            },

            {
                'name': '动力火车',
                'value': 2590.18
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2056.09
            },

            {
                'name': '一起爱',
                'value': 1755.55
            },

            {
                'name': '天荒地老',
                'value': 1072.42
            } ],
        'date': '2019-06-04-12'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3853.01
            },

            {
                'name': '一起幸福一起飞',
                'value': 3038.59
            },

            {
                'name': '超级联盟',
                'value': 2731.59
            },

            {
                'name': '动力火车',
                'value': 2592.15
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2062.25
            },

            {
                'name': '一起爱',
                'value': 1755.55
            },

            {
                'name': '天荒地老',
                'value': 1072.42
            } ],
        'date': '2019-06-04-13'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3856.26
            },

            {
                'name': '一起幸福一起飞',
                'value': 3038.59
            },

            {
                'name': '超级联盟',
                'value': 2731.59
            },

            {
                'name': '动力火车',
                'value': 2595.20
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2064.97
            },

            {
                'name': '一起爱',
                'value': 1756.57
            },

            {
                'name': '天荒地老',
                'value': 1074.44
            } ],
        'date': '2019-06-04-14'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3871.25
            },

            {
                'name': '一起幸福一起飞',
                'value': 3040.21
            },

            {
                'name': '超级联盟',
                'value': 2731.59
            },

            {
                'name': '动力火车',
                'value': 2595.20
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2072.53
            },

            {
                'name': '一起爱',
                'value': 1756.57
            },

            {
                'name': '天荒地老',
                'value': 1074.44
            } ],
        'date': '2019-06-04-15'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3874.12
            },

            {
                'name': '一起幸福一起飞',
                'value': 3042.22
            },

            {
                'name': '超级联盟',
                'value': 2734.01
            },

            {
                'name': '动力火车',
                'value': 2595.20
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2072.53
            },

            {
                'name': '一起爱',
                'value': 1757.49
            },

            {
                'name': '天荒地老',
                'value': 1074.44
            } ],
        'date': '2019-06-04-16'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3877.66
            },

            {
                'name': '一起幸福一起飞',
                'value': 3042.22
            },

            {
                'name': '超级联盟',
                'value': 2761.41
            },

            {
                'name': '动力火车',
                'value': 2598.36
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2072.53
            },

            {
                'name': '一起爱',
                'value': 1760.49
            },

            {
                'name': '天荒地老',
                'value': 1074.44
            } ],
        'date': '2019-06-04-17'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3880.16
            },

            {
                'name': '一起幸福一起飞',
                'value': 3058.42
            },

            {
                'name': '超级联盟',
                'value': 2761.41
            },

            {
                'name': '动力火车',
                'value': 2598.73
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2072.53
            },

            {
                'name': '一起爱',
                'value': 1760.49
            },

            {
                'name': '天荒地老',
                'value': 1074.44
            } ],
        'date': '2019-06-04-18'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3885.13
            },

            {
                'name': '一起幸福一起飞',
                'value': 3073.50
            },

            {
                'name': '超级联盟',
                'value': 2765.41
            },

            {
                'name': '动力火车',
                'value': 2604.77
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2072.53
            },

            {
                'name': '一起爱',
                'value': 1760.49
            },

            {
                'name': '天荒地老',
                'value': 1074.81
            } ],
        'date': '2019-06-04-19'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3892.85
            },

            {
                'name': '一起幸福一起飞',
                'value': 3086.27
            },

            {
                'name': '超级联盟',
                'value': 2766.20
            },

            {
                'name': '动力火车',
                'value': 2611.77
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2075.54
            },

            {
                'name': '一起爱',
                'value': 1760.49
            },

            {
                'name': '天荒地老',
                'value': 1093.58
            } ],
        'date': '2019-06-04-20'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3910.15
            },

            {
                'name': '一起幸福一起飞',
                'value': 3091.44
            },

            {
                'name': '超级联盟',
                'value': 2783.37
            },

            {
                'name': '动力火车',
                'value': 2634.50
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2075.54
            },

            {
                'name': '一起爱',
                'value': 1770.53
            },

            {
                'name': '天荒地老',
                'value': 1093.58
            } ],
        'date': '2019-06-04-21'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3920.40
            },

            {
                'name': '一起幸福一起飞',
                'value': 3092.60
            },

            {
                'name': '超级联盟',
                'value': 2786.50
            },

            {
                'name': '动力火车',
                'value': 2637.18
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2075.54
            },

            {
                'name': '一起爱',
                'value': 1775.44
            },

            {
                'name': '天荒地老',
                'value': 1104.25
            } ],
        'date': '2019-06-04-22'
    },

    {
        'category': '2019-06-04',
        'data': [

            {
                'name': '行者无畏',
                'value': 3933.81
            },

            {
                'name': '一起幸福一起飞',
                'value': 3092.60
            },

            {
                'name': '超级联盟',
                'value': 2790.53
            },

            {
                'name': '动力火车',
                'value': 2646.96
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2085.55
            },

            {
                'name': '一起爱',
                'value': 1797.76
            },

            {
                'name': '天荒地老',
                'value': 1113.21
            } ],
        'date': '2019-06-04-23'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 3934.91
            },

            {
                'name': '一起幸福一起飞',
                'value': 3097.20
            },

            {
                'name': '超级联盟',
                'value': 2790.53
            },

            {
                'name': '动力火车',
                'value': 2650.95
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2085.55
            },

            {
                'name': '一起爱',
                'value': 1797.76
            },

            {
                'name': '天荒地老',
                'value': 1113.21
            } ],
        'date': '2019-06-05-0'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 3934.91
            },

            {
                'name': '一起幸福一起飞',
                'value': 3099.80
            },

            {
                'name': '超级联盟',
                'value': 2790.53
            },

            {
                'name': '动力火车',
                'value': 2650.95
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2085.55
            },

            {
                'name': '一起爱',
                'value': 1797.76
            },

            {
                'name': '天荒地老',
                'value': 1113.21
            } ],
        'date': '2019-06-05-1'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 3934.91
            },

            {
                'name': '一起幸福一起飞',
                'value': 3099.80
            },

            {
                'name': '超级联盟',
                'value': 2790.53
            },

            {
                'name': '动力火车',
                'value': 2650.95
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2085.55
            },

            {
                'name': '一起爱',
                'value': 1797.76
            },

            {
                'name': '天荒地老',
                'value': 1113.21
            } ],
        'date': '2019-06-05-2'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 3934.91
            },

            {
                'name': '一起幸福一起飞',
                'value': 3099.80
            },

            {
                'name': '超级联盟',
                'value': 2791.73
            },

            {
                'name': '动力火车',
                'value': 2650.95
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2085.55
            },

            {
                'name': '一起爱',
                'value': 1797.76
            },

            {
                'name': '天荒地老',
                'value': 1113.21
            } ],
        'date': '2019-06-05-3'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 3934.91
            },

            {
                'name': '一起幸福一起飞',
                'value': 3099.80
            },

            {
                'name': '超级联盟',
                'value': 2796.77
            },

            {
                'name': '动力火车',
                'value': 2650.95
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2085.55
            },

            {
                'name': '一起爱',
                'value': 1797.76
            },

            {
                'name': '天荒地老',
                'value': 1113.21
            } ],
        'date': '2019-06-05-4'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 3934.91
            },

            {
                'name': '一起幸福一起飞',
                'value': 3099.80
            },

            {
                'name': '超级联盟',
                'value': 2796.77
            },

            {
                'name': '动力火车',
                'value': 2650.95
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2085.55
            },

            {
                'name': '一起爱',
                'value': 1797.76
            },

            {
                'name': '天荒地老',
                'value': 1113.21
            } ],
        'date': '2019-06-05-5'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 3937.92
            },

            {
                'name': '一起幸福一起飞',
                'value': 3099.80
            },

            {
                'name': '超级联盟',
                'value': 2796.77
            },

            {
                'name': '动力火车',
                'value': 2650.95
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2085.55
            },

            {
                'name': '一起爱',
                'value': 1797.76
            },

            {
                'name': '天荒地老',
                'value': 1113.21
            } ],
        'date': '2019-06-05-6'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 3944.86
            },

            {
                'name': '一起幸福一起飞',
                'value': 3122.47
            },

            {
                'name': '超级联盟',
                'value': 2796.77
            },

            {
                'name': '动力火车',
                'value': 2678.07
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2092.56
            },

            {
                'name': '一起爱',
                'value': 1812.91
            },

            {
                'name': '天荒地老',
                'value': 1129.23
            } ],
        'date': '2019-06-05-7'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 3968.63
            },

            {
                'name': '一起幸福一起飞',
                'value': 3175.29
            },

            {
                'name': '超级联盟',
                'value': 2811.91
            },

            {
                'name': '动力火车',
                'value': 2684.95
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2104.56
            },

            {
                'name': '一起爱',
                'value': 1826.20
            },

            {
                'name': '天荒地老',
                'value': 1132.58
            } ],
        'date': '2019-06-05-8'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 3975.90
            },

            {
                'name': '一起幸福一起飞',
                'value': 3183.05
            },

            {
                'name': '超级联盟',
                'value': 2816.31
            },

            {
                'name': '动力火车',
                'value': 2715.68
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2115.94
            },

            {
                'name': '一起爱',
                'value': 1846.59
            },

            {
                'name': '天荒地老',
                'value': 1133.75
            } ],
        'date': '2019-06-05-9'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 3976.46
            },

            {
                'name': '一起幸福一起飞',
                'value': 3187.55
            },

            {
                'name': '超级联盟',
                'value': 2816.31
            },

            {
                'name': '动力火车',
                'value': 2728.16
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2115.94
            },

            {
                'name': '一起爱',
                'value': 1847.51
            },

            {
                'name': '天荒地老',
                'value': 1133.75
            } ],
        'date': '2019-06-05-10'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 3989.92
            },

            {
                'name': '一起幸福一起飞',
                'value': 3187.55
            },

            {
                'name': '超级联盟',
                'value': 2816.31
            },

            {
                'name': '动力火车',
                'value': 2731.82
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2125.95
            },

            {
                'name': '一起爱',
                'value': 1847.51
            },

            {
                'name': '天荒地老',
                'value': 1133.75
            } ],
        'date': '2019-06-05-11'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 3991.09
            },

            {
                'name': '一起幸福一起飞',
                'value': 3187.55
            },

            {
                'name': '超级联盟',
                'value': 2816.31
            },

            {
                'name': '动力火车',
                'value': 2733.12
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2125.95
            },

            {
                'name': '一起爱',
                'value': 1847.51
            },

            {
                'name': '天荒地老',
                'value': 1145.75
            } ],
        'date': '2019-06-05-12'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 3994.56
            },

            {
                'name': '一起幸福一起飞',
                'value': 3193.12
            },

            {
                'name': '超级联盟',
                'value': 2830.03
            },

            {
                'name': '动力火车',
                'value': 2737.74
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2125.95
            },

            {
                'name': '一起爱',
                'value': 1847.51
            },

            {
                'name': '天荒地老',
                'value': 1145.75
            } ],
        'date': '2019-06-05-13'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 3996.33
            },

            {
                'name': '一起幸福一起飞',
                'value': 3224.67
            },

            {
                'name': '超级联盟',
                'value': 2830.03
            },

            {
                'name': '动力火车',
                'value': 2737.74
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2125.95
            },

            {
                'name': '一起爱',
                'value': 1855.87
            },

            {
                'name': '天荒地老',
                'value': 1148.06
            } ],
        'date': '2019-06-05-14'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 4003.39
            },

            {
                'name': '一起幸福一起飞',
                'value': 3225.67
            },

            {
                'name': '超级联盟',
                'value': 2830.03
            },

            {
                'name': '动力火车',
                'value': 2739.48
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2125.95
            },

            {
                'name': '一起爱',
                'value': 1855.87
            },

            {
                'name': '天荒地老',
                'value': 1149.71
            } ],
        'date': '2019-06-05-15'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 4005.42
            },

            {
                'name': '一起幸福一起飞',
                'value': 3226.32
            },

            {
                'name': '超级联盟',
                'value': 2830.11
            },

            {
                'name': '动力火车',
                'value': 2745.93
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2125.95
            },

            {
                'name': '一起爱',
                'value': 1855.87
            },

            {
                'name': '天荒地老',
                'value': 1151.23
            } ],
        'date': '2019-06-05-16'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 4006.28
            },

            {
                'name': '一起幸福一起飞',
                'value': 3226.32
            },

            {
                'name': '超级联盟',
                'value': 2837.52
            },

            {
                'name': '动力火车',
                'value': 2745.93
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2125.95
            },

            {
                'name': '一起爱',
                'value': 1867.18
            },

            {
                'name': '天荒地老',
                'value': 1151.23
            } ],
        'date': '2019-06-05-17'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 4021.94
            },

            {
                'name': '一起幸福一起飞',
                'value': 3231.87
            },

            {
                'name': '超级联盟',
                'value': 2837.52
            },

            {
                'name': '动力火车',
                'value': 2746.21
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2126.46
            },

            {
                'name': '一起爱',
                'value': 1876.46
            },

            {
                'name': '天荒地老',
                'value': 1153.98
            } ],
        'date': '2019-06-05-18'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 4025.21
            },

            {
                'name': '一起幸福一起飞',
                'value': 3233.92
            },

            {
                'name': '超级联盟',
                'value': 2837.52
            },

            {
                'name': '动力火车',
                'value': 2751.22
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2132.26
            },

            {
                'name': '一起爱',
                'value': 1879.39
            },

            {
                'name': '天荒地老',
                'value': 1153.98
            } ],
        'date': '2019-06-05-19'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 4027.67
            },

            {
                'name': '一起幸福一起飞',
                'value': 3235.85
            },

            {
                'name': '超级联盟',
                'value': 2837.52
            },

            {
                'name': '动力火车',
                'value': 2758.56
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2139.29
            },

            {
                'name': '一起爱',
                'value': 1880.85
            },

            {
                'name': '天荒地老',
                'value': 1157.88
            } ],
        'date': '2019-06-05-20'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 4042.86
            },

            {
                'name': '一起幸福一起飞',
                'value': 3238.98
            },

            {
                'name': '超级联盟',
                'value': 2846.56
            },

            {
                'name': '动力火车',
                'value': 2766.55
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2141.28
            },

            {
                'name': '一起爱',
                'value': 1893.38
            },

            {
                'name': '天荒地老',
                'value': 1157.97
            } ],
        'date': '2019-06-05-21'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 4063.92
            },

            {
                'name': '一起幸福一起飞',
                'value': 3267.22
            },

            {
                'name': '超级联盟',
                'value': 2846.56
            },

            {
                'name': '动力火车',
                'value': 2773.12
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2141.28
            },

            {
                'name': '一起爱',
                'value': 1893.57
            },

            {
                'name': '天荒地老',
                'value': 1158.82
            } ],
        'date': '2019-06-05-22'
    },

    {
        'category': '2019-06-05',
        'data': [

            {
                'name': '行者无畏',
                'value': 4070.89
            },

            {
                'name': '一起幸福一起飞',
                'value': 3271.07
            },

            {
                'name': '超级联盟',
                'value': 2846.56
            },

            {
                'name': '动力火车',
                'value': 2778.22
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2141.28
            },

            {
                'name': '一起爱',
                'value': 1893.57
            },

            {
                'name': '天荒地老',
                'value': 1162.95
            } ],
        'date': '2019-06-05-23'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4073.84
            },

            {
                'name': '一起幸福一起飞',
                'value': 3281.41
            },

            {
                'name': '超级联盟',
                'value': 2846.56
            },

            {
                'name': '动力火车',
                'value': 2779.43
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2141.28
            },

            {
                'name': '一起爱',
                'value': 1893.57
            },

            {
                'name': '天荒地老',
                'value': 1162.95
            } ],
        'date': '2019-06-06-0'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4073.84
            },

            {
                'name': '一起幸福一起飞',
                'value': 3281.41
            },

            {
                'name': '超级联盟',
                'value': 2846.56
            },

            {
                'name': '动力火车',
                'value': 2779.43
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2141.28
            },

            {
                'name': '一起爱',
                'value': 1893.57
            },

            {
                'name': '天荒地老',
                'value': 1162.95
            } ],
        'date': '2019-06-06-1'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4073.84
            },

            {
                'name': '一起幸福一起飞',
                'value': 3281.41
            },

            {
                'name': '超级联盟',
                'value': 2846.56
            },

            {
                'name': '动力火车',
                'value': 2779.43
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2141.28
            },

            {
                'name': '一起爱',
                'value': 1893.57
            },

            {
                'name': '天荒地老',
                'value': 1162.95
            } ],
        'date': '2019-06-06-2'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4073.84
            },

            {
                'name': '一起幸福一起飞',
                'value': 3281.41
            },

            {
                'name': '超级联盟',
                'value': 2846.56
            },

            {
                'name': '动力火车',
                'value': 2779.43
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2141.28
            },

            {
                'name': '一起爱',
                'value': 1893.57
            },

            {
                'name': '天荒地老',
                'value': 1162.95
            } ],
        'date': '2019-06-06-3'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4073.84
            },

            {
                'name': '一起幸福一起飞',
                'value': 3281.41
            },

            {
                'name': '超级联盟',
                'value': 2846.56
            },

            {
                'name': '动力火车',
                'value': 2779.43
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2141.28
            },

            {
                'name': '一起爱',
                'value': 1893.57
            },

            {
                'name': '天荒地老',
                'value': 1162.95
            } ],
        'date': '2019-06-06-4'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4073.84
            },

            {
                'name': '一起幸福一起飞',
                'value': 3281.41
            },

            {
                'name': '超级联盟',
                'value': 2847.59
            },

            {
                'name': '动力火车',
                'value': 2779.43
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2141.28
            },

            {
                'name': '一起爱',
                'value': 1893.57
            },

            {
                'name': '天荒地老',
                'value': 1162.95
            } ],
        'date': '2019-06-06-5'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4073.84
            },

            {
                'name': '一起幸福一起飞',
                'value': 3287.45
            },

            {
                'name': '超级联盟',
                'value': 2847.59
            },

            {
                'name': '动力火车',
                'value': 2779.43
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2144.31
            },

            {
                'name': '一起爱',
                'value': 1893.57
            },

            {
                'name': '天荒地老',
                'value': 1162.95
            } ],
        'date': '2019-06-06-6'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4073.84
            },

            {
                'name': '一起幸福一起飞',
                'value': 3312.23
            },

            {
                'name': '超级联盟',
                'value': 2847.59
            },

            {
                'name': '动力火车',
                'value': 2783.07
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2150.31
            },

            {
                'name': '一起爱',
                'value': 1901.65
            },

            {
                'name': '天荒地老',
                'value': 1162.95
            } ],
        'date': '2019-06-06-7'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4095.61
            },

            {
                'name': '一起幸福一起飞',
                'value': 3341.80
            },

            {
                'name': '超级联盟',
                'value': 2854.18
            },

            {
                'name': '动力火车',
                'value': 2795.39
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2184.90
            },

            {
                'name': '一起爱',
                'value': 1904.13
            },

            {
                'name': '天荒地老',
                'value': 1182.07
            } ],
        'date': '2019-06-06-8'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4119.59
            },

            {
                'name': '一起幸福一起飞',
                'value': 3352.09
            },

            {
                'name': '超级联盟',
                'value': 2863.58
            },

            {
                'name': '动力火车',
                'value': 2832.46
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2192.11
            },

            {
                'name': '一起爱',
                'value': 1906.50
            },

            {
                'name': '天荒地老',
                'value': 1182.87
            } ],
        'date': '2019-06-06-9'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4122.39
            },

            {
                'name': '一起幸福一起飞',
                'value': 3353.43
            },

            {
                'name': '超级联盟',
                'value': 2863.58
            },

            {
                'name': '动力火车',
                'value': 2833.30
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2192.11
            },

            {
                'name': '一起爱',
                'value': 1906.86
            },

            {
                'name': '天荒地老',
                'value': 1182.87
            } ],
        'date': '2019-06-06-10'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4122.67
            },

            {
                'name': '一起幸福一起飞',
                'value': 3354.05
            },

            {
                'name': '超级联盟',
                'value': 2863.58
            },

            {
                'name': '动力火车',
                'value': 2845.94
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2192.11
            },

            {
                'name': '一起爱',
                'value': 1907.28
            },

            {
                'name': '天荒地老',
                'value': 1182.87
            } ],
        'date': '2019-06-06-11'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4126.52
            },

            {
                'name': '一起幸福一起飞',
                'value': 3354.05
            },

            {
                'name': '超级联盟',
                'value': 2863.58
            },

            {
                'name': '动力火车',
                'value': 2849.80
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2192.11
            },

            {
                'name': '一起爱',
                'value': 1907.28
            },

            {
                'name': '天荒地老',
                'value': 1182.87
            } ],
        'date': '2019-06-06-12'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4138.39
            },

            {
                'name': '一起幸福一起飞',
                'value': 3354.70
            },

            {
                'name': '超级联盟',
                'value': 2863.58
            },

            {
                'name': '动力火车',
                'value': 2851.12
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2192.11
            },

            {
                'name': '一起爱',
                'value': 1909.78
            },

            {
                'name': '天荒地老',
                'value': 1183.53
            } ],
        'date': '2019-06-06-13'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4138.91
            },

            {
                'name': '一起幸福一起飞',
                'value': 3355.97
            },

            {
                'name': '超级联盟',
                'value': 2880.62
            },

            {
                'name': '动力火车',
                'value': 2851.47
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2198.40
            },

            {
                'name': '一起爱',
                'value': 1909.78
            },

            {
                'name': '天荒地老',
                'value': 1185.58
            } ],
        'date': '2019-06-06-14'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4141.33
            },

            {
                'name': '一起幸福一起飞',
                'value': 3355.97
            },

            {
                'name': '超级联盟',
                'value': 2880.62
            },

            {
                'name': '动力火车',
                'value': 2851.47
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2198.40
            },

            {
                'name': '一起爱',
                'value': 1911.26
            },

            {
                'name': '天荒地老',
                'value': 1185.58
            } ],
        'date': '2019-06-06-15'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4141.33
            },

            {
                'name': '一起幸福一起飞',
                'value': 3356.63
            },

            {
                'name': '超级联盟',
                'value': 2890.75
            },

            {
                'name': '动力火车',
                'value': 2851.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2198.40
            },

            {
                'name': '一起爱',
                'value': 1911.26
            },

            {
                'name': '天荒地老',
                'value': 1185.58
            } ],
        'date': '2019-06-06-16'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4141.33
            },

            {
                'name': '一起幸福一起飞',
                'value': 3356.63
            },

            {
                'name': '超级联盟',
                'value': 2898.32
            },

            {
                'name': '动力火车',
                'value': 2851.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2198.40
            },

            {
                'name': '一起爱',
                'value': 1912.88
            },

            {
                'name': '天荒地老',
                'value': 1185.58
            } ],
        'date': '2019-06-06-17'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4148.90
            },

            {
                'name': '一起幸福一起飞',
                'value': 3356.98
            },

            {
                'name': '超级联盟',
                'value': 2898.32
            },

            {
                'name': '动力火车',
                'value': 2851.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2198.40
            },

            {
                'name': '一起爱',
                'value': 1918.89
            },

            {
                'name': '天荒地老',
                'value': 1185.58
            } ],
        'date': '2019-06-06-18'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4170.28
            },

            {
                'name': '一起幸福一起飞',
                'value': 3358.25
            },

            {
                'name': '超级联盟',
                'value': 2905.85
            },

            {
                'name': '动力火车',
                'value': 2856.42
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2198.40
            },

            {
                'name': '一起爱',
                'value': 1919.77
            },

            {
                'name': '天荒地老',
                'value': 1185.58
            } ],
        'date': '2019-06-06-19'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4171.40
            },

            {
                'name': '一起幸福一起飞',
                'value': 3370.25
            },

            {
                'name': '超级联盟',
                'value': 2905.85
            },

            {
                'name': '动力火车',
                'value': 2856.42
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2198.40
            },

            {
                'name': '一起爱',
                'value': 1921.66
            },

            {
                'name': '天荒地老',
                'value': 1187.01
            } ],
        'date': '2019-06-06-20'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4181.48
            },

            {
                'name': '一起幸福一起飞',
                'value': 3372.10
            },

            {
                'name': '超级联盟',
                'value': 2905.85
            },

            {
                'name': '动力火车',
                'value': 2856.80
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2198.40
            },

            {
                'name': '一起爱',
                'value': 1927.68
            },

            {
                'name': '天荒地老',
                'value': 1199.01
            } ],
        'date': '2019-06-06-21'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4201.15
            },

            {
                'name': '一起幸福一起飞',
                'value': 3373.52
            },

            {
                'name': '超级联盟',
                'value': 2908.32
            },

            {
                'name': '动力火车',
                'value': 2863.41
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2208.47
            },

            {
                'name': '一起爱',
                'value': 1927.68
            },

            {
                'name': '天荒地老',
                'value': 1199.01
            } ],
        'date': '2019-06-06-22'
    },

    {
        'category': '2019-06-06',
        'data': [

            {
                'name': '行者无畏',
                'value': 4215.91
            },

            {
                'name': '一起幸福一起飞',
                'value': 3373.52
            },

            {
                'name': '超级联盟',
                'value': 2908.32
            },

            {
                'name': '动力火车',
                'value': 2864.64
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2208.47
            },

            {
                'name': '一起爱',
                'value': 1927.68
            },

            {
                'name': '天荒地老',
                'value': 1199.87
            } ],
        'date': '2019-06-06-23'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4224.02
            },

            {
                'name': '一起幸福一起飞',
                'value': 3390.13
            },

            {
                'name': '超级联盟',
                'value': 2922.11
            },

            {
                'name': '动力火车',
                'value': 2864.64
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2208.47
            },

            {
                'name': '一起爱',
                'value': 1927.68
            },

            {
                'name': '天荒地老',
                'value': 1199.87
            } ],
        'date': '2019-06-07-0'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4224.40
            },

            {
                'name': '一起幸福一起飞',
                'value': 3390.13
            },

            {
                'name': '超级联盟',
                'value': 2922.11
            },

            {
                'name': '动力火车',
                'value': 2864.64
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2208.47
            },

            {
                'name': '一起爱',
                'value': 1927.68
            },

            {
                'name': '天荒地老',
                'value': 1199.87
            } ],
        'date': '2019-06-07-1'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4224.40
            },

            {
                'name': '一起幸福一起飞',
                'value': 3390.13
            },

            {
                'name': '超级联盟',
                'value': 2922.11
            },

            {
                'name': '动力火车',
                'value': 2864.64
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2208.47
            },

            {
                'name': '一起爱',
                'value': 1927.68
            },

            {
                'name': '天荒地老',
                'value': 1199.87
            } ],
        'date': '2019-06-07-2'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4224.40
            },

            {
                'name': '一起幸福一起飞',
                'value': 3390.13
            },

            {
                'name': '超级联盟',
                'value': 2922.11
            },

            {
                'name': '动力火车',
                'value': 2864.64
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2208.47
            },

            {
                'name': '一起爱',
                'value': 1927.68
            },

            {
                'name': '天荒地老',
                'value': 1199.87
            } ],
        'date': '2019-06-07-3'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4224.40
            },

            {
                'name': '一起幸福一起飞',
                'value': 3390.13
            },

            {
                'name': '超级联盟',
                'value': 2922.11
            },

            {
                'name': '动力火车',
                'value': 2864.64
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2208.47
            },

            {
                'name': '一起爱',
                'value': 1927.68
            },

            {
                'name': '天荒地老',
                'value': 1199.87
            } ],
        'date': '2019-06-07-4'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4224.40
            },

            {
                'name': '一起幸福一起飞',
                'value': 3390.13
            },

            {
                'name': '超级联盟',
                'value': 2924.03
            },

            {
                'name': '动力火车',
                'value': 2864.64
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2208.47
            },

            {
                'name': '一起爱',
                'value': 1927.68
            },

            {
                'name': '天荒地老',
                'value': 1199.87
            } ],
        'date': '2019-06-07-5'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4224.40
            },

            {
                'name': '一起幸福一起飞',
                'value': 3390.13
            },

            {
                'name': '超级联盟',
                'value': 2924.03
            },

            {
                'name': '动力火车',
                'value': 2864.64
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2208.47
            },

            {
                'name': '一起爱',
                'value': 1927.68
            },

            {
                'name': '天荒地老',
                'value': 1199.87
            } ],
        'date': '2019-06-07-6'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4224.40
            },

            {
                'name': '一起幸福一起飞',
                'value': 3390.13
            },

            {
                'name': '超级联盟',
                'value': 2924.03
            },

            {
                'name': '动力火车',
                'value': 2885.37
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2213.54
            },

            {
                'name': '一起爱',
                'value': 1927.68
            },

            {
                'name': '天荒地老',
                'value': 1199.87
            } ],
        'date': '2019-06-07-7'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4241.41
            },

            {
                'name': '一起幸福一起飞',
                'value': 3392.54
            },

            {
                'name': '超级联盟',
                'value': 2955.08
            },

            {
                'name': '动力火车',
                'value': 2914.85
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2274.27
            },

            {
                'name': '一起爱',
                'value': 1936.39
            },

            {
                'name': '天荒地老',
                'value': 1219.87
            } ],
        'date': '2019-06-07-8'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4241.41
            },

            {
                'name': '一起幸福一起飞',
                'value': 3424.67
            },

            {
                'name': '超级联盟',
                'value': 2987.08
            },

            {
                'name': '动力火车',
                'value': 2934.98
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2274.27
            },

            {
                'name': '一起爱',
                'value': 1966.55
            },

            {
                'name': '天荒地老',
                'value': 1240.74
            } ],
        'date': '2019-06-07-9'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4254.96
            },

            {
                'name': '一起幸福一起飞',
                'value': 3430.58
            },

            {
                'name': '超级联盟',
                'value': 2987.08
            },

            {
                'name': '动力火车',
                'value': 2935.72
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2274.27
            },

            {
                'name': '一起爱',
                'value': 1979.75
            },

            {
                'name': '天荒地老',
                'value': 1259.07
            } ],
        'date': '2019-06-07-10'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4263.25
            },

            {
                'name': '一起幸福一起飞',
                'value': 3440.96
            },

            {
                'name': '超级联盟',
                'value': 3002.43
            },

            {
                'name': '动力火车',
                'value': 2947.13
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2274.27
            },

            {
                'name': '一起爱',
                'value': 1979.75
            },

            {
                'name': '天荒地老',
                'value': 1259.07
            } ],
        'date': '2019-06-07-11'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4263.98
            },

            {
                'name': '一起幸福一起飞',
                'value': 3442.55
            },

            {
                'name': '超级联盟',
                'value': 3002.43
            },

            {
                'name': '动力火车',
                'value': 2947.13
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2277.87
            },

            {
                'name': '一起爱',
                'value': 1979.75
            },

            {
                'name': '天荒地老',
                'value': 1259.07
            } ],
        'date': '2019-06-07-12'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4263.98
            },

            {
                'name': '一起幸福一起飞',
                'value': 3443.04
            },

            {
                'name': '超级联盟',
                'value': 3002.43
            },

            {
                'name': '动力火车',
                'value': 2948.02
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2277.87
            },

            {
                'name': '一起爱',
                'value': 1979.75
            },

            {
                'name': '天荒地老',
                'value': 1259.42
            } ],
        'date': '2019-06-07-13'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4268.71
            },

            {
                'name': '一起幸福一起飞',
                'value': 3444.81
            },

            {
                'name': '超级联盟',
                'value': 3007.76
            },

            {
                'name': '动力火车',
                'value': 2948.02
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2277.87
            },

            {
                'name': '一起爱',
                'value': 1979.75
            },

            {
                'name': '天荒地老',
                'value': 1259.42
            } ],
        'date': '2019-06-07-14'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4270.13
            },

            {
                'name': '一起幸福一起飞',
                'value': 3446.81
            },

            {
                'name': '超级联盟',
                'value': 3007.76
            },

            {
                'name': '动力火车',
                'value': 2948.02
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2277.87
            },

            {
                'name': '一起爱',
                'value': 1979.75
            },

            {
                'name': '天荒地老',
                'value': 1259.42
            } ],
        'date': '2019-06-07-15'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4276.92
            },

            {
                'name': '一起幸福一起飞',
                'value': 3449.94
            },

            {
                'name': '超级联盟',
                'value': 3010.76
            },

            {
                'name': '动力火车',
                'value': 2948.02
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2277.87
            },

            {
                'name': '一起爱',
                'value': 1984.77
            },

            {
                'name': '天荒地老',
                'value': 1269.43
            } ],
        'date': '2019-06-07-16'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4277.90
            },

            {
                'name': '一起幸福一起飞',
                'value': 3456.50
            },

            {
                'name': '超级联盟',
                'value': 3011.07
            },

            {
                'name': '动力火车',
                'value': 2960.61
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2277.87
            },

            {
                'name': '一起爱',
                'value': 1985.92
            },

            {
                'name': '天荒地老',
                'value': 1271.14
            } ],
        'date': '2019-06-07-17'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4289.97
            },

            {
                'name': '一起幸福一起飞',
                'value': 3459.32
            },

            {
                'name': '超级联盟',
                'value': 3011.07
            },

            {
                'name': '动力火车',
                'value': 2960.61
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2277.87
            },

            {
                'name': '一起爱',
                'value': 1988.96
            },

            {
                'name': '天荒地老',
                'value': 1271.14
            } ],
        'date': '2019-06-07-18'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4291.39
            },

            {
                'name': '一起幸福一起飞',
                'value': 3460.12
            },

            {
                'name': '超级联盟',
                'value': 3011.07
            },

            {
                'name': '动力火车',
                'value': 2961.88
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2277.87
            },

            {
                'name': '一起爱',
                'value': 1992.02
            },

            {
                'name': '天荒地老',
                'value': 1278.14
            } ],
        'date': '2019-06-07-19'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4309.09
            },

            {
                'name': '一起幸福一起飞',
                'value': 3461.55
            },

            {
                'name': '超级联盟',
                'value': 3019.30
            },

            {
                'name': '动力火车',
                'value': 2973.55
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2287.89
            },

            {
                'name': '一起爱',
                'value': 1992.02
            },

            {
                'name': '天荒地老',
                'value': 1278.14
            } ],
        'date': '2019-06-07-20'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4321.99
            },

            {
                'name': '一起幸福一起飞',
                'value': 3464.66
            },

            {
                'name': '超级联盟',
                'value': 3019.30
            },

            {
                'name': '动力火车',
                'value': 2978.12
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2292.90
            },

            {
                'name': '一起爱',
                'value': 1992.85
            },

            {
                'name': '天荒地老',
                'value': 1278.14
            } ],
        'date': '2019-06-07-21'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4337.12
            },

            {
                'name': '一起幸福一起飞',
                'value': 3466.50
            },

            {
                'name': '超级联盟',
                'value': 3019.30
            },

            {
                'name': '动力火车',
                'value': 2980.45
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2298.15
            },

            {
                'name': '一起爱',
                'value': 1993.72
            },

            {
                'name': '天荒地老',
                'value': 1300.58
            } ],
        'date': '2019-06-07-22'
    },

    {
        'category': '2019-06-07',
        'data': [

            {
                'name': '行者无畏',
                'value': 4342.03
            },

            {
                'name': '一起幸福一起飞',
                'value': 3472.79
            },

            {
                'name': '超级联盟',
                'value': 3034.97
            },

            {
                'name': '动力火车',
                'value': 2982.81
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2303.64
            },

            {
                'name': '一起爱',
                'value': 2001.33
            },

            {
                'name': '天荒地老',
                'value': 1300.58
            } ],
        'date': '2019-06-07-23'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4344.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 3476.68
            },

            {
                'name': '超级联盟',
                'value': 3038.87
            },

            {
                'name': '动力火车',
                'value': 2982.81
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2303.64
            },

            {
                'name': '一起爱',
                'value': 2001.33
            },

            {
                'name': '天荒地老',
                'value': 1306.60
            } ],
        'date': '2019-06-08-0'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4344.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 3482.59
            },

            {
                'name': '超级联盟',
                'value': 3038.87
            },

            {
                'name': '动力火车',
                'value': 2982.81
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2303.64
            },

            {
                'name': '一起爱',
                'value': 2001.33
            },

            {
                'name': '天荒地老',
                'value': 1306.79
            } ],
        'date': '2019-06-08-1'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4344.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 3482.59
            },

            {
                'name': '超级联盟',
                'value': 3038.87
            },

            {
                'name': '动力火车',
                'value': 2982.81
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2303.64
            },

            {
                'name': '一起爱',
                'value': 2001.33
            },

            {
                'name': '天荒地老',
                'value': 1306.79
            } ],
        'date': '2019-06-08-2'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4344.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 3482.59
            },

            {
                'name': '超级联盟',
                'value': 3038.87
            },

            {
                'name': '动力火车',
                'value': 2982.81
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2304.74
            },

            {
                'name': '一起爱',
                'value': 2001.33
            },

            {
                'name': '天荒地老',
                'value': 1306.79
            } ],
        'date': '2019-06-08-3'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4344.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 3482.59
            },

            {
                'name': '超级联盟',
                'value': 3038.87
            },

            {
                'name': '动力火车',
                'value': 2982.81
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2304.74
            },

            {
                'name': '一起爱',
                'value': 2001.33
            },

            {
                'name': '天荒地老',
                'value': 1306.79
            } ],
        'date': '2019-06-08-4'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4344.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 3482.59
            },

            {
                'name': '超级联盟',
                'value': 3038.87
            },

            {
                'name': '动力火车',
                'value': 2982.81
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2304.74
            },

            {
                'name': '一起爱',
                'value': 2001.33
            },

            {
                'name': '天荒地老',
                'value': 1306.79
            } ],
        'date': '2019-06-08-5'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4344.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 3482.59
            },

            {
                'name': '超级联盟',
                'value': 3038.87
            },

            {
                'name': '动力火车',
                'value': 2982.81
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2304.74
            },

            {
                'name': '一起爱',
                'value': 2001.33
            },

            {
                'name': '天荒地老',
                'value': 1306.79
            } ],
        'date': '2019-06-08-6'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4356.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 3496.14
            },

            {
                'name': '超级联盟',
                'value': 3038.87
            },

            {
                'name': '动力火车',
                'value': 3002.81
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2304.74
            },

            {
                'name': '一起爱',
                'value': 2013.38
            },

            {
                'name': '天荒地老',
                'value': 1306.79
            } ],
        'date': '2019-06-08-7'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4376.03
            },

            {
                'name': '一起幸福一起飞',
                'value': 3540.92
            },

            {
                'name': '动力火车',
                'value': 3075.26
            },

            {
                'name': '超级联盟',
                'value': 3061.02
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2342.59
            },

            {
                'name': '一起爱',
                'value': 2015.94
            },

            {
                'name': '天荒地老',
                'value': 1325.06
            } ],
        'date': '2019-06-08-8'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4402.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 3570.41
            },

            {
                'name': '动力火车',
                'value': 3092.16
            },

            {
                'name': '超级联盟',
                'value': 3081.77
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2347.61
            },

            {
                'name': '一起爱',
                'value': 2035.94
            },

            {
                'name': '天荒地老',
                'value': 1325.06
            } ],
        'date': '2019-06-08-9'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4417.73
            },

            {
                'name': '一起幸福一起飞',
                'value': 3572.11
            },

            {
                'name': '动力火车',
                'value': 3092.16
            },

            {
                'name': '超级联盟',
                'value': 3083.21
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2347.61
            },

            {
                'name': '一起爱',
                'value': 2036.65
            },

            {
                'name': '天荒地老',
                'value': 1325.06
            } ],
        'date': '2019-06-08-10'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4429.73
            },

            {
                'name': '一起幸福一起飞',
                'value': 3591.96
            },

            {
                'name': '动力火车',
                'value': 3117.22
            },

            {
                'name': '超级联盟',
                'value': 3109.22
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2357.21
            },

            {
                'name': '一起爱',
                'value': 2076.65
            },

            {
                'name': '天荒地老',
                'value': 1331.72
            } ],
        'date': '2019-06-08-11'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4433.95
            },

            {
                'name': '一起幸福一起飞',
                'value': 3596.97
            },

            {
                'name': '超级联盟',
                'value': 3125.10
            },

            {
                'name': '动力火车',
                'value': 3119.36
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2357.47
            },

            {
                'name': '一起爱',
                'value': 2079.14
            },

            {
                'name': '天荒地老',
                'value': 1340.47
            } ],
        'date': '2019-06-08-12'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4436.02
            },

            {
                'name': '一起幸福一起飞',
                'value': 3608.02
            },

            {
                'name': '超级联盟',
                'value': 3146.58
            },

            {
                'name': '动力火车',
                'value': 3120.21
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2357.47
            },

            {
                'name': '一起爱',
                'value': 2079.14
            },

            {
                'name': '天荒地老',
                'value': 1340.47
            } ],
        'date': '2019-06-08-13'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4436.02
            },

            {
                'name': '一起幸福一起飞',
                'value': 3610.54
            },

            {
                'name': '超级联盟',
                'value': 3146.58
            },

            {
                'name': '动力火车',
                'value': 3121.61
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2357.47
            },

            {
                'name': '一起爱',
                'value': 2079.14
            },

            {
                'name': '天荒地老',
                'value': 1341.59
            } ],
        'date': '2019-06-08-14'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4436.45
            },

            {
                'name': '一起幸福一起飞',
                'value': 3614.80
            },

            {
                'name': '超级联盟',
                'value': 3153.11
            },

            {
                'name': '动力火车',
                'value': 3123.84
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2357.47
            },

            {
                'name': '一起爱',
                'value': 2079.14
            },

            {
                'name': '天荒地老',
                'value': 1341.59
            } ],
        'date': '2019-06-08-15'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4440.15
            },

            {
                'name': '一起幸福一起飞',
                'value': 3614.80
            },

            {
                'name': '超级联盟',
                'value': 3154.45
            },

            {
                'name': '动力火车',
                'value': 3128.49
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2357.47
            },

            {
                'name': '一起爱',
                'value': 2091.75
            },

            {
                'name': '天荒地老',
                'value': 1341.59
            } ],
        'date': '2019-06-08-16'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4445.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 3614.80
            },

            {
                'name': '超级联盟',
                'value': 3154.45
            },

            {
                'name': '动力火车',
                'value': 3132.17
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2357.47
            },

            {
                'name': '一起爱',
                'value': 2091.75
            },

            {
                'name': '天荒地老',
                'value': 1342.71
            } ],
        'date': '2019-06-08-17'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4462.12
            },

            {
                'name': '一起幸福一起飞',
                'value': 3615.23
            },

            {
                'name': '超级联盟',
                'value': 3162.66
            },

            {
                'name': '动力火车',
                'value': 3132.17
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2362.75
            },

            {
                'name': '一起爱',
                'value': 2091.75
            },

            {
                'name': '天荒地老',
                'value': 1347.33
            } ],
        'date': '2019-06-08-18'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4478.37
            },

            {
                'name': '一起幸福一起飞',
                'value': 3629.24
            },

            {
                'name': '超级联盟',
                'value': 3163.23
            },

            {
                'name': '动力火车',
                'value': 3133.46
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2364.06
            },

            {
                'name': '一起爱',
                'value': 2091.75
            },

            {
                'name': '天荒地老',
                'value': 1347.33
            } ],
        'date': '2019-06-08-19'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4485.03
            },

            {
                'name': '一起幸福一起飞',
                'value': 3631.05
            },

            {
                'name': '超级联盟',
                'value': 3168.24
            },

            {
                'name': '动力火车',
                'value': 3142.84
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2364.06
            },

            {
                'name': '一起爱',
                'value': 2092.72
            },

            {
                'name': '天荒地老',
                'value': 1347.33
            } ],
        'date': '2019-06-08-20'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4507.83
            },

            {
                'name': '一起幸福一起飞',
                'value': 3653.87
            },

            {
                'name': '超级联盟',
                'value': 3178.50
            },

            {
                'name': '动力火车',
                'value': 3154.88
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2369.92
            },

            {
                'name': '一起爱',
                'value': 2092.82
            },

            {
                'name': '天荒地老',
                'value': 1352.29
            } ],
        'date': '2019-06-08-21'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4521.34
            },

            {
                'name': '一起幸福一起飞',
                'value': 3660.26
            },

            {
                'name': '超级联盟',
                'value': 3178.50
            },

            {
                'name': '动力火车',
                'value': 3160.99
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2397.09
            },

            {
                'name': '一起爱',
                'value': 2096.97
            },

            {
                'name': '天荒地老',
                'value': 1372.29
            } ],
        'date': '2019-06-08-22'
    },

    {
        'category': '2019-06-08',
        'data': [

            {
                'name': '行者无畏',
                'value': 4526.42
            },

            {
                'name': '一起幸福一起飞',
                'value': 3683.38
            },

            {
                'name': '超级联盟',
                'value': 3178.50
            },

            {
                'name': '动力火车',
                'value': 3166.58
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2397.09
            },

            {
                'name': '一起爱',
                'value': 2108.02
            },

            {
                'name': '天荒地老',
                'value': 1374.37
            } ],
        'date': '2019-06-08-23'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4527.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 3683.38
            },

            {
                'name': '超级联盟',
                'value': 3180.19
            },

            {
                'name': '动力火车',
                'value': 3178.58
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2397.09
            },

            {
                'name': '一起爱',
                'value': 2110.77
            },

            {
                'name': '天荒地老',
                'value': 1374.37
            } ],
        'date': '2019-06-09-0'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4527.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 3695.38
            },

            {
                'name': '超级联盟',
                'value': 3182.97
            },

            {
                'name': '动力火车',
                'value': 3178.58
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2397.09
            },

            {
                'name': '一起爱',
                'value': 2110.77
            },

            {
                'name': '天荒地老',
                'value': 1374.37
            } ],
        'date': '2019-06-09-1'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4527.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 3695.38
            },

            {
                'name': '超级联盟',
                'value': 3182.97
            },

            {
                'name': '动力火车',
                'value': 3178.58
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2397.09
            },

            {
                'name': '一起爱',
                'value': 2110.77
            },

            {
                'name': '天荒地老',
                'value': 1374.37
            } ],
        'date': '2019-06-09-2'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4527.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 3695.38
            },

            {
                'name': '超级联盟',
                'value': 3182.97
            },

            {
                'name': '动力火车',
                'value': 3178.58
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2397.09
            },

            {
                'name': '一起爱',
                'value': 2110.77
            },

            {
                'name': '天荒地老',
                'value': 1374.37
            } ],
        'date': '2019-06-09-3'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4527.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 3695.38
            },

            {
                'name': '超级联盟',
                'value': 3184.49
            },

            {
                'name': '动力火车',
                'value': 3178.58
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2397.09
            },

            {
                'name': '一起爱',
                'value': 2110.77
            },

            {
                'name': '天荒地老',
                'value': 1374.37
            } ],
        'date': '2019-06-09-4'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4527.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 3695.38
            },

            {
                'name': '超级联盟',
                'value': 3184.49
            },

            {
                'name': '动力火车',
                'value': 3178.58
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2397.09
            },

            {
                'name': '一起爱',
                'value': 2110.77
            },

            {
                'name': '天荒地老',
                'value': 1374.37
            } ],
        'date': '2019-06-09-5'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4527.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 3695.38
            },

            {
                'name': '超级联盟',
                'value': 3185.40
            },

            {
                'name': '动力火车',
                'value': 3178.58
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2397.09
            },

            {
                'name': '一起爱',
                'value': 2110.77
            },

            {
                'name': '天荒地老',
                'value': 1374.37
            } ],
        'date': '2019-06-09-6'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4527.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 3713.87
            },

            {
                'name': '动力火车',
                'value': 3190.36
            },

            {
                'name': '超级联盟',
                'value': 3185.40
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2397.09
            },

            {
                'name': '一起爱',
                'value': 2115.86
            },

            {
                'name': '天荒地老',
                'value': 1394.37
            } ],
        'date': '2019-06-09-7'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4552.19
            },

            {
                'name': '一起幸福一起飞',
                'value': 3746.92
            },

            {
                'name': '动力火车',
                'value': 3231.17
            },

            {
                'name': '超级联盟',
                'value': 3222.80
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2427.13
            },

            {
                'name': '一起爱',
                'value': 2146.51
            },

            {
                'name': '天荒地老',
                'value': 1399.49
            } ],
        'date': '2019-06-09-8'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4616.08
            },

            {
                'name': '一起幸福一起飞',
                'value': 3784.38
            },

            {
                'name': '超级联盟',
                'value': 3304.74
            },

            {
                'name': '动力火车',
                'value': 3279.61
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2479.33
            },

            {
                'name': '一起爱',
                'value': 2183.84
            },

            {
                'name': '天荒地老',
                'value': 1411.44
            } ],
        'date': '2019-06-09-9'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4646.54
            },

            {
                'name': '一起幸福一起飞',
                'value': 3790.19
            },

            {
                'name': '超级联盟',
                'value': 3304.74
            },

            {
                'name': '动力火车',
                'value': 3279.61
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2485.23
            },

            {
                'name': '一起爱',
                'value': 2200.00
            },

            {
                'name': '天荒地老',
                'value': 1411.44
            } ],
        'date': '2019-06-09-10'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4649.67
            },

            {
                'name': '一起幸福一起飞',
                'value': 3794.35
            },

            {
                'name': '超级联盟',
                'value': 3305.13
            },

            {
                'name': '动力火车',
                'value': 3280.94
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2505.94
            },

            {
                'name': '一起爱',
                'value': 2189.83
            },

            {
                'name': '天荒地老',
                'value': 1433.53
            } ],
        'date': '2019-06-09-11'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4650.79
            },

            {
                'name': '一起幸福一起飞',
                'value': 3794.35
            },

            {
                'name': '超级联盟',
                'value': 3305.13
            },

            {
                'name': '动力火车',
                'value': 3287.74
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2505.94
            },

            {
                'name': '一起爱',
                'value': 2197.36
            },

            {
                'name': '天荒地老',
                'value': 1433.53
            } ],
        'date': '2019-06-09-12'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4653.58
            },

            {
                'name': '一起幸福一起飞',
                'value': 3794.35
            },

            {
                'name': '超级联盟',
                'value': 3315.59
            },

            {
                'name': '动力火车',
                'value': 3289.96
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2514.08
            },

            {
                'name': '一起爱',
                'value': 2198.68
            },

            {
                'name': '天荒地老',
                'value': 1434.47
            } ],
        'date': '2019-06-09-13'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4654.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 3794.35
            },

            {
                'name': '超级联盟',
                'value': 3315.86
            },

            {
                'name': '动力火车',
                'value': 3291.60
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2514.08
            },

            {
                'name': '一起爱',
                'value': 2201.49
            },

            {
                'name': '天荒地老',
                'value': 1434.47
            } ],
        'date': '2019-06-09-14'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4655.02
            },

            {
                'name': '一起幸福一起飞',
                'value': 3806.35
            },

            {
                'name': '超级联盟',
                'value': 3319.99
            },

            {
                'name': '动力火车',
                'value': 3303.60
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2514.08
            },

            {
                'name': '一起爱',
                'value': 2202.00
            },

            {
                'name': '天荒地老',
                'value': 1434.47
            } ],
        'date': '2019-06-09-15'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4657.15
            },

            {
                'name': '一起幸福一起飞',
                'value': 3827.33
            },

            {
                'name': '超级联盟',
                'value': 3319.99
            },

            {
                'name': '动力火车',
                'value': 3303.60
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2514.08
            },

            {
                'name': '一起爱',
                'value': 2203.33
            },

            {
                'name': '天荒地老',
                'value': 1434.47
            } ],
        'date': '2019-06-09-16'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4659.55
            },

            {
                'name': '一起幸福一起飞',
                'value': 3849.56
            },

            {
                'name': '超级联盟',
                'value': 3319.99
            },

            {
                'name': '动力火车',
                'value': 3317.62
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2514.08
            },

            {
                'name': '一起爱',
                'value': 2203.33
            },

            {
                'name': '天荒地老',
                'value': 1434.47
            } ],
        'date': '2019-06-09-17'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4659.55
            },

            {
                'name': '一起幸福一起飞',
                'value': 3857.58
            },

            {
                'name': '超级联盟',
                'value': 3320.77
            },

            {
                'name': '动力火车',
                'value': 3319.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2516.97
            },

            {
                'name': '一起爱',
                'value': 2206.30
            },

            {
                'name': '天荒地老',
                'value': 1434.47
            } ],
        'date': '2019-06-09-18'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4694.11
            },

            {
                'name': '一起幸福一起飞',
                'value': 3882.01
            },

            {
                'name': '超级联盟',
                'value': 3342.97
            },

            {
                'name': '动力火车',
                'value': 3341.56
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2532.68
            },

            {
                'name': '一起爱',
                'value': 2207.47
            },

            {
                'name': '天荒地老',
                'value': 1435.16
            } ],
        'date': '2019-06-09-19'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4730.85
            },

            {
                'name': '一起幸福一起飞',
                'value': 3883.75
            },

            {
                'name': '动力火车',
                'value': 3352.65
            },

            {
                'name': '超级联盟',
                'value': 3350.77
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2555.40
            },

            {
                'name': '一起爱',
                'value': 2227.31
            },

            {
                'name': '天荒地老',
                'value': 1450.47
            } ],
        'date': '2019-06-09-20'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4755.64
            },

            {
                'name': '一起幸福一起飞',
                'value': 3888.83
            },

            {
                'name': '动力火车',
                'value': 3368.11
            },

            {
                'name': '超级联盟',
                'value': 3350.77
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2563.56
            },

            {
                'name': '一起爱',
                'value': 2232.20
            },

            {
                'name': '天荒地老',
                'value': 1454.04
            } ],
        'date': '2019-06-09-21'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4773.58
            },

            {
                'name': '一起幸福一起飞',
                'value': 3927.34
            },

            {
                'name': '动力火车',
                'value': 3385.92
            },

            {
                'name': '超级联盟',
                'value': 3374.45
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2566.49
            },

            {
                'name': '一起爱',
                'value': 2246.98
            },

            {
                'name': '天荒地老',
                'value': 1459.77
            } ],
        'date': '2019-06-09-22'
    },

    {
        'category': '2019-06-09',
        'data': [

            {
                'name': '行者无畏',
                'value': 4781.14
            },

            {
                'name': '一起幸福一起飞',
                'value': 3938.27
            },

            {
                'name': '动力火车',
                'value': 3391.42
            },

            {
                'name': '超级联盟',
                'value': 3390.75
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2566.87
            },

            {
                'name': '一起爱',
                'value': 2262.25
            },

            {
                'name': '天荒地老',
                'value': 1459.77
            } ],
        'date': '2019-06-09-23'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4781.14
            },

            {
                'name': '一起幸福一起飞',
                'value': 3938.78
            },

            {
                'name': '动力火车',
                'value': 3400.11
            },

            {
                'name': '超级联盟',
                'value': 3397.02
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2567.79
            },

            {
                'name': '一起爱',
                'value': 2266.32
            },

            {
                'name': '天荒地老',
                'value': 1459.77
            } ],
        'date': '2019-06-10-0'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4788.53
            },

            {
                'name': '一起幸福一起飞',
                'value': 3942.71
            },

            {
                'name': '动力火车',
                'value': 3401.11
            },

            {
                'name': '超级联盟',
                'value': 3397.02
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2567.79
            },

            {
                'name': '一起爱',
                'value': 2266.32
            },

            {
                'name': '天荒地老',
                'value': 1459.77
            } ],
        'date': '2019-06-10-1'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4788.53
            },

            {
                'name': '一起幸福一起飞',
                'value': 3942.71
            },

            {
                'name': '动力火车',
                'value': 3401.11
            },

            {
                'name': '超级联盟',
                'value': 3397.02
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2567.79
            },

            {
                'name': '一起爱',
                'value': 2266.32
            },

            {
                'name': '天荒地老',
                'value': 1459.77
            } ],
        'date': '2019-06-10-2'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4788.53
            },

            {
                'name': '一起幸福一起飞',
                'value': 3942.71
            },

            {
                'name': '动力火车',
                'value': 3401.11
            },

            {
                'name': '超级联盟',
                'value': 3397.02
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2567.79
            },

            {
                'name': '一起爱',
                'value': 2266.32
            },

            {
                'name': '天荒地老',
                'value': 1459.77
            } ],
        'date': '2019-06-10-3'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4788.53
            },

            {
                'name': '一起幸福一起飞',
                'value': 3942.71
            },

            {
                'name': '动力火车',
                'value': 3401.11
            },

            {
                'name': '超级联盟',
                'value': 3397.02
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2567.79
            },

            {
                'name': '一起爱',
                'value': 2266.32
            },

            {
                'name': '天荒地老',
                'value': 1459.77
            } ],
        'date': '2019-06-10-4'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4788.53
            },

            {
                'name': '一起幸福一起飞',
                'value': 3942.71
            },

            {
                'name': '动力火车',
                'value': 3401.11
            },

            {
                'name': '超级联盟',
                'value': 3397.02
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2567.79
            },

            {
                'name': '一起爱',
                'value': 2266.32
            },

            {
                'name': '天荒地老',
                'value': 1459.77
            } ],
        'date': '2019-06-10-5'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4788.53
            },

            {
                'name': '一起幸福一起飞',
                'value': 3942.71
            },

            {
                'name': '动力火车',
                'value': 3401.11
            },

            {
                'name': '超级联盟',
                'value': 3397.02
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2567.79
            },

            {
                'name': '一起爱',
                'value': 2266.32
            },

            {
                'name': '天荒地老',
                'value': 1459.77
            } ],
        'date': '2019-06-10-6'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4813.87
            },

            {
                'name': '一起幸福一起飞',
                'value': 3945.49
            },

            {
                'name': '动力火车',
                'value': 3425.11
            },

            {
                'name': '超级联盟',
                'value': 3402.09
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2598.71
            },

            {
                'name': '一起爱',
                'value': 2270.34
            },

            {
                'name': '天荒地老',
                'value': 1459.77
            } ],
        'date': '2019-06-10-7'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4838.08
            },

            {
                'name': '一起幸福一起飞',
                'value': 3954.64
            },

            {
                'name': '动力火车',
                'value': 3442.53
            },

            {
                'name': '超级联盟',
                'value': 3429.60
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2607.93
            },

            {
                'name': '一起爱',
                'value': 2290.10
            },

            {
                'name': '天荒地老',
                'value': 1463.80
            } ],
        'date': '2019-06-10-8'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4870.52
            },

            {
                'name': '一起幸福一起飞',
                'value': 3968.24
            },

            {
                'name': '动力火车',
                'value': 3468.48
            },

            {
                'name': '超级联盟',
                'value': 3435.65
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2611.49
            },

            {
                'name': '一起爱',
                'value': 2308.54
            },

            {
                'name': '天荒地老',
                'value': 1463.80
            } ],
        'date': '2019-06-10-9'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4874.08
            },

            {
                'name': '一起幸福一起飞',
                'value': 3971.01
            },

            {
                'name': '动力火车',
                'value': 3480.48
            },

            {
                'name': '超级联盟',
                'value': 3435.65
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2611.73
            },

            {
                'name': '一起爱',
                'value': 2318.36
            },

            {
                'name': '天荒地老',
                'value': 1468.70
            } ],
        'date': '2019-06-10-10'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4881.72
            },

            {
                'name': '一起幸福一起飞',
                'value': 3974.09
            },

            {
                'name': '动力火车',
                'value': 3486.11
            },

            {
                'name': '超级联盟',
                'value': 3435.65
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2614.74
            },

            {
                'name': '一起爱',
                'value': 2319.92
            },

            {
                'name': '天荒地老',
                'value': 1471.90
            } ],
        'date': '2019-06-10-11'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4884.26
            },

            {
                'name': '一起幸福一起飞',
                'value': 3974.09
            },

            {
                'name': '动力火车',
                'value': 3486.11
            },

            {
                'name': '超级联盟',
                'value': 3435.65
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2614.74
            },

            {
                'name': '一起爱',
                'value': 2319.92
            },

            {
                'name': '天荒地老',
                'value': 1477.62
            } ],
        'date': '2019-06-10-12'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4888.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 3974.09
            },

            {
                'name': '动力火车',
                'value': 3487.47
            },

            {
                'name': '超级联盟',
                'value': 3435.65
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2614.74
            },

            {
                'name': '一起爱',
                'value': 2320.16
            },

            {
                'name': '天荒地老',
                'value': 1477.62
            } ],
        'date': '2019-06-10-13'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4896.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 3974.69
            },

            {
                'name': '动力火车',
                'value': 3488.35
            },

            {
                'name': '超级联盟',
                'value': 3435.65
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2614.74
            },

            {
                'name': '一起爱',
                'value': 2324.58
            },

            {
                'name': '天荒地老',
                'value': 1479.65
            } ],
        'date': '2019-06-10-14'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4896.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 3974.69
            },

            {
                'name': '动力火车',
                'value': 3488.35
            },

            {
                'name': '超级联盟',
                'value': 3435.65
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2614.74
            },

            {
                'name': '一起爱',
                'value': 2324.58
            },

            {
                'name': '天荒地老',
                'value': 1479.65
            } ],
        'date': '2019-06-10-15'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4896.29
            },

            {
                'name': '一起幸福一起飞',
                'value': 3980.85
            },

            {
                'name': '动力火车',
                'value': 3488.35
            },

            {
                'name': '超级联盟',
                'value': 3441.65
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2614.74
            },

            {
                'name': '一起爱',
                'value': 2325.25
            },

            {
                'name': '天荒地老',
                'value': 1479.65
            } ],
        'date': '2019-06-10-16'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4899.12
            },

            {
                'name': '一起幸福一起飞',
                'value': 3980.85
            },

            {
                'name': '动力火车',
                'value': 3494.98
            },

            {
                'name': '超级联盟',
                'value': 3441.65
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2614.74
            },

            {
                'name': '一起爱',
                'value': 2325.95
            },

            {
                'name': '天荒地老',
                'value': 1482.15
            } ],
        'date': '2019-06-10-17'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4901.88
            },

            {
                'name': '一起幸福一起飞',
                'value': 3992.85
            },

            {
                'name': '动力火车',
                'value': 3495.24
            },

            {
                'name': '超级联盟',
                'value': 3442.50
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2614.74
            },

            {
                'name': '一起爱',
                'value': 2327.57
            },

            {
                'name': '天荒地老',
                'value': 1487.47
            } ],
        'date': '2019-06-10-18'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4907.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 3996.27
            },

            {
                'name': '动力火车',
                'value': 3506.58
            },

            {
                'name': '超级联盟',
                'value': 3442.78
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2614.74
            },

            {
                'name': '一起爱',
                'value': 2328.02
            },

            {
                'name': '天荒地老',
                'value': 1487.47
            } ],
        'date': '2019-06-10-19'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4912.75
            },

            {
                'name': '一起幸福一起飞',
                'value': 3998.80
            },

            {
                'name': '动力火车',
                'value': 3518.42
            },

            {
                'name': '超级联盟',
                'value': 3442.78
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2614.74
            },

            {
                'name': '一起爱',
                'value': 2344.18
            },

            {
                'name': '天荒地老',
                'value': 1487.47
            } ],
        'date': '2019-06-10-20'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4919.20
            },

            {
                'name': '一起幸福一起飞',
                'value': 4019.76
            },

            {
                'name': '动力火车',
                'value': 3520.83
            },

            {
                'name': '超级联盟',
                'value': 3450.16
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2614.86
            },

            {
                'name': '一起爱',
                'value': 2350.97
            },

            {
                'name': '天荒地老',
                'value': 1489.67
            } ],
        'date': '2019-06-10-21'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4932.03
            },

            {
                'name': '一起幸福一起飞',
                'value': 4030.48
            },

            {
                'name': '动力火车',
                'value': 3564.03
            },

            {
                'name': '超级联盟',
                'value': 3461.74
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2625.45
            },

            {
                'name': '一起爱',
                'value': 2358.36
            },

            {
                'name': '天荒地老',
                'value': 1493.67
            } ],
        'date': '2019-06-10-22'
    },

    {
        'category': '2019-06-10',
        'data': [

            {
                'name': '行者无畏',
                'value': 4939.44
            },

            {
                'name': '一起幸福一起飞',
                'value': 4054.68
            },

            {
                'name': '动力火车',
                'value': 3565.11
            },

            {
                'name': '超级联盟',
                'value': 3473.02
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2647.06
            },

            {
                'name': '一起爱',
                'value': 2358.36
            },

            {
                'name': '天荒地老',
                'value': 1506.94
            } ],
        'date': '2019-06-10-23'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 4939.44
            },

            {
                'name': '一起幸福一起飞',
                'value': 4059.33
            },

            {
                'name': '动力火车',
                'value': 3574.55
            },

            {
                'name': '超级联盟',
                'value': 3527.13
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2647.06
            },

            {
                'name': '一起爱',
                'value': 2358.95
            },

            {
                'name': '天荒地老',
                'value': 1506.94
            } ],
        'date': '2019-06-11-0'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 4939.44
            },

            {
                'name': '一起幸福一起飞',
                'value': 4062.42
            },

            {
                'name': '动力火车',
                'value': 3574.55
            },

            {
                'name': '超级联盟',
                'value': 3527.57
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2647.06
            },

            {
                'name': '一起爱',
                'value': 2358.95
            },

            {
                'name': '天荒地老',
                'value': 1506.94
            } ],
        'date': '2019-06-11-1'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 4948.53
            },

            {
                'name': '一起幸福一起飞',
                'value': 4062.42
            },

            {
                'name': '动力火车',
                'value': 3574.55
            },

            {
                'name': '超级联盟',
                'value': 3527.57
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2647.06
            },

            {
                'name': '一起爱',
                'value': 2358.95
            },

            {
                'name': '天荒地老',
                'value': 1506.94
            } ],
        'date': '2019-06-11-2'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 4948.53
            },

            {
                'name': '一起幸福一起飞',
                'value': 4062.42
            },

            {
                'name': '动力火车',
                'value': 3574.55
            },

            {
                'name': '超级联盟',
                'value': 3527.57
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2647.06
            },

            {
                'name': '一起爱',
                'value': 2358.95
            },

            {
                'name': '天荒地老',
                'value': 1506.94
            } ],
        'date': '2019-06-11-3'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 4948.53
            },

            {
                'name': '一起幸福一起飞',
                'value': 4062.42
            },

            {
                'name': '动力火车',
                'value': 3574.55
            },

            {
                'name': '超级联盟',
                'value': 3527.57
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2647.06
            },

            {
                'name': '一起爱',
                'value': 2358.95
            },

            {
                'name': '天荒地老',
                'value': 1506.94
            } ],
        'date': '2019-06-11-4'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 4948.53
            },

            {
                'name': '一起幸福一起飞',
                'value': 4062.42
            },

            {
                'name': '动力火车',
                'value': 3574.55
            },

            {
                'name': '超级联盟',
                'value': 3527.57
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2647.06
            },

            {
                'name': '一起爱',
                'value': 2358.95
            },

            {
                'name': '天荒地老',
                'value': 1506.94
            } ],
        'date': '2019-06-11-5'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 4952.53
            },

            {
                'name': '一起幸福一起飞',
                'value': 4072.93
            },

            {
                'name': '动力火车',
                'value': 3574.55
            },

            {
                'name': '超级联盟',
                'value': 3527.57
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2647.06
            },

            {
                'name': '一起爱',
                'value': 2358.95
            },

            {
                'name': '天荒地老',
                'value': 1506.94
            } ],
        'date': '2019-06-11-6'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 4970.64
            },

            {
                'name': '一起幸福一起飞',
                'value': 4074.52
            },

            {
                'name': '动力火车',
                'value': 3598.16
            },

            {
                'name': '超级联盟',
                'value': 3530.11
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2653.59
            },

            {
                'name': '一起爱',
                'value': 2368.96
            },

            {
                'name': '天荒地老',
                'value': 1512.37
            } ],
        'date': '2019-06-11-7'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 5015.09
            },

            {
                'name': '一起幸福一起飞',
                'value': 4138.15
            },

            {
                'name': '动力火车',
                'value': 3610.97
            },

            {
                'name': '超级联盟',
                'value': 3557.92
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2668.60
            },

            {
                'name': '一起爱',
                'value': 2386.24
            },

            {
                'name': '天荒地老',
                'value': 1519.94
            } ],
        'date': '2019-06-11-8'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 5038.34
            },

            {
                'name': '一起幸福一起飞',
                'value': 4144.91
            },

            {
                'name': '动力火车',
                'value': 3656.64
            },

            {
                'name': '超级联盟',
                'value': 3597.55
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2674.80
            },

            {
                'name': '一起爱',
                'value': 2397.30
            },

            {
                'name': '天荒地老',
                'value': 1520.72
            } ],
        'date': '2019-06-11-9'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 5051.25
            },

            {
                'name': '一起幸福一起飞',
                'value': 4146.42
            },

            {
                'name': '动力火车',
                'value': 3676.64
            },

            {
                'name': '超级联盟',
                'value': 3609.74
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2678.18
            },

            {
                'name': '一起爱',
                'value': 2397.30
            },

            {
                'name': '天荒地老',
                'value': 1524.24
            } ],
        'date': '2019-06-11-10'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 5072.75
            },

            {
                'name': '一起幸福一起飞',
                'value': 4146.42
            },

            {
                'name': '动力火车',
                'value': 3697.95
            },

            {
                'name': '超级联盟',
                'value': 3609.74
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2690.18
            },

            {
                'name': '一起爱',
                'value': 2397.30
            },

            {
                'name': '天荒地老',
                'value': 1526.08
            } ],
        'date': '2019-06-11-11'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 5072.75
            },

            {
                'name': '一起幸福一起飞',
                'value': 4146.42
            },

            {
                'name': '动力火车',
                'value': 3697.95
            },

            {
                'name': '超级联盟',
                'value': 3609.74
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2690.18
            },

            {
                'name': '一起爱',
                'value': 2397.30
            },

            {
                'name': '天荒地老',
                'value': 1532.88
            } ],
        'date': '2019-06-11-12'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 5073.34
            },

            {
                'name': '一起幸福一起飞',
                'value': 4146.89
            },

            {
                'name': '动力火车',
                'value': 3698.56
            },

            {
                'name': '超级联盟',
                'value': 3617.16
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2695.37
            },

            {
                'name': '一起爱',
                'value': 2402.64
            },

            {
                'name': '天荒地老',
                'value': 1532.88
            } ],
        'date': '2019-06-11-13'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 5075.60
            },

            {
                'name': '一起幸福一起飞',
                'value': 4172.89
            },

            {
                'name': '动力火车',
                'value': 3701.04
            },

            {
                'name': '超级联盟',
                'value': 3617.16
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2700.04
            },

            {
                'name': '一起爱',
                'value': 2402.64
            },

            {
                'name': '天荒地老',
                'value': 1535.04
            } ],
        'date': '2019-06-11-14'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 5075.60
            },

            {
                'name': '一起幸福一起飞',
                'value': 4173.12
            },

            {
                'name': '动力火车',
                'value': 3701.04
            },

            {
                'name': '超级联盟',
                'value': 3617.94
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2701.05
            },

            {
                'name': '一起爱',
                'value': 2402.64
            },

            {
                'name': '天荒地老',
                'value': 1535.04
            } ],
        'date': '2019-06-11-15'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 5075.60
            },

            {
                'name': '一起幸福一起飞',
                'value': 4173.12
            },

            {
                'name': '动力火车',
                'value': 3705.61
            },

            {
                'name': '超级联盟',
                'value': 3618.87
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2701.05
            },

            {
                'name': '一起爱',
                'value': 2402.64
            },

            {
                'name': '天荒地老',
                'value': 1535.04
            } ],
        'date': '2019-06-11-16'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 5078.58
            },

            {
                'name': '一起幸福一起飞',
                'value': 4175.69
            },

            {
                'name': '动力火车',
                'value': 3721.30
            },

            {
                'name': '超级联盟',
                'value': 3620.70
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2701.52
            },

            {
                'name': '一起爱',
                'value': 2402.64
            },

            {
                'name': '天荒地老',
                'value': 1536.45
            } ],
        'date': '2019-06-11-17'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 5079.69
            },

            {
                'name': '一起幸福一起飞',
                'value': 4175.69
            },

            {
                'name': '动力火车',
                'value': 3723.75
            },

            {
                'name': '超级联盟',
                'value': 3627.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2701.52
            },

            {
                'name': '一起爱',
                'value': 2403.56
            },

            {
                'name': '天荒地老',
                'value': 1536.45
            } ],
        'date': '2019-06-11-18'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 5086.09
            },

            {
                'name': '一起幸福一起飞',
                'value': 4184.39
            },

            {
                'name': '动力火车',
                'value': 3724.58
            },

            {
                'name': '超级联盟',
                'value': 3627.67
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2701.52
            },

            {
                'name': '一起爱',
                'value': 2410.01
            },

            {
                'name': '天荒地老',
                'value': 1536.45
            } ],
        'date': '2019-06-11-19'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 5096.48
            },

            {
                'name': '一起幸福一起飞',
                'value': 4227.02
            },

            {
                'name': '动力火车',
                'value': 3741.10
            },

            {
                'name': '超级联盟',
                'value': 3634.79
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2705.17
            },

            {
                'name': '一起爱',
                'value': 2410.01
            },

            {
                'name': '天荒地老',
                'value': 1556.02
            } ],
        'date': '2019-06-11-20'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 5097.13
            },

            {
                'name': '一起幸福一起飞',
                'value': 4239.12
            },

            {
                'name': '动力火车',
                'value': 3754.95
            },

            {
                'name': '超级联盟',
                'value': 3642.10
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2705.17
            },

            {
                'name': '一起爱',
                'value': 2412.25
            },

            {
                'name': '天荒地老',
                'value': 1556.02
            } ],
        'date': '2019-06-11-21'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 5115.49
            },

            {
                'name': '一起幸福一起飞',
                'value': 4253.07
            },

            {
                'name': '动力火车',
                'value': 3758.44
            },

            {
                'name': '超级联盟',
                'value': 3662.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2710.38
            },

            {
                'name': '一起爱',
                'value': 2429.48
            },

            {
                'name': '天荒地老',
                'value': 1556.59
            } ],
        'date': '2019-06-11-22'
    },

    {
        'category': '2019-06-11',
        'data': [

            {
                'name': '行者无畏',
                'value': 5115.91
            },

            {
                'name': '一起幸福一起飞',
                'value': 4264.71
            },

            {
                'name': '动力火车',
                'value': 3758.44
            },

            {
                'name': '超级联盟',
                'value': 3662.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2710.38
            },

            {
                'name': '一起爱',
                'value': 2429.48
            },

            {
                'name': '天荒地老',
                'value': 1556.59
            } ],
        'date': '2019-06-11-23'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5118.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 4264.71
            },

            {
                'name': '动力火车',
                'value': 3758.44
            },

            {
                'name': '超级联盟',
                'value': 3682.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2710.38
            },

            {
                'name': '一起爱',
                'value': 2429.48
            },

            {
                'name': '天荒地老',
                'value': 1556.59
            } ],
        'date': '2019-06-12-0'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5121.16
            },

            {
                'name': '一起幸福一起飞',
                'value': 4264.71
            },

            {
                'name': '动力火车',
                'value': 3758.44
            },

            {
                'name': '超级联盟',
                'value': 3682.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2710.38
            },

            {
                'name': '一起爱',
                'value': 2429.48
            },

            {
                'name': '天荒地老',
                'value': 1556.59
            } ],
        'date': '2019-06-12-1'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5121.16
            },

            {
                'name': '一起幸福一起飞',
                'value': 4264.71
            },

            {
                'name': '动力火车',
                'value': 3758.44
            },

            {
                'name': '超级联盟',
                'value': 3682.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2710.38
            },

            {
                'name': '一起爱',
                'value': 2429.48
            },

            {
                'name': '天荒地老',
                'value': 1556.59
            } ],
        'date': '2019-06-12-2'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5121.16
            },

            {
                'name': '一起幸福一起飞',
                'value': 4264.71
            },

            {
                'name': '动力火车',
                'value': 3758.44
            },

            {
                'name': '超级联盟',
                'value': 3682.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2710.38
            },

            {
                'name': '一起爱',
                'value': 2429.48
            },

            {
                'name': '天荒地老',
                'value': 1556.59
            } ],
        'date': '2019-06-12-3'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5121.16
            },

            {
                'name': '一起幸福一起飞',
                'value': 4264.71
            },

            {
                'name': '动力火车',
                'value': 3758.44
            },

            {
                'name': '超级联盟',
                'value': 3682.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2710.38
            },

            {
                'name': '一起爱',
                'value': 2429.48
            },

            {
                'name': '天荒地老',
                'value': 1556.59
            } ],
        'date': '2019-06-12-4'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5121.16
            },

            {
                'name': '一起幸福一起飞',
                'value': 4264.71
            },

            {
                'name': '动力火车',
                'value': 3758.44
            },

            {
                'name': '超级联盟',
                'value': 3682.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2710.38
            },

            {
                'name': '一起爱',
                'value': 2429.48
            },

            {
                'name': '天荒地老',
                'value': 1556.59
            } ],
        'date': '2019-06-12-5'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5121.16
            },

            {
                'name': '一起幸福一起飞',
                'value': 4264.71
            },

            {
                'name': '动力火车',
                'value': 3758.44
            },

            {
                'name': '超级联盟',
                'value': 3682.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2710.38
            },

            {
                'name': '一起爱',
                'value': 2429.48
            },

            {
                'name': '天荒地老',
                'value': 1566.62
            } ],
        'date': '2019-06-12-6'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5121.16
            },

            {
                'name': '一起幸福一起飞',
                'value': 4264.71
            },

            {
                'name': '动力火车',
                'value': 3758.44
            },

            {
                'name': '超级联盟',
                'value': 3682.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2729.63
            },

            {
                'name': '一起爱',
                'value': 2436.32
            },

            {
                'name': '天荒地老',
                'value': 1570.41
            } ],
        'date': '2019-06-12-7'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5142.88
            },

            {
                'name': '一起幸福一起飞',
                'value': 4296.56
            },

            {
                'name': '动力火车',
                'value': 3802.27
            },

            {
                'name': '超级联盟',
                'value': 3701.95
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2729.63
            },

            {
                'name': '一起爱',
                'value': 2441.61
            },

            {
                'name': '天荒地老',
                'value': 1577.50
            } ],
        'date': '2019-06-12-8'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5173.52
            },

            {
                'name': '一起幸福一起飞',
                'value': 4303.66
            },

            {
                'name': '动力火车',
                'value': 3835.85
            },

            {
                'name': '超级联盟',
                'value': 3714.07
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2742.02
            },

            {
                'name': '一起爱',
                'value': 2456.05
            },

            {
                'name': '天荒地老',
                'value': 1586.93
            } ],
        'date': '2019-06-12-9'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5182.21
            },

            {
                'name': '一起幸福一起飞',
                'value': 4306.45
            },

            {
                'name': '动力火车',
                'value': 3839.63
            },

            {
                'name': '超级联盟',
                'value': 3714.07
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2742.02
            },

            {
                'name': '一起爱',
                'value': 2458.49
            },

            {
                'name': '天荒地老',
                'value': 1597.11
            } ],
        'date': '2019-06-12-10'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5184.72
            },

            {
                'name': '一起幸福一起飞',
                'value': 4306.75
            },

            {
                'name': '动力火车',
                'value': 3844.21
            },

            {
                'name': '超级联盟',
                'value': 3714.07
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2753.12
            },

            {
                'name': '一起爱',
                'value': 2459.62
            },

            {
                'name': '天荒地老',
                'value': 1602.22
            } ],
        'date': '2019-06-12-11'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5184.72
            },

            {
                'name': '一起幸福一起飞',
                'value': 4320.52
            },

            {
                'name': '动力火车',
                'value': 3845.00
            },

            {
                'name': '超级联盟',
                'value': 3714.07
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2754.64
            },

            {
                'name': '一起爱',
                'value': 2459.62
            },

            {
                'name': '天荒地老',
                'value': 1602.22
            } ],
        'date': '2019-06-12-12'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5185.22
            },

            {
                'name': '一起幸福一起飞',
                'value': 4321.57
            },

            {
                'name': '动力火车',
                'value': 3846.01
            },

            {
                'name': '超级联盟',
                'value': 3714.07
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2754.64
            },

            {
                'name': '一起爱',
                'value': 2460.07
            },

            {
                'name': '天荒地老',
                'value': 1602.22
            } ],
        'date': '2019-06-12-13'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5189.67
            },

            {
                'name': '一起幸福一起飞',
                'value': 4322.60
            },

            {
                'name': '动力火车',
                'value': 3847.04
            },

            {
                'name': '超级联盟',
                'value': 3714.07
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2765.07
            },

            {
                'name': '一起爱',
                'value': 2460.07
            },

            {
                'name': '天荒地老',
                'value': 1604.85
            } ],
        'date': '2019-06-12-14'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5190.07
            },

            {
                'name': '一起幸福一起飞',
                'value': 4332.91
            },

            {
                'name': '动力火车',
                'value': 3847.04
            },

            {
                'name': '超级联盟',
                'value': 3714.07
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2765.07
            },

            {
                'name': '一起爱',
                'value': 2460.07
            },

            {
                'name': '天荒地老',
                'value': 1604.85
            } ],
        'date': '2019-06-12-15'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5194.48
            },

            {
                'name': '一起幸福一起飞',
                'value': 4354.60
            },

            {
                'name': '动力火车',
                'value': 3847.04
            },

            {
                'name': '超级联盟',
                'value': 3714.48
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2765.07
            },

            {
                'name': '一起爱',
                'value': 2460.07
            },

            {
                'name': '天荒地老',
                'value': 1604.85
            } ],
        'date': '2019-06-12-16'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5194.48
            },

            {
                'name': '一起幸福一起飞',
                'value': 4355.55
            },

            {
                'name': '动力火车',
                'value': 3847.04
            },

            {
                'name': '超级联盟',
                'value': 3714.48
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2765.07
            },

            {
                'name': '一起爱',
                'value': 2460.07
            },

            {
                'name': '天荒地老',
                'value': 1604.85
            } ],
        'date': '2019-06-12-17'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5194.48
            },

            {
                'name': '一起幸福一起飞',
                'value': 4355.55
            },

            {
                'name': '动力火车',
                'value': 3853.76
            },

            {
                'name': '超级联盟',
                'value': 3714.48
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2765.07
            },

            {
                'name': '一起爱',
                'value': 2460.07
            },

            {
                'name': '天荒地老',
                'value': 1604.85
            } ],
        'date': '2019-06-12-18'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5196.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 4357.42
            },

            {
                'name': '动力火车',
                'value': 3867.14
            },

            {
                'name': '超级联盟',
                'value': 3721.60
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2774.98
            },

            {
                'name': '一起爱',
                'value': 2467.73
            },

            {
                'name': '天荒地老',
                'value': 1605.79
            } ],
        'date': '2019-06-12-19'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5206.01
            },

            {
                'name': '一起幸福一起飞',
                'value': 4373.47
            },

            {
                'name': '动力火车',
                'value': 3872.33
            },

            {
                'name': '超级联盟',
                'value': 3721.60
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2779.10
            },

            {
                'name': '一起爱',
                'value': 2477.74
            },

            {
                'name': '天荒地老',
                'value': 1607.00
            } ],
        'date': '2019-06-12-20'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5213.42
            },

            {
                'name': '一起幸福一起飞',
                'value': 4392.42
            },

            {
                'name': '动力火车',
                'value': 3878.24
            },

            {
                'name': '超级联盟',
                'value': 3729.36
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2784.10
            },

            {
                'name': '一起爱',
                'value': 2497.74
            },

            {
                'name': '天荒地老',
                'value': 1607.00
            } ],
        'date': '2019-06-12-21'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5219.55
            },

            {
                'name': '一起幸福一起飞',
                'value': 4409.17
            },

            {
                'name': '动力火车',
                'value': 3881.79
            },

            {
                'name': '超级联盟',
                'value': 3729.36
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2784.10
            },

            {
                'name': '一起爱',
                'value': 2497.74
            },

            {
                'name': '天荒地老',
                'value': 1612.02
            } ],
        'date': '2019-06-12-22'
    },

    {
        'category': '2019-06-12',
        'data': [

            {
                'name': '行者无畏',
                'value': 5224.83
            },

            {
                'name': '一起幸福一起飞',
                'value': 4409.49
            },

            {
                'name': '动力火车',
                'value': 3892.64
            },

            {
                'name': '超级联盟',
                'value': 3744.35
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2784.10
            },

            {
                'name': '一起爱',
                'value': 2502.07
            },

            {
                'name': '天荒地老',
                'value': 1612.02
            } ],
        'date': '2019-06-12-23'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5224.83
            },

            {
                'name': '一起幸福一起飞',
                'value': 4419.64
            },

            {
                'name': '动力火车',
                'value': 3901.29
            },

            {
                'name': '超级联盟',
                'value': 3751.91
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2784.10
            },

            {
                'name': '一起爱',
                'value': 2502.07
            },

            {
                'name': '天荒地老',
                'value': 1614.03
            } ],
        'date': '2019-06-13-0'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5224.83
            },

            {
                'name': '一起幸福一起飞',
                'value': 4419.64
            },

            {
                'name': '动力火车',
                'value': 3901.29
            },

            {
                'name': '超级联盟',
                'value': 3751.91
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2784.10
            },

            {
                'name': '一起爱',
                'value': 2502.07
            },

            {
                'name': '天荒地老',
                'value': 1614.03
            } ],
        'date': '2019-06-13-1'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5224.83
            },

            {
                'name': '一起幸福一起飞',
                'value': 4439.64
            },

            {
                'name': '动力火车',
                'value': 3901.29
            },

            {
                'name': '超级联盟',
                'value': 3751.91
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2784.57
            },

            {
                'name': '一起爱',
                'value': 2502.07
            },

            {
                'name': '天荒地老',
                'value': 1614.03
            } ],
        'date': '2019-06-13-2'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5224.83
            },

            {
                'name': '一起幸福一起飞',
                'value': 4439.64
            },

            {
                'name': '动力火车',
                'value': 3901.29
            },

            {
                'name': '超级联盟',
                'value': 3751.91
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2784.57
            },

            {
                'name': '一起爱',
                'value': 2502.07
            },

            {
                'name': '天荒地老',
                'value': 1614.03
            } ],
        'date': '2019-06-13-3'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5224.83
            },

            {
                'name': '一起幸福一起飞',
                'value': 4439.64
            },

            {
                'name': '动力火车',
                'value': 3901.29
            },

            {
                'name': '超级联盟',
                'value': 3751.91
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2784.57
            },

            {
                'name': '一起爱',
                'value': 2502.07
            },

            {
                'name': '天荒地老',
                'value': 1614.03
            } ],
        'date': '2019-06-13-4'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5224.83
            },

            {
                'name': '一起幸福一起飞',
                'value': 4439.64
            },

            {
                'name': '动力火车',
                'value': 3901.29
            },

            {
                'name': '超级联盟',
                'value': 3751.91
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2784.57
            },

            {
                'name': '一起爱',
                'value': 2502.07
            },

            {
                'name': '天荒地老',
                'value': 1614.03
            } ],
        'date': '2019-06-13-5'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5224.83
            },

            {
                'name': '一起幸福一起飞',
                'value': 4439.64
            },

            {
                'name': '动力火车',
                'value': 3901.29
            },

            {
                'name': '超级联盟',
                'value': 3751.91
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2784.57
            },

            {
                'name': '一起爱',
                'value': 2502.07
            },

            {
                'name': '天荒地老',
                'value': 1614.03
            } ],
        'date': '2019-06-13-6'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5226.92
            },

            {
                'name': '一起幸福一起飞',
                'value': 4461.75
            },

            {
                'name': '动力火车',
                'value': 3918.34
            },

            {
                'name': '超级联盟',
                'value': 3765.37
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2791.31
            },

            {
                'name': '一起爱',
                'value': 2502.07
            },

            {
                'name': '天荒地老',
                'value': 1628.91
            } ],
        'date': '2019-06-13-7'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5252.33
            },

            {
                'name': '一起幸福一起飞',
                'value': 4481.09
            },

            {
                'name': '动力火车',
                'value': 3938.04
            },

            {
                'name': '超级联盟',
                'value': 3805.98
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2830.81
            },

            {
                'name': '一起爱',
                'value': 2532.59
            },

            {
                'name': '天荒地老',
                'value': 1639.23
            } ],
        'date': '2019-06-13-8'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5301.57
            },

            {
                'name': '一起幸福一起飞',
                'value': 4519.55
            },

            {
                'name': '动力火车',
                'value': 3938.75
            },

            {
                'name': '超级联盟',
                'value': 3821.00
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2852.90
            },

            {
                'name': '一起爱',
                'value': 2550.47
            },

            {
                'name': '天荒地老',
                'value': 1639.85
            } ],
        'date': '2019-06-13-9'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5302.57
            },

            {
                'name': '一起幸福一起飞',
                'value': 4519.55
            },

            {
                'name': '动力火车',
                'value': 3945.71
            },

            {
                'name': '超级联盟',
                'value': 3821.00
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2864.90
            },

            {
                'name': '一起爱',
                'value': 2550.47
            },

            {
                'name': '天荒地老',
                'value': 1641.20
            } ],
        'date': '2019-06-13-10'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5302.78
            },

            {
                'name': '一起幸福一起飞',
                'value': 4519.55
            },

            {
                'name': '动力火车',
                'value': 3945.71
            },

            {
                'name': '超级联盟',
                'value': 3821.00
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2884.93
            },

            {
                'name': '一起爱',
                'value': 2551.41
            },

            {
                'name': '天荒地老',
                'value': 1641.20
            } ],
        'date': '2019-06-13-11'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5305.03
            },

            {
                'name': '一起幸福一起飞',
                'value': 4519.55
            },

            {
                'name': '动力火车',
                'value': 3946.13
            },

            {
                'name': '超级联盟',
                'value': 3821.00
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2885.04
            },

            {
                'name': '一起爱',
                'value': 2557.41
            },

            {
                'name': '天荒地老',
                'value': 1641.20
            } ],
        'date': '2019-06-13-12'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5306.24
            },

            {
                'name': '一起幸福一起飞',
                'value': 4519.86
            },

            {
                'name': '动力火车',
                'value': 3947.52
            },

            {
                'name': '超级联盟',
                'value': 3822.09
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2885.04
            },

            {
                'name': '一起爱',
                'value': 2557.41
            },

            {
                'name': '天荒地老',
                'value': 1641.20
            } ],
        'date': '2019-06-13-13'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5307.17
            },

            {
                'name': '一起幸福一起飞',
                'value': 4519.86
            },

            {
                'name': '动力火车',
                'value': 3947.52
            },

            {
                'name': '超级联盟',
                'value': 3825.76
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2886.65
            },

            {
                'name': '一起爱',
                'value': 2557.41
            },

            {
                'name': '天荒地老',
                'value': 1643.51
            } ],
        'date': '2019-06-13-14'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5314.54
            },

            {
                'name': '一起幸福一起飞',
                'value': 4519.86
            },

            {
                'name': '动力火车',
                'value': 3948.77
            },

            {
                'name': '超级联盟',
                'value': 3825.76
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2886.65
            },

            {
                'name': '一起爱',
                'value': 2557.41
            },

            {
                'name': '天荒地老',
                'value': 1643.51
            } ],
        'date': '2019-06-13-15'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5316.43
            },

            {
                'name': '一起幸福一起飞',
                'value': 4519.86
            },

            {
                'name': '动力火车',
                'value': 3948.77
            },

            {
                'name': '超级联盟',
                'value': 3825.76
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2887.46
            },

            {
                'name': '一起爱',
                'value': 2557.41
            },

            {
                'name': '天荒地老',
                'value': 1643.91
            } ],
        'date': '2019-06-13-16'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5316.43
            },

            {
                'name': '一起幸福一起飞',
                'value': 4519.86
            },

            {
                'name': '动力火车',
                'value': 3948.77
            },

            {
                'name': '超级联盟',
                'value': 3833.76
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2887.46
            },

            {
                'name': '一起爱',
                'value': 2557.41
            },

            {
                'name': '天荒地老',
                'value': 1644.19
            } ],
        'date': '2019-06-13-17'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5316.97
            },

            {
                'name': '一起幸福一起飞',
                'value': 4519.86
            },

            {
                'name': '动力火车',
                'value': 3953.64
            },

            {
                'name': '超级联盟',
                'value': 3835.42
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2887.46
            },

            {
                'name': '一起爱',
                'value': 2558.66
            },

            {
                'name': '天荒地老',
                'value': 1644.19
            } ],
        'date': '2019-06-13-18'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5316.97
            },

            {
                'name': '一起幸福一起飞',
                'value': 4527.13
            },

            {
                'name': '动力火车',
                'value': 3953.64
            },

            {
                'name': '超级联盟',
                'value': 3865.37
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2887.46
            },

            {
                'name': '一起爱',
                'value': 2558.66
            },

            {
                'name': '天荒地老',
                'value': 1644.19
            } ],
        'date': '2019-06-13-19'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5316.97
            },

            {
                'name': '一起幸福一起飞',
                'value': 4528.88
            },

            {
                'name': '动力火车',
                'value': 3956.66
            },

            {
                'name': '超级联盟',
                'value': 3865.37
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2887.46
            },

            {
                'name': '一起爱',
                'value': 2564.68
            },

            {
                'name': '天荒地老',
                'value': 1654.24
            } ],
        'date': '2019-06-13-20'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5323.58
            },

            {
                'name': '一起幸福一起飞',
                'value': 4552.31
            },

            {
                'name': '动力火车',
                'value': 3971.92
            },

            {
                'name': '超级联盟',
                'value': 3869.54
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2887.46
            },

            {
                'name': '一起爱',
                'value': 2566.37
            },

            {
                'name': '天荒地老',
                'value': 1655.49
            } ],
        'date': '2019-06-13-21'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5341.77
            },

            {
                'name': '一起幸福一起飞',
                'value': 4580.62
            },

            {
                'name': '动力火车',
                'value': 3972.70
            },

            {
                'name': '超级联盟',
                'value': 3869.54
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2893.47
            },

            {
                'name': '一起爱',
                'value': 2570.94
            },

            {
                'name': '天荒地老',
                'value': 1661.12
            } ],
        'date': '2019-06-13-22'
    },

    {
        'category': '2019-06-13',
        'data': [

            {
                'name': '行者无畏',
                'value': 5358.90
            },

            {
                'name': '一起幸福一起飞',
                'value': 4582.08
            },

            {
                'name': '动力火车',
                'value': 3973.69
            },

            {
                'name': '超级联盟',
                'value': 3871.97
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2893.47
            },

            {
                'name': '一起爱',
                'value': 2577.32
            },

            {
                'name': '天荒地老',
                'value': 1664.80
            } ],
        'date': '2019-06-13-23'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5359.52
            },

            {
                'name': '一起幸福一起飞',
                'value': 4594.08
            },

            {
                'name': '动力火车',
                'value': 3973.69
            },

            {
                'name': '超级联盟',
                'value': 3883.97
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2893.47
            },

            {
                'name': '一起爱',
                'value': 2578.56
            },

            {
                'name': '天荒地老',
                'value': 1673.18
            } ],
        'date': '2019-06-14-0'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5359.52
            },

            {
                'name': '一起幸福一起飞',
                'value': 4594.08
            },

            {
                'name': '动力火车',
                'value': 3973.69
            },

            {
                'name': '超级联盟',
                'value': 3889.72
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2893.47
            },

            {
                'name': '一起爱',
                'value': 2578.56
            },

            {
                'name': '天荒地老',
                'value': 1673.18
            } ],
        'date': '2019-06-14-1'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5359.52
            },

            {
                'name': '一起幸福一起飞',
                'value': 4594.08
            },

            {
                'name': '动力火车',
                'value': 3973.69
            },

            {
                'name': '超级联盟',
                'value': 3890.43
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2893.47
            },

            {
                'name': '一起爱',
                'value': 2578.56
            },

            {
                'name': '天荒地老',
                'value': 1673.18
            } ],
        'date': '2019-06-14-2'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5359.52
            },

            {
                'name': '一起幸福一起飞',
                'value': 4594.08
            },

            {
                'name': '动力火车',
                'value': 3973.69
            },

            {
                'name': '超级联盟',
                'value': 3890.43
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2893.47
            },

            {
                'name': '一起爱',
                'value': 2578.56
            },

            {
                'name': '天荒地老',
                'value': 1673.18
            } ],
        'date': '2019-06-14-3'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5359.52
            },

            {
                'name': '一起幸福一起飞',
                'value': 4594.08
            },

            {
                'name': '动力火车',
                'value': 3973.69
            },

            {
                'name': '超级联盟',
                'value': 3890.43
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2893.47
            },

            {
                'name': '一起爱',
                'value': 2578.56
            },

            {
                'name': '天荒地老',
                'value': 1673.18
            } ],
        'date': '2019-06-14-4'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5359.52
            },

            {
                'name': '一起幸福一起飞',
                'value': 4594.08
            },

            {
                'name': '动力火车',
                'value': 3973.69
            },

            {
                'name': '超级联盟',
                'value': 3890.43
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2893.47
            },

            {
                'name': '一起爱',
                'value': 2578.56
            },

            {
                'name': '天荒地老',
                'value': 1673.18
            } ],
        'date': '2019-06-14-5'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5359.52
            },

            {
                'name': '一起幸福一起飞',
                'value': 4594.08
            },

            {
                'name': '动力火车',
                'value': 3973.69
            },

            {
                'name': '超级联盟',
                'value': 3890.43
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2894.92
            },

            {
                'name': '一起爱',
                'value': 2578.56
            },

            {
                'name': '天荒地老',
                'value': 1673.18
            } ],
        'date': '2019-06-14-6'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5359.52
            },

            {
                'name': '一起幸福一起飞',
                'value': 4608.48
            },

            {
                'name': '动力火车',
                'value': 3987.40
            },

            {
                'name': '超级联盟',
                'value': 3917.00
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2894.92
            },

            {
                'name': '一起爱',
                'value': 2578.56
            },

            {
                'name': '天荒地老',
                'value': 1677.20
            } ],
        'date': '2019-06-14-7'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5377.82
            },

            {
                'name': '一起幸福一起飞',
                'value': 4609.13
            },

            {
                'name': '动力火车',
                'value': 4007.01
            },

            {
                'name': '超级联盟',
                'value': 3953.36
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2922.56
            },

            {
                'name': '一起爱',
                'value': 2599.55
            },

            {
                'name': '天荒地老',
                'value': 1683.47
            } ],
        'date': '2019-06-14-8'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5394.12
            },

            {
                'name': '一起幸福一起飞',
                'value': 4623.88
            },

            {
                'name': '动力火车',
                'value': 4028.26
            },

            {
                'name': '超级联盟',
                'value': 3988.01
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2933.08
            },

            {
                'name': '一起爱',
                'value': 2601.64
            },

            {
                'name': '天荒地老',
                'value': 1684.46
            } ],
        'date': '2019-06-14-9'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5403.50
            },

            {
                'name': '一起幸福一起飞',
                'value': 4623.88
            },

            {
                'name': '动力火车',
                'value': 4033.59
            },

            {
                'name': '超级联盟',
                'value': 3988.01
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2936.36
            },

            {
                'name': '一起爱',
                'value': 2601.64
            },

            {
                'name': '天荒地老',
                'value': 1692.52
            } ],
        'date': '2019-06-14-10'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5404.25
            },

            {
                'name': '一起幸福一起飞',
                'value': 4624.41
            },

            {
                'name': '动力火车',
                'value': 4038.75
            },

            {
                'name': '超级联盟',
                'value': 3988.01
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2937.22
            },

            {
                'name': '一起爱',
                'value': 2604.38
            },

            {
                'name': '天荒地老',
                'value': 1692.52
            } ],
        'date': '2019-06-14-11'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5406.85
            },

            {
                'name': '一起幸福一起飞',
                'value': 4624.41
            },

            {
                'name': '动力火车',
                'value': 4038.75
            },

            {
                'name': '超级联盟',
                'value': 3988.01
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2937.22
            },

            {
                'name': '一起爱',
                'value': 2604.38
            },

            {
                'name': '天荒地老',
                'value': 1692.52
            } ],
        'date': '2019-06-14-12'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5409.88
            },

            {
                'name': '一起幸福一起飞',
                'value': 4624.41
            },

            {
                'name': '动力火车',
                'value': 4038.75
            },

            {
                'name': '超级联盟',
                'value': 3989.58
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2943.12
            },

            {
                'name': '一起爱',
                'value': 2604.38
            },

            {
                'name': '天荒地老',
                'value': 1692.52
            } ],
        'date': '2019-06-14-13'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5412.48
            },

            {
                'name': '一起幸福一起飞',
                'value': 4624.41
            },

            {
                'name': '动力火车',
                'value': 4041.27
            },

            {
                'name': '超级联盟',
                'value': 3996.33
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2943.61
            },

            {
                'name': '一起爱',
                'value': 2605.35
            },

            {
                'name': '天荒地老',
                'value': 1692.52
            } ],
        'date': '2019-06-14-14'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5415.97
            },

            {
                'name': '一起幸福一起飞',
                'value': 4632.49
            },

            {
                'name': '动力火车',
                'value': 4041.27
            },

            {
                'name': '超级联盟',
                'value': 3996.45
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2943.61
            },

            {
                'name': '一起爱',
                'value': 2605.35
            },

            {
                'name': '天荒地老',
                'value': 1697.46
            } ],
        'date': '2019-06-14-15'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5416.72
            },

            {
                'name': '一起幸福一起飞',
                'value': 4633.50
            },

            {
                'name': '动力火车',
                'value': 4041.27
            },

            {
                'name': '超级联盟',
                'value': 3996.84
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2943.61
            },

            {
                'name': '一起爱',
                'value': 2606.17
            },

            {
                'name': '天荒地老',
                'value': 1697.46
            } ],
        'date': '2019-06-14-16'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5420.25
            },

            {
                'name': '一起幸福一起飞',
                'value': 4633.57
            },

            {
                'name': '动力火车',
                'value': 4041.27
            },

            {
                'name': '超级联盟',
                'value': 3996.84
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2943.61
            },

            {
                'name': '一起爱',
                'value': 2606.17
            },

            {
                'name': '天荒地老',
                'value': 1699.86
            } ],
        'date': '2019-06-14-17'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5425.54
            },

            {
                'name': '一起幸福一起飞',
                'value': 4637.56
            },

            {
                'name': '动力火车',
                'value': 4044.00
            },

            {
                'name': '超级联盟',
                'value': 4028.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2943.61
            },

            {
                'name': '一起爱',
                'value': 2609.62
            },

            {
                'name': '天荒地老',
                'value': 1699.86
            } ],
        'date': '2019-06-14-18'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5437.04
            },

            {
                'name': '一起幸福一起飞',
                'value': 4640.63
            },

            {
                'name': '动力火车',
                'value': 4044.50
            },

            {
                'name': '超级联盟',
                'value': 4028.19
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2943.61
            },

            {
                'name': '一起爱',
                'value': 2610.91
            },

            {
                'name': '天荒地老',
                'value': 1699.86
            } ],
        'date': '2019-06-14-19'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5452.93
            },

            {
                'name': '一起幸福一起飞',
                'value': 4659.19
            },

            {
                'name': '超级联盟',
                'value': 4046.15
            },

            {
                'name': '动力火车',
                'value': 4044.50
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2946.62
            },

            {
                'name': '一起爱',
                'value': 2610.91
            },

            {
                'name': '天荒地老',
                'value': 1699.86
            } ],
        'date': '2019-06-14-20'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5458.54
            },

            {
                'name': '一起幸福一起飞',
                'value': 4663.19
            },

            {
                'name': '超级联盟',
                'value': 4046.15
            },

            {
                'name': '动力火车',
                'value': 4044.50
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2946.62
            },

            {
                'name': '一起爱',
                'value': 2610.91
            },

            {
                'name': '天荒地老',
                'value': 1699.86
            } ],
        'date': '2019-06-14-21'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5462.11
            },

            {
                'name': '一起幸福一起飞',
                'value': 4693.02
            },

            {
                'name': '超级联盟',
                'value': 4057.32
            },

            {
                'name': '动力火车',
                'value': 4047.63
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2949.68
            },

            {
                'name': '一起爱',
                'value': 2614.93
            },

            {
                'name': '天荒地老',
                'value': 1704.99
            } ],
        'date': '2019-06-14-22'
    },

    {
        'category': '2019-06-14',
        'data': [

            {
                'name': '行者无畏',
                'value': 5462.11
            },

            {
                'name': '一起幸福一起飞',
                'value': 4726.10
            },

            {
                'name': '超级联盟',
                'value': 4057.32
            },

            {
                'name': '动力火车',
                'value': 4056.81
            },

            {
                'name': 'E马当先健康乐跑',
                'value': 2949.68
            },

            {
                'name': '一起爱',
                'value': 2616.08
            },

            {
                'name': '天荒地老',
                'value': 1704.99
            } ],
        'date': '2019-06-14-23'
    }

];

var title = '动态排名变化';
var playInterval = 50;
unit = {
    '0': '',
    '1': '万',
    '2': '亿',
    '3': '兆'
};
// 千分位
function formatNum(strNum) {
    if (Math.round(strNum) <= 10 && strNum.length <= 3) {
        return strNum;
    }
    u0 = 0
    while (Math.round(strNum) > 1000000 && u0 < 3) {
        strNum = Math.round(Math.round(strNum) / 10000);
        u0 = u0 + 1
    }

    if (!/^(\+|-)?(\d+)(\.\d+)?$/.test(strNum)) {
        return strNum;
    }
    var a = RegExp.$1,
        b = RegExp.$2,
        c = RegExp.$3;
    var re = new RegExp();
    re.compile("(\\d)(\\d{3})(,|$)");
    while (re.test(b)) {
        b = b.replace(re, "$1,$2$3");
    }
    return a + "" + b + "" + c + unit[String(u0)];
}
// 排行颜色
var colorListMapping = {
    '广东': '#7711AF',
    '山东': '#CF77FF',
    '浙江': '#AE004F',
    '上海': '#F35872',
    '北京': '#FA7729',
    '江苏': '#FFC526',
    '安徽': '#F8E71C',
    '四川': '#34ADAE',
    '湖北': '#3DDFD2',
    '河北': '#A0FFFF',
    '湖南': '#7711AF',
    '福建': '#CF77FF',
    '河南': '#7711AF',
    '广西': '#CF77FF',
    '陕西': '#AE004F',
    '云南': '#F35872',
    '江西': '#FA7729',
    '天津': '#FFC526',
    '重庆': '#F8E71C',
    '山西': '#34ADAE',
    '辽宁': '#3DDFD2',
    '贵州': '#A0FFFF',
    '甘肃': '#7711AF',
    '内蒙古': '#CF77FF',
    '海南': '#7711AF',
    '黑龙江': '#CF77FF',
    '吉林': '#AE004F',
    '宁夏': '#F35872',
    '新疆': '#FA7729',
    '青海': '#FFC526'
};
var colorListS1 = [];
var colors = []
for (var key in colorListMapping) {
    colors.push(colorListMapping[key])
}
for (var i = 0; i < rankData.length; i++) {
    var colorListF1 = {};
    for (var n = 0; n < rankData[i].data.length; n++) {
        var name = rankData[i].data[n].name;
        colorListF1[name] = colors[n];
    }
    colorListS1[i] = colorListF1;
}
// 基础设置
var option = {
    baseOption: {
        animationDurationUpdate: playInterval * 1.5,
        animationEasingUpdate: 'quinticInOut',
        timeline: {
            show: false,
            axisType: 'category',
            orient: 'vertical',
            autoPlay: true,
            loop: false,
            playInterval: playInterval,
            left: null,
            right: 30,
            top: 330,
            bottom: 100,
            height: null,
            label: {
                normal: {
                    show: true,
                    interval: 0
                }
            },
            symbol: 'none',
            lineStyle: {
                color: '#ccc',
                show: false
            },
            checkpointStyle: {
                symbol: 'none',
                color: '#bbb',
                borderColor: '#777',
                show: false,
                borderWidth: 1
            },
            controlStyle: {
                showNextBtn: false,
                showPrevBtn: false,
                normal: {
                    color: '#666',
                    show: false,
                    borderColor: '#666'
                },
                emphasis: {
                    color: '#aaa',
                    borderColor: '#aaa'
                }
            },
            data: rankData.map(function(ele) {
                return ele.date
            })
        },
        title: [{
            left: 'center',
            top: '3%',
            textStyle: {
                fontSize: 25,
                color: 'rgba(121,121,121, 0.9)'
            }
        }, {
            left: 'center',
            top: '5%'
        }],
        grid: [{
            left: '20%',
            right: '20%',
            top: '12%',
            height: 'auto',
            bottom: '25%'
        }],
        xAxis: [{

        }],
        yAxis: [{

        }],
        series: [{
            id: 'bar',
            type: 'bar',
            barWidth: '20',
            tooltip: {
                show: false
            },
            label: {
                normal: {
                    show: true,
                    position: 'right'
                }
            },
            data: []
        }]
    },
    options: []
};
var xMaxInterval = 5;
for (var i = 0; i < rankData.length; i++) {
    var xMax = 20;
    if (rankData[i].data[0].value > 20) {
        xMax = 'dataMax'
    }
    if (rankData[i].data[0].value / xMaxInterval >= 10) {
        xMaxInterval = rankData[i].data[0].value / 5
    }
    option.options.push({
        backgroundColor: new echarts.graphic.RadialGradient(0.3, 0.3, 0.8, [{
            offset: 0,
            color: '#f7f8fa'
        }, {
            offset: 1,
            color: '#cdd0d5'
        }]),
        title: {
            text: title + ' ' + rankData[i].category,
            color: '#bfbfbf'
        },
        xAxis: [{
            show: true,
            type: 'value',
            interval: xMaxInterval,
            max: xMax,
            axisTick: {
                show: false
            },
            axisLabel: {
                show: true,
                color: 'rgba(121,121,121,0.9)',
                formatter: function(value, index) {
                    // 空一格显示一次坐标值
                    if (index % 2 === 0) {
                        u = 0
                        while (value > 100000 && u < 3) {
                            value = Math.round(value / 10000);
                            u = u + 1
                        }
                        return String(value) + unit[String(u)]
                    } else {
                        return '';
                    }
                },
                textStyle: {
                    color: 'rgba(121,121,121,0.9)'
                }
            },
            axisLine: {
                show: false,
                lineStyle: {
                    color: 'rgba(121,121,121,0.3)'
                }
            },
            splitLine: {
                show: true,
                lineStyle: {
                    color: ['rgba(121,121,121,0.3)', 'rgba(121,121,121,0)']
                }
            }
        }],
        yAxis: [{
            type: 'category',
            axisTick: {
                show: false
            },
            axisLine: {
                show: true,
                lineStyle: {
                    color: 'rgba(121,121,121,0.3)'
                }
            },
            axisLabel: {
                show: false,
                textStyle: {}
            },
            data: rankData[i].data.map(function(ele) {
                return ele.name
            }).reverse()
        }],
        series: [{
            id: 'bar',
            itemStyle: {
                normal: {
                    color: function(params) {
                        var colorList = [
                            '#7711AF', '#CF77FF', '#AE004F', '#F35872', '#FA7729',
                            '#FFC526', '#F8E71C', '#34ADAE', '#3DDFD2', '#A0FFFF'
                        ];
                        var colorListr = [
                            '#0f4471',
                            '#00adb5',
                            '#ff5722',
                            '#5628b4',
                            '#20BF55',
                            '#f23557',
                            '#118df0',
                            '#11cbd7',
                            '#d3327b',
                            '#ae318a',
                            '#993090',
                            '#6f3071'
                        ];
                        return colorListr[params.dataIndex]
                    },
                    label: {
                        show: true,
                        position: 'top',
                        formatter: '{c}%'
                    },
                    shadowBlur: 20,
                    shadowColor: 'rgba(40, 40, 40, 0.5)',
                }
            },
            label: {
                normal: {
                    position: 'right',
                    formatter: function(p) {
                        return p.name + ": " + formatNum(p.value);
                    }
                }
            },
            data: rankData[i].data.map(function(ele) {
                return ele.value
            }).sort(function(a, b) {
                return a > b
            })
        }]
    })
}