option = {
    title: {
        text: 'Awesome Chart',
    },
    xAxis: {
        data: ['宝塔区','兰山区','寿光市','东宝区','鹤庆县','宝清县','曲水县','泗阳县','临泽县','广德市','隆昌市','吴江区','高淳区','米易县','崇州市','昌宁县','新郑市','应城市','兰考县','景宁县','太湖县','德清县','卧龙区','梁平区','建宁县','文昌市','岳阳县','潮安区','盘山县','焉耆县','嘉善县','湾沚区','綦江区','远安县','左权县','秀屿区','鹿泉区','阳朔县','高安市','德安县','津市市','泾源县','从化区','娄星区','南安市','乐安县','兰西县','永胜县','喀左县','龙里县','合浦县','兴安县','敦化市','黔西县','湟中区'],
    },
    yAxis: {},
    series: [
        {
            type: 'bar',
            data: [100,100,100,93,92,91,90,86,86,86,85,85,84,84,83,83,83,82,82,81,81,81,81,80,80,79,77,77,76,76,76,76,75,75,75,74,74,73,72,69,67,67,67,65,64,62,58,58,58,57,51,49,47,41,40],
        },
    ],
};
