option = {
     "color": [
            "#516b91",
            "#59c4e6",
            "#edafda",
            "#93b7e3",
            "#a5e7f0",
            "#cbb0e3"
        ],
    xAxis: {
        type: 'category',
        data: ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月']
    },
    legend: {
        left: 'left',
        data: ['门店', '线上总计', '第三方']
    },
    yAxis: {
        type: 'value'
    },
    tooltip: {
        trigger: 'item',
        formatter: '{a} <br/>{b} : {c}'
    },
    series: [{
        name: '门店',
        data: [0.082, 0.0532, 0.0301, 0.0534, 0.0490, 0.0330, 0.0520, 0.0301, 0.0534, 0.0490,0.082, 0.0532],
        type: 'line'
    },{
        name: '线上总计',
        data: [0.0800, 0.0732, 0.0901, 0.0934, 0.1290, 0.1330, 0.1320, 0.0934, 0.1290, 0.1330, 0.1320, 0.1320],
        type: 'line'
    },{
        name: '第三方',
        data: [0.0790, 0.0832, 0.0801, 0.0834, 0.1290, 0.0930, 0.0920, 0.0801, 0.0834, 0.1290, 0.0930, 0.0920],
        type: 'line'
    }]
};
