 var years = ['15年6月', '15年7月', '15年8月', '15年9月', '15年10月', '15年11月', '15年12月', '16年1月', '16年2月', '16年3月', '16年4月', '16年5月', '16年6月', '16年7月', '16年8月', '16年9月', '16年10月', '16年11月', '16年12月', '17年1月', '17年2月', '17年3月', '17年4月', '17年5月', '17年6月', '17年7月', '17年8月', '17年9月', '17年10月', '17年11月', '17年12月', '18年1月', '18年2月', '18年3月', '18年4月', '18年5月', '18年6月', '18年7月', '18年8月', '18年9月', '18年10月', '18年11月', '18年12月', '19年1月', '19年2月', '19年3月', '19年4月', '19年5月', '19年6月', '19年7月', '19年8月', '19年9月', '19年10月', '19年11月', '19年12月', '20年1月', '20年2月', '20年3月', '20年4月', '20年5月', '20年6月', '20年7月', '20年8月', '20年9月'];
 var jdData = [
     ['东莞', '佛山', '广州', '惠州', '江门', '中山', '珠海', '深圳', '福州', '厦门', '武汉', '南宁', '阳江', '揭阳', '茂名', '梅州', '普宁', '汕尾', '湘潭', '清远', '湛江', '郴州', '岳阳', '长沙', '汕头', '衡阳', '南京', '苏州', '无锡', '贵阳', '常州', '合肥', '宁波', '杭州', '海口', '上海', '三亚', '常德', '北京', '哈尔滨', '郑州', '天津', '烟台', '青岛', '大连', '成都', '长春', '沈阳', '重庆', '西安'],
     ['东莞', '佛山', '广州', '惠州', '江门', '中山', '珠海', '深圳'],
     ['东莞', '佛山', '广州', '惠州', '江门', '中山', '珠海', '深圳'],
     ['东莞', '佛山', '广州', '惠州', '江门', '中山', '珠海', '深圳'],
     ['东莞', '佛山', '广州', '惠州', '江门', '中山', '珠海', '深圳'],
     ['东莞', '佛山', '广州', '惠州', '江门', '中山', '珠海', '深圳'],
     ['东莞', '佛山', '广州', '惠州', '江门', '中山', '珠海', '深圳'],
     ['东莞', '佛山', '广州', '惠州', '江门', '南宁', '阳江', '中山', '珠海', '武汉', '深圳', '福州', '厦门'],
     ['东莞', '佛山', '广州', '惠州', '江门', '揭阳', '茂名', '梅州', '普宁', '汕尾', '阳江', '中山', '珠海', '武汉', '湘潭', '深圳', '福州', '厦门'],
     ['东莞', '佛山', '广州', '惠州', '江门', '揭阳', '茂名', '梅州', '南宁', '普宁', '清远', '汕尾', '阳江', '湛江', '中山', '珠海', '郴州', '武汉', '湘潭', '岳阳', '长沙', '深圳', '福州', '厦门'],
     ['东莞', '佛山', '广州', '惠州', '江门', '揭阳', '梅州', '南宁', '普宁', '清远', '汕头', '阳江', '湛江', '中山', '珠海', '郴州', '武汉', '湘潭', '岳阳', '长沙', '深圳', '福州', '厦门'],
     ['东莞', '佛山', '广州', '惠州', '江门', '揭阳', '梅州', '南宁', '普宁', '清远', '汕头', '阳江', '湛江', '中山', '珠海', '郴州', '衡阳', '武汉', '湘潭', '岳阳', '长沙', '深圳', '福州', '厦门'],
     ['东莞', '佛山', '广州', '惠州', '江门', '南宁', '清远', '汕头', '湛江', '中山', '珠海', '郴州', '衡阳', '武汉', '湘潭', '岳阳', '长沙', '深圳', '厦门'],
     ['东莞', '佛山', '广州', '惠州', '江门', '南宁', '清远', '汕头', '湛江', '中山', '珠海', '郴州', '衡阳', '武汉', '湘潭', '岳阳', '长沙', '深圳', '福州', '厦门'],
     ['东莞', '佛山', '广州', '惠州', '江门', '南宁', '清远', '湛江', '中山', '珠海', '南京', '苏州', '无锡', '郴州', '衡阳', '武汉', '湘潭', '岳阳', '长沙', '深圳', '贵阳', '福州', '厦门'],
     ['东莞', '佛山', '广州', '惠州', '江门', '南宁', '清远', '湛江', '中山', '珠海', '常州', '合肥', '南京', '苏州', '无锡', '衡阳', '武汉', '湘潭', '岳阳', '长沙', '深圳', '贵阳', '福州', '宁波', '厦门'],
     ['东莞', '佛山', '广州', '惠州', '江门', '南宁', '清远', '湛江', '中山', '珠海', '常州', '南京', '苏州', '无锡', '武汉', '湘潭', '岳阳', '长沙', '深圳', '贵阳', '福州', '杭州', '宁波', '厦门'],
     ['东莞', '佛山', '广州', '惠州', '江门', '南宁', '清远', '湛江', '中山', '珠海', '常州', '合肥', '南京', '苏州', '无锡', '武汉', '湘潭', '岳阳', '长沙', '深圳', '福州', '杭州', '宁波', '厦门'],
     ['东莞', '佛山', '广州', '海口', '惠州', '江门', '南宁', '清远', '中山', '珠海', '常州', '合肥', '南京', '苏州', '无锡', '武汉', '湘潭', '岳阳', '长沙', '深圳', '福州', '杭州', '宁波', '厦门'],
     ['广州', '东莞', '惠州', '佛山', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '合肥', '中山', '珠海', '海口', '江门', '南宁', '清远', '武汉', '长沙', '厦门', '福州', '岳阳', '湘潭', '贵阳', '深圳'],
     ['广州', '东莞', '惠州', '佛山', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '合肥', '中山', '珠海', '海口', '江门', '南宁', '清远', '武汉', '长沙', '厦门', '福州', '岳阳', '湘潭', '贵阳', '深圳'],
     ['广州', '东莞', '惠州', '佛山', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '合肥', '中山', '珠海', '海口', '江门', '南宁', '清远', '武汉', '长沙', '厦门', '福州', '岳阳', '湘潭', '上海', '深圳'],
     ['广州', '东莞', '惠州', '佛山', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '合肥', '中山', '珠海', '三亚', '江门', '清远', '武汉', '长沙', '厦门', '福州', '常德', '岳阳', '湘潭', '上海', '深圳'],
     ['北京', '哈尔滨', '广州', '东莞', '惠州', '佛山', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '合肥', '中山', '珠海', '三亚', '武汉', '长沙', '厦门', '福州', '岳阳', '湘潭', '上海', '深圳'],
     ['北京', '广州', '东莞', '惠州', '佛山', '郑州', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '合肥', '中山', '珠海', '三亚', '江门', '武汉', '长沙', '厦门', '福州', '岳阳', '湘潭', '上海', '深圳'],
     ['北京', '哈尔滨', '天津', '广州', '东莞', '惠州', '佛山', '烟台', '青岛', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '合肥', '中山', '珠海', '武汉', '长沙', '厦门', '福州', '岳阳', '上海', '深圳'],
     ['北京', '天津', '大连', '广州', '东莞', '惠州', '佛山', '烟台', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '合肥', '中山', '武汉', '长沙', '厦门', '福州', '岳阳', '成都', '上海', '深圳'],
     ['北京', '哈尔滨', '大连', '广州', '东莞', '惠州', '烟台', '青岛', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '合肥', '中山', '珠海', '武汉', '长沙', '厦门', '福州', '岳阳', '成都', '上海', '深圳'],
     ['北京', '哈尔滨', '大连', '广州', '东莞', '惠州', '烟台', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '中山', '珠海', '武汉', '长沙', '厦门', '福州', '成都', '上海', '深圳'],
     ['北京', '哈尔滨', '大连', '广州', '东莞', '惠州', '烟台', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '中山', '珠海', '海口', '三亚', '武汉', '长沙', '厦门', '福州', '岳阳', '成都', '上海', '深圳'],
     ['北京', '哈尔滨', '大连', '广州', '惠州', '烟台', '青岛', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '中山', '三亚', '武汉', '长沙', '厦门', '福州', '成都', '上海', '深圳'],
     ['北京', '哈尔滨', '天津', '长春', '沈阳', '大连', '广州', '惠州', '郑州', '烟台', '青岛', '苏州', '杭州', '南京', '常州', '无锡', '中山', '三亚', '武汉', '长沙', '厦门', '福州', '成都', '上海', '深圳'],
     ['北京', '哈尔滨', '天津', '长春', '沈阳', '大连', '广州', '惠州', '郑州', '烟台', '苏州', '杭州', '南京', '常州', '无锡', '三亚', '武汉', '长沙', '厦门', '福州', '常德', '岳阳', '成都', '上海', '深圳'],
     ['北京', '哈尔滨', '长春', '沈阳', '大连', '广州', '东莞', '惠州', '郑州', '烟台', '苏州', '杭州', '南京', '常州', '无锡', '中山', '三亚', '武汉', '长沙', '厦门', '福州', '成都', '重庆', '上海', '深圳'],
     ['北京', '哈尔滨', '天津', '长春', '沈阳', '大连', '广州', '东莞', '惠州', '郑州', '西安', '烟台', '苏州', '杭州', '南京', '常州', '无锡', '中山', '武汉', '长沙', '厦门', '福州', '成都', '上海', '深圳'],
     ['北京', '哈尔滨', '天津', '长春', '沈阳', '广州', '东莞', '惠州', '佛山', '郑州', '西安', '烟台', '苏州', '杭州', '南京', '常州', '无锡', '武汉', '长沙', '厦门', '福州', '成都', '重庆', '上海', '深圳'],
     ['北京', '哈尔滨', '天津', '长春', '沈阳', '大连', '广州', '东莞', '惠州', '佛山', '郑州', '西安', '苏州', '杭州', '南京', '常州', '无锡', '武汉', '长沙', '厦门', '福州', '成都', '重庆', '上海', '深圳'],
     ['北京', '哈尔滨', '天津', '长春', '沈阳', '广州', '东莞', '惠州', '佛山', '郑州', '西安', '烟台', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '武汉', '长沙', '厦门', '成都', '重庆', '上海', '深圳'],
     ['北京', '哈尔滨', '天津', '沈阳', '广州', '东莞', '惠州', '郑州', '西安', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '中山', '武汉', '长沙', '厦门', '福州', '成都', '重庆', '贵阳', '上海', '深圳'],
     ['北京', '哈尔滨', '天津', '沈阳', '大连', '广州', '东莞', '惠州', '郑州', '西安', '烟台', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '武汉', '长沙', '厦门', '福州', '成都', '重庆', '上海', '深圳'],
     ['北京', '哈尔滨', '天津', '沈阳', '大连', '广州', '东莞', '郑州', '西安', '烟台', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '中山', '武汉', '长沙', '厦门', '福州', '成都', '重庆', '上海', '深圳'],
     ['北京', '哈尔滨', '天津', '长春', '沈阳', '大连', '广州', '东莞', '西安', '烟台', '苏州', '杭州', '南京', '常州', '无锡', '宁波', '三亚', '武汉', '长沙', '厦门', '福州', '成都', '重庆', '上海', '深圳'],
     ['北京', '哈尔滨', '天津', '长春', '沈阳', '大连', '广州', '东莞', '郑州', '西安', '烟台', '苏州', '杭州', '南京', '常州', '中山', '三亚', '武汉', '长沙', '厦门', '福州', '成都', '重庆', '上海', '深圳'],
     ['北京', '哈尔滨', '天津', '大连', '沈阳', '长春', '广州', '三亚', '西安', '烟台', '郑州', '南京', '苏州', '杭州', '常州', '无锡', '武汉', '厦门', '长沙', '福州', '上海', '深圳', '重庆', '成都', '贵阳'],
     ['北京', '哈尔滨', '天津', '大连', '沈阳', '长春', '广州', '三亚', '西安', '烟台', '青岛', '郑州', '南京', '苏州', '杭州', '常州', '无锡', '武汉', '厦门', '长沙', '上海', '深圳', '重庆', '成都', '贵阳'],
     ['北京', '哈尔滨', '天津', '大连', '沈阳', '长春', '广州', '佛山', '西安', '烟台', '郑州', '南京', '苏州', '杭州', '常州', '无锡', '宁波', '武汉', '厦门', '长沙', '上海', '深圳', '重庆', '成都'],
     ['北京', '哈尔滨', '天津', '大连', '沈阳', '长春', '广州', '佛山', '西安', '烟台', '郑州', '南京', '苏州', '杭州', '常州', '无锡', '武汉', '厦门', '长沙', '福州', '上海', '深圳', '重庆', '成都'],
     ['北京', '哈尔滨', '天津', '大连', '沈阳', '长春', '广州', '佛山', '西安', '烟台', '青岛', '南京', '苏州', '杭州', '常州', '无锡', '武汉', '厦门', '长沙', '福州', '上海', '深圳', '重庆', '成都'],
     ['北京', '哈尔滨', '天津', '大连', '沈阳', '长春', '广州', '佛山', '东莞', '西安', '烟台', '南京', '苏州', '杭州', '常州', '无锡', '武汉', '厦门', '长沙', '福州', '上海', '深圳', '重庆', '成都'],
     ['北京', '哈尔滨', '天津', '大连', '沈阳', '长春', '广州', '佛山', '西安', '烟台', '青岛', '南京', '苏州', '杭州', '常州', '无锡', '武汉', '厦门', '长沙', '福州', '上海', '深圳', '重庆', '成都'],
     ['北京', '哈尔滨', '天津', '大连', '沈阳', '广州', '佛山', '东莞', '西安', '烟台', '青岛', '南京', '苏州', '杭州', '常州', '无锡', '武汉', '厦门', '长沙', '福州', '上海', '深圳', '重庆', '成都'],
     ['北京', '哈尔滨', '天津', '大连', '沈阳', '长春', '广州', '佛山', '西安', '烟台', '青岛', '南京', '苏州', '杭州', '常州', '无锡', '武汉', '厦门', '长沙', '福州', '上海', '深圳', '重庆', '成都'],
     ['北京', '常州', '成都', '大连', '东莞', '佛山', '福州', '广州', '哈尔滨', '杭州', '南京', '厦门', '上海', '深圳', '沈阳', '苏州', '天津', '无锡', '武汉', '西安', '烟台', '长春', '长沙', '重庆'],
     ['北京', '常州', '成都', '大连', '佛山', '福州', '广州', '哈尔滨', '杭州', '南京', '青岛', '厦门', '上海', '深圳', '沈阳', '苏州', '天津', '无锡', '武汉', '西安', '烟台', '长春', '长沙', '重庆'],
     ['北京', '常州', '成都', '大连', '佛山', '福州', '广州', '哈尔滨', '杭州', '南京', '青岛', '厦门', '上海', '深圳', '沈阳', '苏州', '天津', '无锡', '武汉', '西安', '烟台', '长春', '长沙', '重庆'],
     ['北京', '大连', '哈尔滨', '青岛', '沈阳', '天津', '西安', '烟台', '长春', '郑州', '广州', '三亚', '常州', '南京', '苏州', '无锡', '武汉', '长沙', '上海', '深圳', '成都', '重庆', '福州', '杭州', '厦门'],
     ['北京', '大连', '哈尔滨', '青岛', '沈阳', '天津', '西安', '烟台', '长春', '佛山', '广州', '三亚', '常州', '南京', '苏州', '武汉', '长沙', '上海', '深圳', '成都', '贵阳', '重庆', '福州', '杭州', '厦门'],
     ['北京', '大连', '哈尔滨', '青岛', '沈阳', '天津', '西安', '烟台', '长春', '佛山', '广州', '三亚', '常州', '南京', '苏州', '无锡', '武汉', '长沙', '上海', '深圳', '成都', '重庆', '福州', '杭州', '厦门'],
     ['北京', '大连', '哈尔滨', '青岛', '沈阳', '天津', '西安', '烟台', '长春', '东莞', '佛山', '广州', '常州', '南京', '苏州', '无锡', '武汉', '长沙', '上海', '深圳', '成都', '重庆', '福州', '杭州', '厦门'],
     ['北京', '大连', '哈尔滨', '青岛', '沈阳', '天津', '西安', '烟台', '长春', '佛山', '广州', '常州', '南京', '苏州', '无锡', '武汉', '长沙', '上海', '深圳', '成都', '重庆', '福州', '杭州', '宁波', '厦门'],
     ['北京', '大连', '哈尔滨', '青岛', '沈阳', '天津', '西安', '烟台', '长春', '佛山', '广州', '常州', '南京', '苏州', '无锡', '武汉', '长沙', '上海', '深圳', '成都', '重庆', '福州', '杭州', '宁波', '厦门'],
     ['北京', '大连', '哈尔滨', '青岛', '沈阳', '天津', '西安', '烟台', '长春', '佛山', '广州', '常州', '南京', '苏州', '无锡', '武汉', '长沙', '上海', '深圳', '成都', '重庆', '福州', '杭州', '宁波', '厦门'],
     ['北京', '哈尔滨', '青岛', '沈阳', '天津', '西安', '烟台', '长春', '东莞', '佛山', '广州', '常州', '南京', '苏州', '无锡', '武汉', '长沙', '上海', '深圳', '成都', '重庆', '福州', '杭州', '宁波', '厦门'],
     ['北京', '大连', '哈尔滨', '青岛', '沈阳', '天津', '西安', '烟台', '东莞', '佛山', '广州', '常州', '南京', '苏州', '无锡', '武汉', '长沙', '上海', '深圳', '成都', '重庆', '福州', '杭州', '宁波', '厦门'],
 ]
 var data = [
     [3, 2, 31, 1, 0, 3, 1, 1],
     [5, 8, 46, 2, 0, 7, 7, 13],
     [11, 10, 59, 3, 2, 10, 6, 30],
     [9, 11, 82, 3, 3, 18, 9, 50],
     [9, 10, 83, 3, 4, 18, 6, 66],
     [12, 10, 76, 3, 6, 21, 8, 71],
     [12, 17, 102, 2, 8, 23, 8, 71],
     [8, 13, 98, 4, 9, 1, 2, 18, 7, 2, 63, 1, 1],
     [7, 10, 102, 3, 6, 1, 1, 1, 1, 1, 1, 18, 8, 7, 1, 58, 1, 1],
     [17, 17, 205, 3, 10, 1, 1, 3, 8, 2, 3, 1, 2, 2, 19, 10, 3, 28, 9, 5, 8, 95, 3, 5],
     [18, 17, 152, 5, 9, 1, 2, 6, 1, 3, 1, 2, 3, 25, 16, 3, 23, 7, 8, 26, 113, 2, 4],
     [12, 15, 146, 5, 10, 1, 2, 8, 1, 6, 1, 1, 4, 25, 14, 3, 1, 39, 6, 9, 27, 111, 1, 4],
     [11, 10, 132, 2, 11, 6, 4, 1, 3, 22, 13, 3, 3, 32, 5, 12, 38, 104, 13],
     [7, 10, 134, 6, 13, 16, 4, 1, 3, 28, 15, 3, 5, 37, 6, 17, 40, 104, 1, 19],
     [8, 8, 166, 8, 11, 11, 6, 3, 28, 18, 3, 2, 2, 2, 4, 42, 6, 18, 39, 113, 5, 4, 22],
     [5, 10, 113, 9, 10, 8, 5, 3, 21, 18, 5, 4, 7, 11, 6, 3, 45, 5, 14, 31, 123, 8, 10, 3, 26],
     [5, 11, 146, 11, 11, 9, 5, 4, 20, 16, 8, 8, 13, 8, 45, 5, 15, 38, 134, 4, 16, 6, 5, 31],
     [13, 8, 128, 11, 11, 14, 6, 4, 13, 14, 8, 4, 9, 13, 9, 42, 4, 13, 42, 141, 16, 5, 5, 35],
     [10, 7, 109, 4, 10, 8, 8, 6, 13, 14, 7, 4, 9, 12, 7, 40, 4, 10, 37, 135, 14, 7, 5, 29],
     [157, 7, 15, 9, 16, 9, 14, 10, 12, 9, 5, 15, 19, 6, 11, 8, 7, 46, 44, 32, 18, 14, 8, 6, 136],
     [158, 17, 17, 14, 18, 14, 18, 12, 13, 8, 8, 10, 26, 6, 12, 8, 8, 69, 51, 38, 21, 20, 7, 7, 159],
     [172, 18, 20, 17, 30, 23, 30, 17, 18, 12, 11, 16, 25, 8, 14, 9, 8, 68, 60, 45, 22, 21, 11, 41, 189],
     [230, 18, 19, 19, 33, 24, 35, 22, 20, 15, 12, 30, 20, 11, 11, 9, 81, 54, 45, 24, 10, 22, 15, 55, 192],
     [15, 14, 193, 22, 25, 22, 40, 30, 38, 24, 21, 20, 15, 31, 21, 14, 99, 70, 56, 31, 23, 16, 85, 219],
     [29, 219, 21, 33, 24, 13, 42, 40, 45, 30, 25, 22, 18, 37, 22, 13, 15, 98, 63, 57, 34, 20, 13, 110, 231],
     [46, 21, 21, 228, 22, 33, 24, 28, 21, 51, 49, 54, 32, 28, 24, 22, 40, 21, 117, 74, 63, 41, 31, 142, 221],
     [65, 23, 22, 250, 22, 35, 30, 36, 55, 48, 56, 31, 30, 25, 22, 32, 107, 73, 62, 43, 29, 25, 166, 230],
     [82, 22, 24, 212, 19, 26, 35, 21, 56, 50, 60, 34, 33, 23, 21, 31, 22, 96, 65, 73, 42, 21, 21, 166, 212],
     [68, 22, 26, 179, 20, 28, 27, 49, 38, 47, 29, 28, 20, 27, 19, 88, 64, 67, 39, 20, 144, 198],
     [61, 27, 18, 162, 21, 33, 26, 41, 40, 45, 25, 24, 19, 28, 18, 17, 22, 85, 60, 65, 40, 18, 21, 145, 225],
     [76, 33, 21, 140, 25, 27, 19, 41, 38, 44, 25, 25, 20, 19, 24, 62, 47, 52, 34, 21, 177, 175],
     [108, 36, 21, 23, 25, 25, 174, 27, 27, 28, 22, 51, 43, 48, 24, 25, 24, 31, 85, 52, 58, 39, 26, 190, 220],
     [100, 34, 30, 27, 26, 29, 148, 27, 36, 32, 53, 41, 48, 30, 27, 33, 87, 65, 64, 43, 28, 25, 36, 142, 190],
     [119, 40, 26, 30, 36, 235, 36, 37, 33, 30, 60, 48, 53, 28, 28, 27, 28, 101, 60, 78, 44, 39, 27, 186, 306],
     [141, 50, 41, 35, 31, 40, 227, 31, 34, 37, 32, 36, 75, 61, 62, 42, 36, 36, 134, 80, 80, 49, 46, 243, 315],
     [159, 60, 50, 35, 34, 223, 41, 38, 34, 41, 40, 34, 88, 73, 62, 47, 36, 155, 90, 88, 42, 49, 37, 273, 341],
     [152, 61, 52, 35, 37, 34, 224, 40, 35, 36, 37, 49, 90, 75, 59, 50, 35, 145, 80, 84, 40, 57, 43, 262, 318],
     [177, 60, 53, 38, 40, 277, 49, 41, 38, 43, 53, 38, 100, 94, 66, 52, 42, 38, 149, 90, 81, 60, 38, 206, 338],
     [164, 68, 51, 40, 256, 45, 39, 39, 51, 101, 88, 53, 50, 41, 38, 36, 151, 100, 100, 40, 66, 43, 35, 250, 379],
     [166, 67, 50, 40, 40, 252, 48, 39, 43, 54, 40, 102, 95, 60, 57, 48, 39, 174, 103, 98, 41, 65, 52, 281, 256],
     [163, 71, 41, 38, 39, 219, 42, 40, 52, 37, 100, 85, 59, 55, 40, 37, 36, 150, 92, 92, 39, 52, 47, 261, 256],
     [160, 66, 43, 40, 38, 40, 190, 45, 43, 33, 91, 86, 64, 51, 32, 35, 31, 135, 80, 81, 39, 54, 45, 217, 238],
     [158, 77, 35, 38, 47, 50, 204, 43, 33, 63, 33, 78, 70, 57, 41, 39, 36, 136, 74, 86, 38, 51, 52, 263, 226],
     [190, 88, 42, 65, 62, 50, 178, 51, 66, 46, 42, 78, 95, 78, 56, 42, 150, 95, 92, 46, 228, 230, 67, 64, 48],
     [168, 77, 46, 50, 46, 42, 168, 50, 61, 36, 33, 39, 51, 91, 74, 47, 37, 146, 82, 68, 217, 206, 50, 55, 33],
     [239, 91, 60, 70, 70, 51, 318, 56, 88, 51, 55, 84, 129, 90, 65, 47, 41, 175, 103, 93, 371, 317, 76, 82],
     [227, 88, 60, 69, 66, 56, 249, 56, 80, 55, 52, 87, 132, 94, 65, 51, 185, 95, 108, 63, 373, 317, 91, 91],
     [305, 110, 91, 103, 82, 65, 313, 63, 100, 64, 50, 137, 131, 105, 89, 65, 241, 126, 103, 69, 472, 401, 113, 104],
     [291, 90, 75, 77, 84, 55, 287, 71, 55, 96, 61, 138, 161, 107, 82, 68, 239, 123, 118, 99, 411, 361, 109, 105],
     [314, 108, 92, 105, 76, 64, 316, 61, 113, 79, 65, 163, 166, 121, 98, 69, 293, 138, 124, 108, 468, 441, 121, 115],
     [299, 87, 86, 84, 72, 328, 74, 66, 101, 71, 67, 183, 171, 126, 86, 72, 256, 135, 130, 112, 449, 418, 125, 120],
     [316, 110, 91, 109, 85, 87, 342, 69, 103, 73, 71, 196, 141, 125, 101, 81, 300, 144, 139, 118, 511, 448, 131, 116],
     [310, 91, 106, 87, 63, 78, 98, 336, 91, 106, 186, 131, 471, 390, 76, 142, 90, 65, 261, 94, 75, 65, 119, 104],
     [291, 74, 97, 85, 55, 89, 270, 95, 112, 162, 60, 115, 364, 344, 83, 129, 82, 62, 249, 80, 61, 68, 108, 90],
     [363, 66, 97, 96, 66, 82, 248, 101, 104, 155, 81, 111, 430, 365, 95, 127, 99, 55, 217, 108, 78, 80, 96, 119],
     [312, 110, 139, 98, 109, 98, 119, 91, 92, 68, 260, 84, 77, 138, 119, 66, 239, 133, 400, 361, 99, 113, 94, 114, 140],
     [312, 65, 65, 60, 60, 64, 78, 57, 50, 49, 209, 57, 76, 109, 75, 212, 94, 349, 273, 93, 51, 96, 74, 61, 123],
     [420, 110, 107, 91, 99, 111, 112, 90, 91, 98, 404, 71, 112, 172, 174, 93, 330, 123, 470, 500, 129, 144, 98, 130, 153],
     [500, 105, 118, 96, 96, 125, 115, 98, 99, 81, 118, 348, 104, 158, 170, 80, 340, 166, 501, 467, 120, 170, 107, 126, 150],
     [527, 123, 149, 124, 113, 154, 160, 136, 96, 143, 491, 129, 195, 242, 116, 422, 197, 620, 579, 171, 232, 167, 167, 110, 173],
     [438, 102, 113, 105, 99, 114, 113, 106, 82, 93, 322, 114, 175, 240, 94, 365, 152, 600, 440, 133, 182, 123, 137, 85, 164],
     [504, 107, 139, 107, 119, 155, 138, 119, 100, 123, 419, 126, 183, 239, 105, 338, 204, 683, 501, 167, 220, 146, 184, 122, 184],
     [489, 135, 126, 111, 160, 132, 123, 105, 108, 139, 354, 134, 168, 256, 110, 374, 203, 646, 448, 171, 205, 140, 188, 115, 201],
     [485, 114, 149, 115, 108, 146, 143, 115, 105, 119, 434, 138, 176, 269, 114, 434, 219, 810, 550, 178, 197, 138, 199, 117, 221],
 ];

 option = {

     baseOption: {
         backgroundColor: 'white', //背景颜色
         timeline: {
             data: years,
             axisType: 'category',
             autoPlay: true,
             playInterval: 1500, //播放速度

             left: '5%',
             right: '5%',
             bottom: '0%',
             width: '90%',
             //  height: null,
             label: {
                 normal: {
                     textStyle: {

                         color: 'black',
                     }
                 },
                 emphasis: {
                     textStyle: {
                         color: 'red'
                     }
                 }
             },
             symbolSize: 10,
             lineStyle: {
                 color: '#red'
             },
             checkpointStyle: {
                 borderColor: '#red',
                 borderWidth: 2
             },
             controlStyle: {
                 showNextBtn: true,
                 showPrevBtn: true,
                 normal: {
                     color: '#ff8800',
                     borderColor: '#ff8800'
                 },
                 emphasis: {
                     color: 'red',
                     borderColor: 'red'
                 }
             },

         },
         title: {
             text: '',
             right: '2%',
             bottom: '8%',
             textStyle: {
                 fontSize: 50,
                 color: 'black' //标题字体颜色
             }
         },
         tooltip: {
             'trigger': 'axis'
         },
         calculable: true,
         grid: {
             left: '8%',
             right: '2%',
             bottom: '6%',
             top: '0%',
             containLabel: true
         },
         label: {
             normal: {
                 textStyle: {
                     color: 'red'
                 }
             }
         },
         yAxis: [{

             nameGap: 50,
             offset: '37',
             'type': 'category',
             interval: 50,
             //inverse: ture,//图表倒叙或者正序排版
             data: '',
             nameTextStyle: {
                 color: 'red'
             },


             axisLabel: {
                 //rotate:45,
                 show: false,
                 textStyle: {
                     fontSize: 32,

                     color: function(params, Index) { // 标签国家字体颜色

                         //color:function(d){return "#"+Math.floor(Math.random()*(256*256*256-1)).toString(32);//随机生成颜色

                         var colorarrays = ['#6bc0fb', '#7fec9d', '#fedd8b', '#ffa597', '#84e4dd', '#749f83',
                             '#ca8622', '#bda29a', '#a8d8ea', '#aa96da', '#fcbad3', '#ffffd2',
                             '#f38181', '#fce38a', '#eaffd0', '#95e1d3', '#e3fdfd', '#749f83', '#ca8622',
                             '#ca8622', '#bda29a', '#a8d8ea', '#aa96da', '#fcbad3', '#ffffd2'
                         ];

                         //console.log("111", Index, colorarrays[Index],params); //打印序列

                         return colorarrays[jdData[0].indexOf(params)];
                     },


                 }, //rotate:45,
                 interval: 50
             },
             axisLine: {

                 lineStyle: {
                     color: 'balck' //Y轴颜色
                 },
             },
             splitLine: {
                 show: false,
                 lineStyle: {
                     color: 'balck'
                 }
             },

         }],
         xAxis: [{
             'type': 'value',
             'name': '',

             splitNumber: 4, //轴线个数
             nameTextStyle: {
                 color: 'balck'
             },
             axisLine: {
                 lineStyle: {
                     color: '#ffa597' //X轴颜色
                 }
             },
             axisLabel: {
                 formatter: '{value} '
             },
             splitLine: {
                 show: true,
                 lineStyle: {
                     color: '#fedd8b'
                 }
             },
         }],
         series: [{
                 'name': '',
                 'type': 'bar',
                 markLine: {
                     label: {
                         normal: {
                             show: false
                         }
                     },
                     lineStyle: {
                         normal: {
                             color: 'red',
                             width: 3
                         }
                     },
                 },
                 label: {
                     normal: {
                         show: true,
                         position: 'right', //数值显示在右侧
                         formatter: '{c}'
                     }
                 },
                 itemStyle: {
                     normal: {
                         color: function(params) {
                             // build a color map as your need.
                             //color:function(d){return "#"+Math.floor(Math.random()*(256*256*256-1)).toString(32);//随机生成颜色         
                             var colorList = ['#6bc0fb', '#7fec9d', '#fedd8b', '#ffa597', '#84e4dd', '#749f83',
                                 '#ca8622', '#bda29a', '#a8d8ea', '#aa96da', '#fcbad3', '#ffffd2',
                                 '#f38181', '#fce38a', '#eaffd0', '#95e1d3', '#e3fdfd', '#749f83', '#ca8622',
                                 '#ca8622', '#bda29a', '#a8d8ea', '#aa96da', '#fcbad3', '#ffffd2'
                             ];
                             // return colorList[params.dataIndex]

                             console.log("111", params.name); //打印序列
                             return colorList[jdData[0].indexOf(params.name)];
                         },

                     }
                 },
             },

             {
                 'name': '',
                 'type': 'bar',
                 markLine: {


                     label: {
                         normal: {
                             show: false
                         }
                     },
                     lineStyle: {

                         normal: {
                             color: 'red',
                             width: 3
                         }
                     },
                 },
                 barWidth: '50%',
                 barGap: '-100%',
                 label: {
                     normal: {
                         show: true,
                         fontSize: 16, //标签国家字体大小
                         position: 'left', //数值显示在右侧
                         formatter: function(p) {
                             return p.name;
                         }
                     }
                 },
                 itemStyle: {
                     normal: {


                         color: function(params) {
                             // build a color map as your need.
                             //color:function(d){return "#"+Math.floor(Math.random()*(256*256*256-1)).toString(32);//随机生成颜色         
                             var colorList = ['#6bc0fb', '#7fec9d', '#fedd8b', '#ffa597', '#84e4dd', '#749f83',
                                 '#ca8622', '#bda29a', '#a8d8ea', '#aa96da', '#fcbad3', '#ffffd2',
                                 '#f38181', '#fce38a', '#eaffd0', '#95e1d3', '#e3fdfd', '#749f83', '#ca8622',
                                 '#ca8622', '#bda29a', '#a8d8ea', '#aa96da', '#fcbad3', '#ffffd2'
                             ];
                             // return colorList[params.dataIndex]

                             // console.log("111", params.name); //打印序列
                             return colorList[jdData[0].indexOf(params.name)];
                         },

                     }
                 },
             }
         ],

         animationEasingUpdate: 'quinticInOut',
         animationDurationUpdate: 1500, //动画效果
     },

     options: []
 };
 for (var n = 0; n < years.length; n++) {

     var res = [];
     //alert(jdData.length);
     for (j = 0; j < data[n].length; j++) {
         res.push({
             name: jdData[n][j],
             value: data[n][j]
         });

     }

     res.sort(function(a, b) {
         return b.value - a.value;
     }).slice(0, 6);

     res.sort(function(a, b) {
         return a.value - b.value;
     });


     var res1 = [];
     var res2 = [];
     //console.log(res);
     for (t = 0; t < res.length; t++) {
         res1[t] = res[t].name;
         res2[t] = res[t].value;
     }
     option.options.push({
         title: {
             text: years[n] + ' 平台'
         },
         yAxis: {
             data: res1,
         },
         series: [{
             data: res2
         }, {
             data: res2
         }]
     });
 }