option = {
    title: {
        text: '对比分析',
        textStyle:{
            fontSize:12
        }
    },
    dataset:{
        source: [
            ['使用者', '创维', '长虹', '海信'],
            ['父母', 8539, 5900, 7364],
            ['爸爸', 5080, 8427, 7811],
            ['妈妈', 1293, 2772, 2328],
            ['祖父母', 6477, 7519, 8257],
            ['爷爷外公', 4476, 6599, 8296],
            ['奶奶外婆', 8231, 7002, 5396],
            ['子女', 2016, 5910, 2795],
            ['儿子', 3447, 5396, 2328],
            ['女儿', 8427, 1293, 8237],
            ['丈夫', 4860, 4515, 8411],
            ['妻子', 6954, 3994, 5588],
            ['兄弟姐妹', 7070, 7164, 5923],
            ['兄嫂弟媳', 5544, 7229, 7861],
            ['朋友', 1757, 1388, 6445],
            ['亲戚', 1557, 1679, 2765],
            ['同事', 7902, 5214, 4129]
        ]
    },
    legend:{
        left:20,
        top:30
    },
    yAxis:{
        type:'category'
    },
    xAxis:{},
    tooltip:{},
    axisPointer:{},
    dataZoom:[
        {type:'slider',
            show:true,
            yAxisIndex:[0],
        }
    ],
    series:[
        {type:'bar',
            //smooth:'true',
        },
        {type:'bar',},
        {type:'bar'},
    ]
};