option = {
    geo: {
      map: 'china',
      roam: true,
    },
    series: [
        {
            name: '打点',
            type: 'effectScatter',
            coordinateSystem: 'geo',
            geoIndex: 0,
            label: {
                show: true,
                formatter: "{b}",
                position: 'left',
                fontSize: 12,
            },
            data: [
                {
                    name: '西安',
                    value: [
                      108.94214630126952,
                      34.2607634026429
                    ]
                },
                {
                    name: '北京',
                    value: [
                      116.3912844657898,
                      39.90631262724705
                    ]
                },
                {
                    name: '沈阳',
                    value: [
                      123.43002319335938,
                      41.80049512790971
                    ]
                },
                {
                    name: '长春',
                    value: [
                      125.31211853027345,
                      43.878097874251736
                    ]
                },
                {
                    name: '上海',
                    value: [
                      121.47033691406249,
                      31.22689446881399
                    ]
                },
                {
                    name: '杭州',
                    value: [
                      120.19454956054686,
                      30.25194981710498
                    ]
                },
                {
                    name: '深圳',
                    value: [
                      114.0545654296875,
                      22.53792742994721
                    ]
                },
                {
                    name: '广州',
                    value: [
                      113.26080322265624,
                      23.115101554603044
                    ]
                },
                {
                    name: '阳西',
                    value: [
                      111.61422729492188,
                      21.749295836732088
                    ]
                },
                {
                    name: '天津',
                    value: [
                      117.1966552734375,
                      39.12579898118161
                    ]
                }
            ]
        }
    ]
};