var chinaContourUrl = "/asset/get/s/data-1469097271266-SkyrH7CP.json";

$.getJSON(chinaContourUrl, function (json) {
    echarts.registerMap('china-contour', json);
    
    myChart.setOption({
        geo: [{
            map: 'china',
            itemStyle: {
                normal: {
                    borderWidth: 2,
                    shadowBlur: 50,
                    shadowColor: 'rgba(0, 0, 0, 0.2)'
                }
            }
        }, {
            map: 'china',
            itemStyle: {
                normal: {
                    borderColor: '#aaa'
                }
            }
        }]
    });
});
var geoCoordMap = {
    "中国西南地区和老挝、泰国":[104.114129,37.550339],
"云南西双版纳州傣族自治州":[100.803038,22.009433],
"云南西盟县":[99.52212,22.708423],
"维吾尔乡村":[85.614899,42.127001],
"云南省永宁乡、四川省泸沽湖地区":[100.6956,27.730389],
"云南省西双版纳自治州景洪市嘎洒镇":[100.775162,21.952106],
"云南省西双版纳州勐仑镇":[101.255295,21.941287],
"云南省西双版纳州勐腊镇":[101.577188,21.497604],
"云南省西双版纳州勐腊县":[101.461959,21.73666],
"云南省西双版纳州勐海县":[100.337382,21.960731],
"云南省西双版纳州景讷乡":[100.804453,22.436299],
"云南省西双版纳州景洪县":[100.927318,22.111413],
"云南省西双版纳州景洪市":[100.927318,22.111413],
"云南省西双版纳州打洛镇":[100.058196,21.702533],
"云南省西双版纳州":[100.803038,22.009433],
"云南省文山壮族苗族自治州广南县":[104.838707,24.222836],
"云南省普洱市西盟自治县":[99.52212,22.708423],
"云南省怒江州贡山县":[98.859932,25.860677],
"云南省怒江贡山县":[98.59932,25.860677],
"云南省宁蒗县":[100.778302,27.265589],
"云南省陇川县章凤镇":[97.808037,24.19774],
"云南省陇川县":[97.965385,24.381371],
"云南省临沧市沧源县":[99.270498,23.274581],
"云南省丽江盆地":[100.229628,26.875351],
"云南省红河州元阳县":[102.819567,23.069203],
"云南省红河州绿春县":[102.245327,22.879206],
"云南省丽江":[100.229628,26.875351],
"普洱市澜沧县":[100.980058,22.788778],
"西双版纳":[100.803038,22.009433],
"云南省红河州红河县":[102.243348,23.250955],
"云南省福贡县":[98.868659,26.996507],
"云南省德宏州":[98.589434,24.44124],
"云南省大理州祥云县东山彝族自治乡大古者村":[100.835533,25.58581],
"云南勐腊县纳卡村":[101.63645,21.711921],
"云南丽江市宁蒗县":[100.778302,27.265589],
"云南澜沧县、潞西县、丽江县、绿春县、西双版纳勐海县":[100.337382,21.960731],
"云南红河州":[103.384065,23.367718],
"云南迪庆州":[99.713682,27.831029],
"云南大理州":[100.219209,25.693967],
"云南大理市":[100.219209,25.693967],
"云南":[101.2952,24.864213],
"云南省":[101.592952,24.864213],
"延边朝鲜族自治州":[129.485902,42.896414],
"新疆于田县":[81.995463,37.16913],
"新疆维吾尔自治区和田区":[79.915814,37.15335],
"新疆维吾尔自治区":[85.614899,42.127001],
"新疆内蒙古自治区":[114.415868,43.468238],
"西藏堆龙德庆县":[90.793393,29.804706],
"四川省平武县白马藏族乡":[104.329223,32.744422],
"四川省木里藏族自治县":[100.953057,28.360344],
"四川省凉山州盐源县":[101.467624,27.603028],
"四川省阆中市江南镇前锋村":[105.983694,31.544701],
"四川省阿坝州汶川县":[103.294317,31.168774],
"四川省阿坝州茂县":[102.228565,31.905763],
"四川盆地中部地区":[102.89916,30.367481],
"四川绵阳市北川正河村":[104.000535,32.060782],
"四川绵阳平武县":[104.404308,32.446912],
"四川泸沽湖地区":[100.786681,27.719733],
"青海省西宁市":[101.767921,36.640739],
"青海省海南州兴海县":[99.733309,35.5403],
"内蒙古呼和浩特市国际蒙医医院":[111.733662,40.825327],
"内蒙古地区":[114.415868,43.468238],
"内蒙古赤峰市（阿鲁科尔沁）":[118.930761,42.297112],
"凉山州木里藏族自治县":[100.953057,28.360344],
"湖南湘西州":[109.745746,28.317951],
"湖南湘西":[109.745746,28.317951],
"湖南省怀化市会同县":[109.809945,26.914136],
"湖南衡阳":[112.583819,26.898164],
"湖南东部支系(湘西方言)苗族":[109.745746,28.317951],
"湖北省恩施州来凤县":[109.246714,29.425663],
"湖北省恩施州":[109.517433,30.308979],
"湖北恩施州":[109.517433,30.308979],
"黑龙江绥化市":[126.989095,46.646064],
"河北省邢台市清河县":[115.69159,37.04053],
"海南侾黎村寨":[109.733755,19.180501],
"贵州省三都县塘党寨":[107.832989,25.60065],
"贵州省黔东南从江县":[108.729733,25.718844],
"贵州省毕节地区纳雍县":[105.283876,26.808509],
"贵州盘县":[104.666913,25.772838],
"广西靖西县":[106.321095,23.149606],
"广西合浦县北海营盘镇黄稍村":[109.518369,21.504745],
"广西桂林市龙胜县":[110.015155,25.800983],
"广西大化瑶族自治县":[107.711959,23.970745],
"广东湛江市南三岛":[110.49374,21.194981],
"广东省连南瑶族自治县":[112.263642,24.574156],
"甘肃天水市":[105.736932,34.584319],
"甘肃省临夏回族自治州临夏县":[103.050791,35.518719],
"甘肃省甘南藏族自治州夏河县":[102.506578,35.023031],
"甘肃临夏回族自治州康乐县":[103.62902,35.258018],
"甘肃临夏回族自治州和政县":[103.298568,35.345732],
"福建省漳州市南靖县":[117.293055,24.668806],
"滇西北丽江地区玉龙纳西族自治县":[99.951634,27.104463],
"西藏自治区贡觉县":[98.496122,30.746651],

};

var convertData = function (data) {
    var res = [];
    for (var i = 0; i < data.length; i++) {
        var geoCoord = geoCoordMap[data[i].name];
        if (geoCoord) {
            res.push({
                name: data[i].name,
                value: geoCoord.concat(data[i].value)
            });
        }
    }
    return res;
};

option = {
    title: {
        text: '',
        subtext: ' ',
        sublink: 'http://www.pm25.in',
        x:'center',
        textStyle: {
            color: '#fff'
        }
    },
    tooltip: {
        trigger: 'item',
        formatter: function (params) {
            return params.name + '  ';
        }
    },
    visualMap: {
        x : 'center',
        y : '-1000',
        min: 0,
        max: 200,
        calculable: true,
        color: ['#d94e5d','#50a3ba','#d94e5d','#d94e5d'],
        textStyle: {
        }
    },
    geo: {
        map: 'china',
        label: {
            emphasis: {
                show: false
            }
        },
        itemStyle: {
            normal: {
            },
            emphasis: {
            }
        }
    },
    series: [
        {
            name: 'pm2.5',
            type: 'scatter',
            coordinateSystem: 'geo',
            data: convertData([
                {name:"中国西地区和老挝、泰国", value: 1},
{name:"云南西双版纳州傣族自治州", value: 1},
{name:"云南西盟县", value: 1},
{name:"维吾尔乡村", value: 1},
{name:"云南省永宁乡、四川省泸沽湖地区", value: 1},
{name:"云南省西双版纳自治州景洪市嘎洒镇", value: 1},
{name:"云南省西双版纳州勐仑镇", value: 1},
{name:"云南省西双版纳州勐腊镇", value: 1},
{name:"云南省西双版纳州勐腊县", value: 1},
{name:"云南省西双版纳州勐海县", value: 1},
{name:"云南省西双版纳州景讷乡", value: 1},
{name:"云南省西双版纳州景洪县", value: 1},
{name:"云南省西双版纳州景洪市", value: 1},
{name:"云南省西双版纳州打洛镇", value: 1},
{name:"云南省西双版纳州", value: 1},
{name:"云南省文山壮族苗族自治州广南县", value: 1},
{name:"云南省普洱市西盟自治县", value: 1},
{name:"云南省怒江州贡山县", value: 1},
{name:"云南省怒江贡山县", value: 1},
{name:"云南省宁蒗县", value: 1},
{name:"云南省陇川县章凤镇", value: 1},
{name:"云南省陇川县", value: 1},
{name:"云南省临沧市沧源县", value: 1},
{name:"云南省丽江盆地", value: 1},
{name:"云南省红河州元阳县", value: 1},
{name:"云南省红河州绿春县", value: 1},
{name:"云南省丽江", value: 1},
{name:"普洱市澜沧县", value: 1},
{name:"西双版纳", value: 1},
{name:"云南省红河州红河县", value: 1},
{name:"云南省福贡县", value: 1},
{name:"云南省德宏州", value: 1},
{name:"云南省大理州祥云县东山彝族自治乡大古者村", value: 1},
{name:"云南勐腊县纳卡村", value: 1},
{name:"云南丽江市宁蒗县", value: 1},
{name:"云南澜沧县、潞西县、丽江县、绿春县、西双版纳勐海县", value: 1},
{name:"云南红河州", value: 1},
{name:"云南迪庆州", value: 1},
{name:"云南大理州", value: 1},
{name:"云南大理市", value: 1},
{name:"云南", value: 1},
{name:"云南省", value: 1},
{name:"延边朝鲜族自治州", value: 1},
{name:"新疆于田县", value: 1},
{name:"新疆维吾尔自治区和田区", value: 1},
{name:"新疆维吾尔自治区", value: 1},
{name:"新疆内蒙古自治区", value: 1},
{name:"西藏堆龙德庆县", value: 1},
{name:"四川省平武县白马藏族乡", value: 1},
{name:"四川省木里藏族自治县", value: 1},
{name:"四川省凉山州盐源县", value: 1},
{name:"四川省阆中市江南镇前锋村", value: 1},
{name:"四川省阿坝州汶川县", value: 1},
{name:"四川省阿坝州茂县", value: 1},
{name:"四川盆地中部地区", value: 1},
{name:"四川绵阳市北川正河村", value: 1},
{name:"四川绵阳平武县", value: 1},
{name:"四川泸沽湖地区", value: 1},
{name:"青海省西宁市", value: 1},
{name:"青海省海南州兴海县", value: 1},
{name:"内蒙古呼和浩特市国际蒙医医院", value: 1},
{name:"内蒙古地区", value: 1},
{name:"内蒙古赤峰市（阿鲁科尔沁）", value: 1},
{name:"凉山州木里藏族自治县", value: 1},
{name:"湖南湘西州", value: 1},
{name:"湖南湘西", value: 1},
{name:"湖南省怀化市会同县", value: 1},
{name:"湖南衡阳", value: 1},
{name:"湖南东部支系(湘西方言)苗族", value: 1},
{name:"湖北省恩施州来凤县", value: 1},
{name:"湖北省恩施州", value: 1},
{name:"湖北恩施州", value: 1},
{name:"黑龙江绥化市", value: 1},
{name:"河北省邢台市清河县", value: 1},
{name:"海南侾黎村寨", value: 1},
{name:"贵州省三都县塘党寨", value: 1},
{name:"贵州省黔东南从江县", value: 1},
{name:"贵州省毕节地区纳雍县", value: 1},
{name:"贵州盘县", value: 1},
{name:"广西靖西县", value: 1},
{name:"广西合浦县北海营盘镇黄稍村", value: 1},
{name:"广西桂林市龙胜县", value: 1},
{name:"广西大化瑶族自治县", value: 1},
{name:"广东湛江市南三岛", value: 1},
{name:"广东省连南瑶族自治县", value: 1},
{name:"甘肃天水市", value: 1},
{name:"甘肃省临夏回族自治州临夏县", value: 1},
{name:"甘肃省甘南藏族自治州夏河县", value: 1},
{name:"甘肃临夏回族自治州康乐县", value: 1},
{name:"甘肃临夏回族自治州和政县", value: 1},
{name:"福建省漳州市南靖县", value: 1},
{name:"滇西北丽江地区玉龙纳西族自治县", value: 1},
{name:"西藏自治区贡觉县", value: 1},


            ]),
            symbolSize: 4,
            label: {
                normal: {
                    show: false
                },
                emphasis: {
                    show: false
                }
            },
            itemStyle: {
            }
        }
    ]
}