// 此图暂时完结，已部署Vue项目，可以使用Router路由打开新网页展示在大数据屏幕上面。

//喜欢的话，点击爱心~~~

// var uploadedDataURL = "/asset/get/s/data-1520166901794-HJRxuDtOG.json";
// var guangzhou = "https://geo.datav.aliyun.com/areas_v2/bound/440100_full.json";
// var dongguan = "/asset/get/s/data-1572264862178-y6F2klp4.json";
// var zhongshan = "https://geo.datav.aliyun.com/areas_v2/bound/442000_full.json";
// var yunfu = "https://geo.datav.aliyun.com/areas_v2/bound/445300_full.json";
// var foshan = "https://geo.datav.aliyun.com/areas_v2/bound/440600_full.json";
// var huizhou = "https://geo.datav.aliyun.com/areas_v2/bound/441300_full.json";
// var jieyang = "https://geo.datav.aliyun.com/areas_v2/bound/445200_full.json";
// var meizhou = "https://geo.datav.aliyun.com/areas_v2/bound/441400_full.json";
// var shantou = "https://geo.datav.aliyun.com/areas_v2/bound/440500_full.json";
// var shanwei = "https://geo.datav.aliyun.com/areas_v2/bound/441500_full.json";
// var jiangmen = "https://geo.datav.aliyun.com/areas_v2/bound/440700_full.json";
// var heyuan = "https://geo.datav.aliyun.com/areas_v2/bound/441600_full.json";
// var shenzhen = "https://geo.datav.aliyun.com/areas_v2/bound/440300_full.json";
// var qingyuan = "https://geo.datav.aliyun.com/areas_v2/bound/441800_full.json";
// var zhanjiang = "https://geo.datav.aliyun.com/areas_v2/bound/440800_full.json";
// var chaozhou = "https://geo.datav.aliyun.com/areas_v2/bound/445100_full.json";
// var zhuhai = "https://geo.datav.aliyun.com/areas_v2/bound/440400_full.json";
// var zhaoqing = "https://geo.datav.aliyun.com/areas_v2/bound/441200_full.json";
// var maoming = "https://geo.datav.aliyun.com/areas_v2/bound/440900_full.json";
// var yangjiang = "https://geo.datav.aliyun.com/areas_v2/bound/441700_full.json";
// var shaoguan = "https://geo.datav.aliyun.com/areas_v2/bound/440200_full.json";

// aliyun地图需要先去阿里云提供的地理信息接口 ‘https://datav.aliyun.com/tools/atlas/’ 点击地图获取
// 不然会报403没有权限！

var uploadedDataURL = "/asset/get/s/data-1520166901794-HJRxuDtOG.json";
var guangzhou = "/asset/get/s/data-1576821068997-HGlupX6J.json";
var dongguan = "/asset/get/s/data-1572264862178-y6F2klp4.json";
var zhongshan = "/asset/get/s/data-1576824354651-9bwLpzgy.json";
var yunfu = "/asset/get/s/data-1576824384706-1Brve1Oj.json";
var foshan = "/asset/get/s/data-1576824043187-E-xwb0jW.json";
var huizhou = "/asset/get/s/data-1576824222099-nELgXb84.json";
var jieyang = "/asset/get/s/data-1576824380485-eFPHlFNL.json";
var meizhou = "/asset/get/s/data-1576824237769-_uMBnSG_.json";
var shantou = "/asset/get/s/data-1576824020491-B7h-K2yV.json";
var shanwei = "/asset/get/s/data-1576824251141-jwLw_Xww.json";
var jiangmen = "/asset/get/s/data-1576824050865-VcmIj6LF.json";
var heyuan = "/asset/get/s/data-1576824260491-fhsmPl4c.json";
var shenzhen = "/asset/get/s/data-1576823863630-dp3ZR3zA.json";
var qingyuan = "/asset/get/s/data-1576824295450-lI2psCvK.json";
var zhanjiang = "/asset/get/s/data-1576824072094-_S1ovhbZ.json";
var chaozhou = "/asset/get/s/data-1576824367651-WDNeewJ3.json";
var zhuhai = "/asset/get/s/data-1576824001581-HGb5qVrI.json";
var zhaoqing = "/asset/get/s/data-1576824094572-yuEzuCbC.json";
var maoming = "/asset/get/s/data-1576824083659-HUyf5kmu.json";
var yangjiang = "/asset/get/s/data-1576824277625-fC0b1Dof.json";
var shaoguan = "/asset/get/s/data-1576821486518-hXiIB3zl.json";

$.get(uploadedDataURL, function(geoJson) {

    myChart.hideLoading();

    echarts.registerMap('广东', geoJson);

    var cityMap = {
        "广州市": guangzhou,
        '东莞市': dongguan,
        "中山市": zhongshan,
        '云浮市': yunfu,
        "佛山市": foshan,
        "惠州市": huizhou,
        "揭阳市": jieyang,
        "梅州市": meizhou,
        "汕头市": shantou,
        "汕尾市": shanwei,
        "江门市": jiangmen,
        "河源市": heyuan,
        "深圳市": shenzhen,
        "清远市": qingyuan,
        "湛江市": zhanjiang,
        "潮州市": chaozhou,
        "珠海市": zhuhai,
        "肇庆市": zhaoqing,
        "茂名市": maoming,
        "阳江市": yangjiang,
        "韶关市": shaoguan
    };

    var gdGeoCoordMap = {
        '广州市': [113.307649675, 23.1200491021],
        '东莞市': [113.763433991, 23.0430238154],
        "中山市": [113.422060021, 22.5451775145],
        '云浮市': [112.050945959, 22.9379756855],
        "佛山市": [113.134025635, 23.0350948405],
        "惠州市": [114.41065808, 23.1135398524],
        "揭阳市": [116.379500855, 23.5479994669],
        "梅州市": [116.126403098, 24.304570606],
        "汕头市": [116.728650288, 23.3839084533],
        "汕尾市": [115.372924289, 22.7787305002],
        "江门市": [113.078125341, 22.5751167835],
        "河源市": [114.713721476, 23.7572508505],
        "深圳市": [114.025973657, 22.5460535462],
        "清远市": [113.040773349, 23.6984685504],
        "湛江市": [110.365067263, 21.2574631038],
        "潮州市": [116.630075991, 23.6618116765],
        "珠海市": [113.562447026, 22.2569146461],
        "肇庆市": [112.47965337, 23.0786632829],
        "茂名市": [110.931245331, 21.6682257188],
        "阳江市": [111.977009756, 21.8715173045],
        "韶关市": [113.594461107, 24.8029603119]
    };
    var gdDatas = [
        [{
            name: '广州市',
            value: 10
        }],
        [{
            name: '东莞市',
            value: 0
        }],
        [{
            name: '中山市',
            value: 0
        }],
        [{
            name: '云浮市',
            value: 0
        }],
        [{
            name: '佛山市',
            value: 1.3
        }],
        [{
            name: '惠州市',
            value: 0.2
        }],
        [{
            name: '揭阳市',
            value: 0.4
        }],
        [{
            name: '梅州市',
            value: 0.6
        }],
        [{
            name: '汕头市',
            value: 0.8
        }],
        [{
            name: '汕尾市',
            value: 0.4
        }],
        [{
            name: '江门市',
            value: 0.8
        }],
        [{
            name: '河源市',
            value: 0.2
        }],
        [{
            name: '深圳市',
            value: 1.3
        }],
        [{
            name: '清远市',
            value: 0
        }],
        [{
            name: '湛江市',
            value: 0
        }],
        [{
            name: '潮州市',
            value: 0
        }],
        [{
            name: '珠海市',
            value: 0
        }],
        [{
            name: '肇庆市',
            value: 0
        }],
        [{
            name: '茂名市',
            value: 0
        }],
        [{
            name: '阳江市',
            value: 0
        }],
        [{
            name: '韶关市',
            value: 0.8
        }]
    ];

    var dongguandata = [{
            name: "东莞市供电局",
            value: [113.77938, 23.038512, 0.5],
        },
        {
            name: "东莞东城供电分局",
            value: [113.792974, 23.052572, 1],
        },
        {
            name: "广东电网东莞南城供电局",
            value: [113.732335, 22.988811, 1],
        },
        {
            name: "沙田供电分局",
            value: [113.623147, 22.906049, 0.1],
        },
        {
            name: "广东电网(松山湖)",
            value: [113.885596, 22.930452, 0.4],
        },
        {
            name: "东莞供电局万江供电局",
            value: [113.74855, 23.051032, 1],
        },
        {
            name: "广东电网公司石龙供电分局",
            value: [113.885529, 23.118535, 1.4],
        },
        {
            name: "广东电网东莞虎门供电局",
            value: [113.686715, 22.822795, 0.7],
        },
        {
            name: "广东电网公司中堂供电公司",
            value: [113.661819, 23.107252, 0.1],
        },
        {
            name: "望牛墩供电公司",
            value: [113.66542, 23.056186, 0.5],
        },
        {
            name: "东莞供电局石碣供电局",
            value: [113.816434, 23.108315, 2],
        },
        {
            name: "高埗供电分局",
            value: [113.723992, 23.091214, 0.9],
        },
        {
            name: "东莞市麻涌供电公司",
            value: [113.595475, 23.070846, 2],
        },
        {
            name: "东莞市长安供电公司",
            value: [113.80495, 22.814012, 2],
        },
        {
            name: "东莞市道滘供电公司",
            value: [113.682313, 23.01234, 0.4],
        },
        {
            name: "东莞市洪梅供电公司",
            value: [113.619614, 23.004171, 0.6],
        },
        {
            name: "东莞市厚街供电公司",
            value: [113.672085, 22.947055, 2],
        },
        {
            name: "东莞市寮步供电公司",
            value: [113.878667, 23.003748, 2],
        },
        {
            name: "大岭山供电公司",
            value: [113.848148, 22.909776, 0.1],
        },
        {
            name: "广东电网大朗供电分公司",
            value: [113.946028, 22.942659, 0.9],
        },
        {
            name: "黄江供电分局",
            value: [114.004514, 22.921789, 0.5],
        },
        {
            name: "东莞供电局樟木头供电局",
            value: [114.093212, 22.919318, 2],
        },
        {
            name: "东莞市清溪供电公司",
            value: [114.166783, 22.848801, 2],
        },
        {
            name: "东莞供电局谢岗分局",
            value: [114.147893, 22.959105, 2],
        },
        {
            name: "东莞市凤岗镇雁田供电所",
            value: [114.174361, 22.701866, 0.4],
        },
        {
            name: "东莞常平供电分局",
            value: [114.023799, 22.956273, 0.6],
        },
        {
            name: "东莞桥头供电分局",
            value: [114.089704, 23.015848, 2],
        },
        {
            name: "东莞电网横沥供电分局",
            value: [113.986244, 23.014789, 0.8],
        },
        {
            name: "广东电网公司东莞东坑供电分局",
            value: [113.94035, 22.999702, 0.2],
        },
        {
            name: "塘厦供电局",
            value: [114.107866, 22.818308, 2],
        },
        {
            name: "企石供电局",
            value: [114.028867, 23.06466, 0.7],
        },
        {
            name: "石排供电公司",
            value: [113.948355, 23.090701, 0.1],
        },
        {
            name: "茶山供电分局",
            value: [113.874287, 23.082211, 0.2],
        },
    ]

    var foshandata = [{
            name: "中国南方电网广东电网公司(佛山市局)",
            value: [113.114469, 23.014566, 0.5],
        },
        {
            name: "广东电网公司佛山市高明供电局",
            value: [112.880641, 22.900386, 1],
        },
        {
            name: "中国南方电网佛山顺德供电局",
            value: [113.255345, 22.833733, 1],
        },
        {
            name: "佛山供电局西南供电所",
            value: [112.897243, 23.182886, 0.1],
        },
        {
            name: "广东电网公司佛山南海供电局",
            value: [113.158995, 23.04021, 0.4],
        },
        {
            name: "广东电网佛山高明供电局(荷城供电所)",
            value: [112.87292, 22.916101, 1],
        },
        {
            name: "中国南方电网广东电网公司禅城区供电局",
            value: [113.102252, 23.018404, 1.4],
        },
        {
            name: "中国南方电网(广东电网三水供电局)",
            value: [112.904125, 23.170021, 0.7],
        },
        {
            name: "广东电网充电站(佛山市禅城供电局南庄供电所",
            value: [113.010709, 22.988916, 0.1],
        },
        {
            name: "顺德勒流供电局",
            value: [113.136198, 22.867434, 0.5],
        },
        {
            name: "中国南方电网广东电网北滘供电所",
            value: [113.217328, 22.925584, 2],
        },
        {
            name: "中国南方电网(广东电网杏坛供电所)",
            value: [113.160039, 22.795662, 0.9],
        },
        {
            name: "中国南方电网佛山供电局九江供电所",
            value: [113.014118, 22.842881, 2],
        },
        {
            name: "佛山供电局容桂供电所",
            value: [113.265904, 22.761674, 2],
        },
        {
            name: "佛山大沥供电所",
            value: [113.116177, 23.119635, 0.4],
        },
        {
            name: "中国南方电网佛山供电局杨和供电所",
            value: [112.794551, 22.875436, 0.6],
        },
        {
            name: "中国南方电网佛山供电局狮山供电所",
            value: [113.01428, 23.136142, 2],
        },
        {
            name: "南方电网里水供电营业厅",
            value: [113.157242, 23.184999, 2],
        },
        {
            name: "中国南方电网丹灶供电所",
            value: [112.921561, 23.058824, 0.2],
        },
        {
            name: "中国南方电网佛山明城供电所",
            value: [112.717208, 22.864419, 0.6],
        },
        {
            name: "佛山供电所罗村供电所",
            value: [113.05827, 23.066177, 2],
        },
        {
            name: "中国南方电网佛山乐平供电所",
            value: [112.982963, 23.274519, 0],
        },
        {
            name: "中国南方电网佛山大塘供电所",
            value: [112.915755, 23.429438, 1],
        },
    ]

    var guangzhoudata = [{
            name: "中国南方电网有限责任公司",
            value: [113.448584, 23.178596, 0.5],
        },
        {
            name: "广州供电局有限公司",
            value: [113.336013, 23.136947, 1],
        },
        {
            name: "广州供电局有限公司越秀供电局",
            value: [113.317955, 23.127416, 1],
        },
        {
            name: "广州供电局有限公司天河供电局",
            value: [113.314826, 23.151385, 0.1],
        },
        {
            name: "广州供电局有限公司增城供电局",
            value: [113.83479, 23.297518, 0.4],
        },
        {
            name: "广州供电局有限公司荔湾供电局",
            value: [113.241136, 23.131055, 1],
        },
        {
            name: "广州番禺供电局",
            value: [113.418194, 22.942329, 1.4],
        },
        {
            name: "中国南方电网(广州黄埔供电局)",
            value: [113.496245, 23.181911, 0.7],
        },
        {
            name: "广东供电局有限公司(海珠供电局)",
            value: [113.266052, 23.11308, 0.1],
        },
        {
            name: "广州市南沙区供电局",
            value: [113.533991, 22.802807, 0.5],
        },
        {
            name: "石楼供电所",
            value: [113.497156, 22.968443, 2],
        },
        {
            name: "永宁供电所",
            value: [113.59735, 23.186864, 0.9],
        },
        {
            name: "芳村供电所",
            value: [113.222603, 23.114014, 2],
        },
        {
            name: "炭步供电所",
            value: [113.116516, 23.338806, 2],
        },
        {
            name: "中新镇供电所",
            value: [113.62646, 23.287685, 0.4],
        },
        {
            name: "广州供电局有限公司白云供电局",
            value: [113.269433, 23.207704, 0.6],
        },
        {
            name: "新塘供电所",
            value: [113.618865, 23.135998, 2],
        },
        {
            name: "广州供电局增城城郊供电所",
            value: [113.840893, 23.292153, 2],
        },
        {
            name: "中国南方电网广州供电局城北供电所",
            value: [113.280646, 23.206652, 0.2],
        },
        {
            name: "中国南方电网广州供电局东涌供电所",
            value: [113.464406, 22.855242, 0.6],
        },
        {
            name: "广州番禺供电局石基供电所",
            value: [113.441007, 22.95985, 2],
        },
        {
            name: "广州供电局大石供电所",
            value: [113.318991, 23.019864, 0],
        },
        {
            name: "广州供电局万顷沙供电所",
            value: [113.55787, 22.713582, 1],
        },
        {
            name: "中国南方电网广州供电局东涌供电所",
            value: [113.464406, 22.855242, 1],
        },
        {
            name: "中国南方电网广州供电局大岗供电所",
            value: [113.413739, 22.809222, 1],
        },
        {
            name: "中国南方电网广州供电局新化供电所",
            value: [113.428731, 23.03989, 0.1],
        },
        {
            name: "广州供电局有限公司沙湾供电所",
            value: [113.352915, 22.910034, 0.4],
        },
        {
            name: "广州供电局南村供电所",
            value: [113.397622, 23.016261, 1],
        },
        {
            name: "中国南方电网广州供电局有限公司(钟村供电所)",
            value: [113.316596, 22.979249, 1.4],
        },
        {
            name: "中国南方电网广州供电局仙村供电所",
            value: [113.725985, 23.168679, 0.7],
        },
        {
            name: "广州供电局充电站(朱村供电所)",
            value: [113.597346, 23.186876, 0.1],
        },
        {
            name: "中国南方电网广州供电局石滩供电所",
            value: [113.796233, 23.181358, 0.5],
        },
        {
            name: "正果供电所",
            value: [113.899818, 23.419054, 2],
        },
        {
            name: "中国南方电网广州供电局有限公司雅瑶供电所",
            value: [113.223549, 23.369877, 0.9],
        },
        {
            name: "广州供电局梯面供电所",
            value: [113.302331, 23.555403, 2],
        },
        {
            name: "广东电网花东供电所",
            value: [113.38354, 23.423806, 2],
        },
        {
            name: "广州供电局有限公司狮岭供电所",
            value: [113.232664, 23.473656, 0.4],
        },
        {
            name: "广州供电局赤坭供电所",
            value: [113.089318, 23.389743, 0.6],
        },
        {
            name: "广州供电局花都城郊供电所",
            value: [113.217224, 23.376953, 2],
        },
        {
            name: "中国南方电网广州供电局有限公司(花都供电局)",
            value: [113.224529, 23.411668, 2],
        },
        {
            name: "广州供电局吕田供电所",
            value: [113.957433, 23.817109, 0.1],
        },
        {
            name: "广州供电局良口供电所",
            value: [113.739137, 23.722024, 0.9],
        },
        {
            name: "广州供电局有限公司鳌头供电所",
            value: [113.434838, 23.622185, 0.5],
        },
        {
            name: "广州供电局太平供电所",
            value: [113.545044, 23.496623, 2],
        },
        {
            name: "广州供电局有限公司江高供电所",
            value: [113.235024, 23.276661, 2],
        },
        {
            name: "广州供电局西郊供电所",
            value: [113.244478, 23.206732, 2],
        },
        {
            name: "广州供电局(钟落潭供电所)",
            value: [113.379298, 23.363068, 0.4],
        },
        {
            name: "广州供电局有限公司太和供电所",
            value: [113.312506, 23.285495, 0.6],
        },
        {
            name: "中国南方电网广州供电局城北供电所",
            value: [113.280646, 23.206652, 2],
        },
        {
            name: "广州供电局有限公司(白云城郊供电所)",
            value: [113.269599, 23.2076, 0.8],
        },
    ]

    var zhongshandata = [{
            name: "中山市供电局",
            value: [113.428381, 22.511016, 0.5],
        },
        {
            name: "中山供电局神湾供电公司",
            value: [113.364522, 22.32861, 1],
        },
        {
            name: "广东电网中山供电局板芙供电公司",
            value: [113.326119, 22.421995, 1],
        },
        {
            name: "三角供电公司(翰林院西北)",
            value: [113.421709, 22.682416, 0.1],
        },
        {
            name: "中国南方电网(阜沙供电所)",
            value: [113.354448, 22.669966, 0.4],
        },
        {
            name: "中山供电局民众供电公司",
            value: [113.495713, 22.62082, 1],
        },
        {
            name: "横栏供电公司",
            value: [113.257557, 22.549173, 1.4],
        },
        {
            name: "中国南方电网黄圃供电分局",
            value: [113.33844, 22.716616, 0.7],
        },
        {
            name: "中国南方电网(广东电网南头供电分局)",
            value: [113.304972, 22.72066, 0.1],
        },
        {
            name: "东凤供电局",
            value: [113.259675, 22.692278, 0.5],
        },
        {
            name: "中山供电局东升供电公司",
            value: [113.30159, 22.615191, 2],
        },
        {
            name: "中山供电局三乡供电公司",
            value: [113.44225, 22.354427, 0.9],
        },
        {
            name: "中国南方电网(广东电网坦洲供电分局)",
            value: [113.474604, 22.275181, 2],
        },
        {
            name: "中国南方电网(广东古镇供电分局)",
            value: [113.218465, 22.615216, 2],
        },
        {
            name: "中国南方电网(小榄供电分局)",
            value: [113.259373, 22.661689, 0.4],
        },
        {
            name: "小榄供电所",
            value: [113.24837, 22.665253, 0.6],
        },
        {
            name: "中国南方电网广东电网五桂山供电分局",
            value: [113.402643, 22.442755, 2],
        },
        {
            name: "大涌供电分局",
            value: [113.291984, 22.475765, 2],
        },
        {
            name: "中山南朗供电公司",
            value: [113.537549, 22.505629, 0.1],
        },
        {
            name: "港口供电分局",
            value: [113.388654, 22.584768, 0.9],
        },
        {
            name: "广东电网沙溪供电分局",
            value: [113.323006, 22.513911, 0.5],
        },
        {
            name: "中国南方电网广东中山西区供电分局",
            value: [113.362482, 22.526837, 2],
        },
        {
            name: "中国南方电网广东电网东区供电分局",
            value: [113.426107, 22.524421, 2],
        },
        {
            name: "中国南方电网(广东电网石岐供电分局)",
            value: [113.398226, 22.543337, 2],
        },
        {
            name: "中山供电局火炬供电公司",
            value: [113.484287, 22.556313, 0.4],
        },
    ]

    var zhuhaidata = [{
            name: "广东电网珠海供电局",
            value: [113.574751, 22.28707, 0.5],
        },
        {
            name: "广东电网公司香洲供电局",
            value: [113.574571, 22.287003, 1],
        },
        {
            name: "广东电网公司珠海金湾供电局",
            value: [113.352325, 22.134525, 1],
        },
        {
            name: "广东电网(珠海斗门供电局)",
            value: [113.304229, 22.2118, 0.1],
        },
        {
            name: "中国南方电网唐家湾供电所",
            value: [113.547983, 22.386624, 0.4],
        },
        {
            name: "中国南方电网(前山营业厅)",
            value: [113.527142, 22.257568, 1],
        },
        {
            name: "中国南方电网(南屏营业厅)",
            value: [113.517529, 22.221416, 1.4],
        },
        {
            name: "珠海供电局横琴营业厅",
            value: [113.555333, 22.12267, 0.7],
        },
        {
            name: "中国南方电网(香洲营业厅)",
            value: [113.567139, 22.288891, 0.1],
        },
        {
            name: "珠海供电局吉大营业厅",
            value: [113.590228, 22.257645, 0.5],
        },
        {
            name: "中国南方电网(拱北营业厅)",
            value: [113.553964, 22.235116, 2],
        },
        {
            name: "广东电网红旗供电所",
            value: [113.297345, 22.111321, 0.9],
        },
        {
            name: "中国南方电网(三灶营业厅)",
            value: [113.377779, 22.066311, 2],
        },
        {
            name: "珠海平沙供电所",
            value: [113.196166, 22.10653, 2],
        },
        {
            name: "珠海市金湾供电局南水供电所",
            value: [113.235341, 22.030851, 0.4],
        },
        {
            name: "中国南方电网(莲洲营业厅)",
            value: [113.214665, 22.320207, 0.6],
        },
        {
            name: "中国南方电网(井岸营业厅)",
            value: [113.293811, 22.175325, 2],
        },
        {
            name: "珠海市斗门供电局乾务营业厅",
            value: [113.233179, 22.161333, 2],
        },
        {
            name: "中国南方电网(五山营业厅)",
            value: [113.18044, 22.176115, 0.1],
        },
        {
            name: "中国南方电网(白蕉营业厅)",
            value: [113.312399, 22.236737, 0.9],
        },
    ]

    var jiangmendata = [{
            name: "中国南方电网广东电网公司江门供电局",
            value: [113.08119, 22.61486, 0.5],
        },
        {
            name: "中国南方电网(广东电网江门新会供电局)",
            value: [113.050684, 22.532427, 1],
        },
        {
            name: "中国南方电网江门恩平供电局",
            value: [112.341081, 22.205683, 1],
        },
        {
            name: "广东电网台山供电局",
            value: [112.795691, 22.274754, 0.1],
        },
        {
            name: "中国南方电网广东电网江海供电局",
            value: [113.118106, 22.559109, 0.4],
        },
        {
            name: "中国南方电网广东电网江门蓬江供电局",
            value: [113.103369, 22.60285, 1],
        },
        {
            name: "江门开平供电局广东电网公司",
            value: [112.700173, 22.389429, 1.4],
        },
        {
            name: "广东电网鹤山供电局",
            value: [112.99051, 22.773263, 0.7],
        },
        {
            name: "中国南方电网广东电网公司(水口供电所)",
            value: [112.729963, 22.414467, 0.1],
        },
        {
            name: "中国南方电网广东电网双水供电所",
            value: [113.0176, 22.436691, 0.5],
        },
        {
            name: "江门海宴供电所",
            value: [112.574343, 21.827096, 2],
        },
        {
            name: "江门址山供电局",
            value: [112.791321, 22.522733, 0.9],
        },
        {
            name: "江门鹤城供电局",
            value: [112.838885, 22.629647, 2],
        },
        {
            name: "江门三八供电所",
            value: [112.700566, 22.302879, 2],
        },
        {
            name: "江门良西供电所",
            value: [112.344963, 22.319551, 0.4],
        },
        {
            name: "江门供电局苍城供电所",
            value: [112.568516, 22.479941, 0.6],
        },
        {
            name: "广东电网公司睦洲供电所",
            value: [113.166118, 22.462972, 2],
        },
        {
            name: "南方电网(江门三江供电所)",
            value: [113.10996, 22.430898, 2],
        },
        {
            name: "中国南方电网(崖门供电所)",
            value: [113.064298, 22.303784, 0.1],
        },
        {
            name: "中国南方电网广东电网双水供电所",
            value: [113.0176, 22.436691, 0.9],
        },
        {
            name: "中国南方电网广东电网公司(水口供电所)",
            value: [112.729963, 22.414467, 0.5],
        },
        {
            name: "中国南方电网(广东电网雅瑶供电所)",
            value: [113.01304, 22.71801, 2],
        },
        {
            name: "新会供电局",
            value: [113.052304, 22.533759, 2],
        },
        {
            name: "江门东成供电所",
            value: [112.39291, 22.245134, 2],
        },
        {
            name: "广东电网君堂供电所",
            value: [112.452013, 22.311722, 0.4],
        },
        {
            name: "中国南方电网广东电网恩城供电所",
            value: [112.319768, 22.192855, 0.9],
        },
        {
            name: "中国南方电网广东电网金鸡供电所",
            value: [112.492893, 22.166272, 0.5],
        },
        {
            name: "中国南方电网广东电网白沙供电所",
            value: [112.598189, 22.258682, 2],
        },
    ]

    var yangjiangdata = [{
            name: "中国南方电网广东电网阳江供电局",
            value: [111.98161, 21.866558, 0.5],
        },
        {
            name: "中国南方电网广东电网阳东供电局",
            value: [112.012834, 21.861248, 1],
        },
        {
            name: "广东电网阳春供电局",
            value: [111.795433, 22.169916, 1],
        },
        {
            name: "广东电网阳西供电局",
            value: [111.62116, 21.758367, 0.1],
        },
        {
            name: "广东电网潭水供电所",
            value: [111.615845, 22.049722, 0.4],
        },
        {
            name: "阳江阳东供电局那龙营业厅",
            value: [112.222081, 22.049915, 1],
        },
        {
            name: "阳江阳春供电局春湾供电所",
            value: [111.943258, 22.438607, 1.4],
        },
        {
            name: "阳江市阳江阳春供电局八甲供电所",
            value: [111.4295, 21.951889, 0.7],
        },
        {
            name: "阳江市阳江阳春供电局马水供电所",
            value: [111.696824, 22.133034, 0.1],
        },
        {
            name: "阳江市阳东供电局雅韶营业厅",
            value: [112.058128, 21.827999, 0.5],
        },
        {
            name: "阳江市阳江阳春供电局合水供电所",
            value: [111.881734, 22.313495, 2],
        },
        {
            name: "阳东区合山供电所",
            value: [112.127523, 21.968063, 0.9],
        },
        {
            name: "阳江河朗供电所",
            value: [111.878891, 22.549519, 2],
        },
        {
            name: "中国南方电网(阳江春城供电所)",
            value: [111.822835, 22.192068, 2],
        },
        {
            name: "广东电网充电站(阳江市阳江阳春供电局双滘供电所",
            value: [111.376732, 22.106486, 0.4],
        },
        {
            name: "阳江东平供电所",
            value: [112.221022, 21.75029, 0.6],
        },
        {
            name: "阳江市阳江阳春供电局岗美供电所",
            value: [111.763567, 22.052181, 2],
        },
        {
            name: "埠场供电所",
            value: [111.941276, 21.790143, 2],
        },
        {
            name: "石望供电所",
            value: [111.937092, 22.51111, 0.1],
        },
        {
            name: "阳江供电局阳东局新洲供电所",
            value: [112.286092, 21.860018, 0.9],
        },
        {
            name: "阳江潭水供电所",
            value: [111.615845, 22.049722, 0.5],
        },
        {
            name: "阳江供电局阳东局大沟供电所",
            value: [112.164151, 21.838414, 2],
        },
        {
            name: "阳西供电局新圩营业厅",
            value: [111.454181, 21.704751, 2],
        },
        {
            name: "阳西供电局儒洞营业厅",
            value: [111.44017, 21.607376, 2],
        },
        {
            name: "阳江市阳西供电局沙扒营业厅",
            value: [111.483071, 21.523061, 0.4],
        },
    ]

    var maomingdata = [{
            name: "茂名市供电局",
            value: [110.938245, 21.674315, 0.5],
        },
        {
            name: "化州供电局",
            value: [110.66952, 21.668575, 1],
        },
        {
            name: "中国南方电网信宜供电局",
            value: [110.953148, 22.369724, 1],
        },
        {
            name: "电白区供电局",
            value: [111.007124, 21.510316, 0.1],
        },
        {
            name: "广东电网公司茂港供电局",
            value: [111.032393, 21.472394, 0.4],
        },
        {
            name: "广东电网公司高州供电局",
            value: [110.861038, 21.912097, 1],
        },
        {
            name: "中国南方电网(茂南供电局)",
            value: [110.925024, 21.674754, 1.4],
        },
        {
            name: "鳌头供电所",
            value: [110.88441, 21.582198, 0.7],
        },
        {
            name: "广东省茂名市化州新供电局",
            value: [110.66952, 21.668575, 0.1],
        },
        {
            name: "茂名供电局旦场供电所",
            value: [111.105758, 21.526847, 0.5],
        },
        {
            name: "茂名市高州石鼓供电所",
            value: [110.791548, 21.83676, 2],
        },
        {
            name: "茂名市茂南新坡供电所",
            value: [110.908764, 21.66829, 0.9],
        },
        {
            name: "中国南方电网茂名供电局高山供电所",
            value: [110.909694, 21.658916, 2],
        },
        {
            name: "茂名市高州宝光供电所",
            value: [110.882293, 21.926437, 2],
        },
        {
            name: "茂名市高州金山供电所",
            value: [110.870891, 21.823205, 0.4],
        },
        {
            name: "茂名市高州长坡供电所",
            value: [111.014663, 22.05745, 0.6],
        },
        {
            name: "茂名观珠供电所",
            value: [111.17464, 21.701151, 2],
        },
        {
            name: "化州市供电局平定供电所",
            value: [110.432058, 22.023007, 2],
        },
        {
            name: "茂名池洞供电所",
            value: [110.952031, 22.4401, 0.1],
        },
        {
            name: "广东电网公司新坡供电所",
            value: [110.90876, 21.668204, 0.9],
        },
        {
            name: "中国南方电网广东电网公司东镇供电所",
            value: [110.948614, 22.347153, 0.5],
        },
        {
            name: "茂名岭门供电所",
            value: [111.386568, 21.577617, 2],
        },
        {
            name: "茂名金山开发区供电局",
            value: [110.870815, 21.824083, 2],
        },
        {
            name: "中国南方电网袂花供电所",
            value: [110.926075, 21.620583, 2],
        },
        {
            name: "广东电网镇盛供电所",
            value: [110.858347, 21.616147, 0.4],
        },
        {
            name: "茂名洪冠供电所",
            value: [111.124717, 22.482796, 0.5],
        },
    ]

    var zhanjiangdata = [{
            name: "广东电网湛江供电局",
            value: [110.421258, 21.216352, 0.5],
        },
        {
            name: "广东电网公司湛江麻章供电局",
            value: [110.326041, 21.278372, 1],
        },
        {
            name: "广东电网公司湛江(赤坎供电局)",
            value: [110.349612, 21.281267, 1],
        },
        {
            name: "广东电网湛江廉江供电局",
            value: [110.277331, 21.62687, 0.1],
        },
        {
            name: "广东电网湛江雷州供电局",
            value: [110.092179, 20.920708, 0.4],
        },
        {
            name: "广东电网公司湛江坡头供电局",
            value: [110.469952, 21.244794, 1],
        },
        {
            name: "湛江遂溪供电局",
            value: [110.270834, 21.391145, 1.4],
        },
        {
            name: "广东电网公司霞山供电局",
            value: [110.421293, 21.205842, 0.7],
        },
        {
            name: "广东电网吴川供电局",
            value: [110.785196, 21.435132, 0.1],
        },
        {
            name: "广东电网公司东海供电局",
            value: [110.359909, 21.028447, 0.5],
        },
        {
            name: "广东电网徐闻供电局",
            value: [110.199066, 20.315232, 2],
        },
        {
            name: "湛江遂城供电局",
            value: [110.259613, 21.384532, 0.9],
        },
        {
            name: "湛江白沙供电所",
            value: [110.098714, 20.944728, 2],
        },
        {
            name: "湛江坡头供电所",
            value: [110.511939, 21.275547, 2],
        },
        {
            name: "湛江沈塘供电所",
            value: [110.127439, 20.989692, 0.4],
        },
        {
            name: "湛江杨家供电所",
            value: [109.970756, 20.901408, 0.6],
        },
        {
            name: "湛江前山供电所",
            value: [110.472527, 20.429968, 2],
        },
        {
            name: "湛江新城供电所",
            value: [110.070624, 20.94415, 2],
        },
        {
            name: "南方电网(石城供电所)",
            value: [110.295855, 21.609909, 0.2],
        },
        {
            name: "南方电网(附城供电所)",
            value: [110.082061, 20.919489, 0.6],
        },
        {
            name: "广东电网公司石岭供电所",
            value: [110.133459, 21.647343, 2],
        },
        {
            name: "中国南方电网吴阳供电所",
            value: [110.695652, 21.349852, 0],
        },
    ]

    var yunfudata = [{
            name: "中国南方电网广东电网云浮供电局",
            value: [112.069868, 22.94008, 0.5],
        },
        {
            name: "广东电网云浮云安供电局",
            value: [112.006652, 23.062779, 1],
        },
        {
            name: "云浮新兴县供电局",
            value: [112.233824, 22.689018, 1],
        },
        {
            name: "云浮郁南供电局",
            value: [111.533442, 23.25434, 0.1],
        },
        {
            name: "云浮罗城供电局",
            value: [111.58066, 22.772622, 0.4],
        },
        {
            name: "云浮市新兴供电局",
            value: [112.234199, 22.688805, 1],
        },
        {
            name: "云浮河头供电局",
            value: [112.066359, 22.587766, 1.4],
        },
        {
            name: "广东电网罗定供电局",
            value: [111.58577, 22.772756, 0.7],
        },
        {
            name: "广东电网公司(云城供电局)",
            value: [112.042495, 22.913684, 0.1],
        },
        {
            name: "云浮供电局河口供电所",
            value: [112.123817, 22.957712, 0.5],
        },
        {
            name: "云浮东安供电所",
            value: [112.062561, 22.959493, 2],
        },
        {
            name: "中国南方电网云浮供电局安塘供电所",
            value: [112.193699, 22.940328, 0.9],
        },
        {
            name: "中国南方电网(天堂供电所)",
            value: [112.03872, 22.576998, 2],
        },
        {
            name: "云浮市云安供电局白石营业厅",
            value: [111.799154, 22.821589, 2],
        },
        {
            name: "中国南方电网郁南大湾营业厅",
            value: [111.641238, 22.827144, 0.4],
        },
        {
            name: "中国南方电网(郁南南江口营业厅)",
            value: [111.826702, 23.127543, 0.6],
        },
        {
            name: "中国南方电网郁南历洞营业厅",
            value: [111.668374, 22.980437, 2],
        },
        {
            name: "中国南方电网(罗定黎少营业厅)",
            value: [111.467385, 22.722981, 2],
        },
        {
            name: "中国南方电网罗定连州营业厅",
            value: [111.441469, 22.650869, 0.2],
        },
        {
            name: "中国南方电网(罗定素龙营业厅)",
            value: [111.60845, 22.732536, 0.6],
        },
        {
            name: "中国南方电网(罗定满塘营业厅)",
            value: [111.710646, 22.626175, 2],
        },
    ]

    var zhaoqingdata = [{
            name: "肇庆市供电局",
            value: [112.507826, 23.075056, 0.5],
        },
        {
            name: "肇庆高要供电局",
            value: [112.470134, 23.021423, 1],
        },
        {
            name: "广东电网肇庆德庆供电局",
            value: [111.782078, 23.155412, 1],
        },
        {
            name: "肇庆沙尾供电局",
            value: [112.707056, 23.345605, 0.1],
        },
        {
            name: "广东电网公司端州供电局",
            value: [112.492248, 23.061587, 0.4],
        },
        {
            name: "广东电网公司大旺供电局",
            value: [112.836321, 23.297779, 1],
        },
        {
            name: "中国南方电网广东电网公司怀集供电局",
            value: [112.188681, 23.915679, 1.4],
        },
        {
            name: "广东电网公司广宁供电局",
            value: [112.439618, 23.630393, 0.7],
        },
        {
            name: "中国南方电网广东电网公司鼎湖供电局",
            value: [112.573735, 23.161398, 0.1],
        },
        {
            name: "中国南方电网广东电网封开供电局",
            value: [111.512314, 23.415769, 0.5],
        },
        {
            name: "广东电网公司四会供电局",
            value: [112.737347, 23.333842, 2],
        },
        {
            name: "肇庆南岸供电所",
            value: [112.463957, 23.034717, 0.9],
        },
        {
            name: "肇庆四会供电局东城供电所",
            value: [112.726153, 23.339888, 2],
        },
        {
            name: "肇庆龙甫供电所",
            value: [112.74805, 23.407628, 2],
        },
        {
            name: "肇庆德庆供电局播植供电所",
            value: [112.169568, 23.288502, 0.4],
        },
        {
            name: "肇庆德庆供电局悦城供电所",
            value: [112.137049, 23.094598, 0.6],
        },
        {
            name: "肇庆德庆供电局马圩供电所",
            value: [111.849009, 23.233654, 2],
        },
        {
            name: "中国南方电网(广东电网睦岗供电所)",
            value: [112.428693, 23.070882, 2],
        },
        {
            name: "中国南方电网广东电网公司江口供电所",
            value: [111.50837, 23.445368, 0.2],
        },
        {
            name: "中国南方电网广东电网公司怀城供电所",
            value: [112.189514, 23.927198, 0.6],
        },
        {
            name: "肇庆莫村供电所",
            value: [112.122128, 23.410874, 2],
        },
    ]

    var qingyuandata = [{
            name: "中国南方电网公司清远市供电局",
            value: [113.093295, 23.685334, 0.5],
        },
        {
            name: "清远市阳山县供电局",
            value: [112.638287, 24.472381, 1],
        },
        {
            name: "广东电网清新供电局",
            value: [113.026265, 23.738724, 1],
        },
        {
            name: "广东电网清远英德供电局",
            value: [113.425743, 24.183114, 0.1],
        },
        {
            name: "广东电网公司清远连州供电局",
            value: [112.388521, 24.790579, 0.4],
        },
        {
            name: "广东电网清城供电局",
            value: [113.052302, 23.697065, 1],
        },
        {
            name: "广东电网佛冈供电局",
            value: [113.547514, 23.876392, 1.4],
        },
        {
            name: "广东电网公司连山供电局",
            value: [112.102291, 24.575347, 0.7],
        },
        {
            name: "清远连南供电局",
            value: [112.29315, 24.7226, 0.1],
        },
        {
            name: "清远市清城供电局源潭供电所",
            value: [113.197783, 23.673151, 0.5],
        },
        {
            name: "广东电网公司(横荷供电所)",
            value: [113.062082, 23.659834, 2],
        },
        {
            name: "清城供电局龙塘供电所",
            value: [113.081657, 23.607799, 0.9],
        },
        {
            name: "清远汤塘供电所",
            value: [113.49131, 23.746503, 2],
        },
        {
            name: "清远石角供电所",
            value: [112.979508, 23.564192, 2],
        },
        {
            name: "中国南方电网广东电网公司洲心供电所",
            value: [113.092834, 23.68152, 0.4],
        },
        {
            name: "广东电网公司三江供电所",
            value: [112.290054, 24.722298, 0.6],
        },
        {
            name: "中国南方电网(大湾供电所)",
            value: [112.954343, 24.347929, 2],
        },
        {
            name: "中国南方电网(太平营业厅)",
            value: [112.569582, 24.263406, 2],
        },
        {
            name: "清远市清新供电局禾云营业厅",
            value: [112.928595, 23.925249, 0.2],
        },
        {
            name: "清远市清新供电局太平营业厅",
            value: [112.892345, 23.676486, 0.6],
        },
    ]

    var shaoguandata = [{
            name: "中国南方电网公司韶关市供电局",
            value: [113.586746, 24.811031, 0.5],
        },
        {
            name: "广东电网始兴供电局",
            value: [114.073487, 24.956218, 1],
        },
        {
            name: "乳源县供电局",
            value: [113.284018, 24.784697, 1],
        },
        {
            name: "韶关市曲江区供电局",
            value: [113.612442, 24.684323, 0.1],
        },
        {
            name: "韶关南雄市供电局",
            value: [114.317009, 25.118758, 0.4],
        },
        {
            name: "广东电网公司韶关仁化供电局",
            value: [113.749579, 25.095096, 1],
        },
        {
            name: "广东电网公司韶关翁源供电局",
            value: [114.145216, 24.351127, 1.4],
        },
        {
            name: "广东电网有限责任公司韶关城区供电局",
            value: [113.593675, 24.767475, 0.7],
        },
        {
            name: "韶关市韶关新丰供电局",
            value: [114.218715, 24.06546, 0.1],
        },
        {
            name: "广东电网公司韶关武江供电局",
            value: [114.073487, 24.956218, 0.5],
        },
        {
            name: "广东电网公司韶关乐昌供电局",
            value: [113.360114, 25.134251, 2],
        },
        {
            name: "广东电网公司韶关浈江供电局",
            value: [113.593522, 24.767383, 0.9],
        },
        {
            name: "广东电网公司韶关坪石供电局",
            value: [113.068391, 25.288776, 2],
        },
        {
            name: "中国南方电网韶关供电局丹霞供电所",
            value: [113.746526, 25.08009, 2],
        },
        {
            name: "韶关市郊供电局",
            value: [113.58981, 24.800221, 0.4],
        },
        {
            name: "韶关马坝供电所",
            value: [113.621278, 24.683844, 0.6],
        },
        {
            name: "广东电网充电站(西河供电所)",
            value: [113.587867, 24.811133, 2],
        },
        {
            name: "南方电网韶关新江供电所",
            value: [113.839551, 24.462083, 2],
        },
        {
            name: "广东电网有限责任公司韶关坪石供电所",
            value: [113.068393, 25.288775, 0.2],
        },
        {
            name: "广东电网韶关市供电所",
            value: [114.157266, 25.032789, 0.6],
        },
        {
            name: "韶关坝仔供电所",
            value: [114.132036, 24.522649, 2],
        },
        {
            name: "广东电网充电站(韶关市雄州供电所)",
            value: [114.321926, 25.117311, 0],
        },
        {
            name: "中国南方电网韶关供电局丹霞供电所",
            value: [113.746526, 25.08009, 1],
        },
        {
            name: "广东电网充电站(韶关市乳城供电所)",
            value: [113.283923, 24.784694, 1],
        },
        {
            name: "韶关百顺供电所",
            value: [114.03375, 25.1922, 1],
        },
        {
            name: "广东电网珠玑供电所",
            value: [114.3642, 25.18861, 0.1],
        },
        {
            name: "韶关翁源铁龙供电所",
            value: [113.692551, 24.504163, 0.4],
        },
        {
            name: "韶关浈江花坪供电所",
            value: [113.574342, 25.003415, 1],
        },
        {
            name: "乐昌市三溪镇三溪供电所",
            value: [112.884613, 25.285766, 1.4],
        },
        {
            name: "韶关罗坝供电所",
            value: [114.217111, 24.866796, 0.7],
        },
        {
            name: "中国南方电网(梅坑供电所)",
            value: [114.122791, 24.011784, 0.1],
        },
        {
            name: "中国南方电网广东电网公司雄州供电所",
            value: [114.321898, 25.117334, 0.5],
        },
    ]

    var huizhoudata = [{
            name: "中国南方电网(广东电网惠州供电局)",
            value: [114.423826, 23.127746, 0.5],
        },
        {
            name: "惠州供电局",
            value: [114.442629, 23.094286, 1],
        },
        {
            name: "惠州市供电局",
            value: [114.420541, 23.115163, 1],
        },
        {
            name: "广东电网惠州大亚湾供电局",
            value: [114.530704, 22.749225, 0.1],
        },
        {
            name: "惠州龙门供电局",
            value: [114.274599, 23.725574, 0.4],
        },
        {
            name: "中国南方电网广东电网仲恺供电局",
            value: [114.321197, 23.02639, 1],
        },
        {
            name: "广东电网惠州博罗供电局",
            value: [114.292047, 23.176833, 1.4],
        },
        {
            name: "中国南方电网广东电网惠阳供电局",
            value: [114.474852, 22.798954, 0.7],
        },
        {
            name: "中国南方电网广东电网公司(惠州惠城供电局)",
            value: [114.411824, 23.076125, 0.1],
        },
        {
            name: "广东电网惠东供电局",
            value: [114.753427, 22.967815, 0.5],
        },
        {
            name: "惠州沙田供电局",
            value: [114.552535, 22.862257, 2],
        },
        {
            name: "惠州阳光花园供电局",
            value: [114.291934, 23.176864, 0.9],
        },
        {
            name: "惠州柏塘供电所",
            value: [114.382148, 23.398885, 2],
        },
        {
            name: "惠州水口供电所",
            value: [114.459509, 23.104143, 2],
        },
        {
            name: "中国南方电网惠州供电局平潭供电所",
            value: [114.57081, 23.046341, 0.4],
        },
        {
            name: "惠州湖镇供电所",
            value: [114.154238, 23.248328, 0.6],
        },
        {
            name: "惠州石湾供电所",
            value: [113.866822, 23.139369, 2],
        },
        {
            name: "惠州博罗供电局麻陂供电所",
            value: [114.534052, 23.490552, 2],
        },
        {
            name: "中国南方电网广东电网公司陈江供电所",
            value: [114.322006, 23.014264, 0.2],
        },
        {
            name: "惠州博罗供电局观音阁供电所",
            value: [114.596061, 23.407378, 0.6],
        },
        {
            name: "中共广东电网公司惠州惠东供电局白花供电所",
            value: [114.656617, 22.945885, 2],
        },
        {
            name: "惠州博罗平安供电所",
            value: [114.309035, 23.347153, 0],
        },
        {
            name: "惠州多祝供电所",
            value: [114.953542, 23.036681, 1],
        },
        {
            name: "惠州潼湖供电所",
            value: [114.195821, 23.087813, 1],
        },
        {
            name: "龙门供电局龙城供电所",
            value: [114.262296, 23.736703, 1],
        },
    ]

    var shenzhendata = [{
            name: "深圳供电局",
            value: [114.119205, 22.548959, 0.5],
        },
        {
            name: "深圳坪山供电局",
            value: [114.358586, 22.706224, 1],
        },
        {
            name: "深圳大鹏供电局",
            value: [114.421027, 22.634934, 1],
        },
        {
            name: "深圳供电局有限公司(龙岗供电局)",
            value: [114.233201, 22.727441, 0.1],
        },
        {
            name: "中国南方电网深圳南山供电局",
            value: [113.921878, 22.56231, 0.4],
        },
        {
            name: "南方电网深圳供电局有限公司龙华供电局",
            value: [114.046322, 22.709897, 1],
        },
        {
            name: "中国南方电网深圳供电局有限公司福永供电分局",
            value: [113.832026, 22.671714, 1.4],
        },
        {
            name: "深圳供电局有限公司盐田供电局",
            value: [114.247305, 22.564857, 0.7],
        },
        {
            name: "中国南方电网深圳供电有限公司光明供电局",
            value: [113.897799, 22.788038, 0.1],
        },
        {
            name: "中国南方电网深圳市供电局有限公司宝安区供电局",
            value: [113.915898, 22.56835, 0.5],
        },
        {
            name: "深圳供电局有限公司罗湖供电局",
            value: [114.13603, 22.57074, 2],
        },
        {
            name: "深圳龙岗供电局布吉供电分局",
            value: [114.133311, 22.612382, 0.9],
        },
        {
            name: "深圳沙井供电局",
            value: [113.841232, 22.725084, 2],
        },
        {
            name: "深圳龙岗供电局横岗供电分局",
            value: [114.218016, 22.654237, 2],
        },
        {
            name: "深圳供电局有限公司福永供电所",
            value: [113.832026, 22.671714, 0.4],
        },
        {
            name: "深圳光明供电所",
            value: [113.955031, 22.766218, 0.6],
        },
        {
            name: "中国南方电网深圳供电局公司(布吉供电所)",
            value: [114.133456, 22.612235, 2],
        },
        {
            name: "深圳南山供电所",
            value: [113.923483, 22.562245, 2],
        },
        {
            name: "深圳葵冲供电所",
            value: [114.421251, 22.634935, 0.2],
        },
        {
            name: "中国南方电网深圳供电局公司坪地供电所",
            value: [114.315574, 22.778877, 0.6],
        },
        {
            name: "深圳龙华供电所",
            value: [114.046775, 22.709839, 2],
        },
    ]

    var heyuandata = [{
            name: "广东电网河源供电局",
            value: [114.694594, 23.751516, 0.5],
        },
        {
            name: "河源龙川县供电局",
            value: [115.266094, 24.103491, 1],
        },
        {
            name: "广东电网公司(河源东源供电局)",
            value: [114.749584, 23.79978, 1],
        },
        {
            name: "广东电网公司河源源城供电局",
            value: [114.697781, 23.761522, 0.1],
        },
        {
            name: "广东电网公司紫金供电局",
            value: [115.179627, 23.640688, 0.4],
        },
        {
            name: "广东电网和平供电局",
            value: [114.94657, 24.440013, 1],
        },
        {
            name: "广东电网连平供电局",
            value: [114.494644, 24.374239, 1.4],
        },
        {
            name: "中国南方电网河源彭寨供电所",
            value: [115.084089, 24.360601, 0.7],
        },
        {
            name: "中国南方电网河源大坝供电所",
            value: [114.946716, 24.504011, 0.1],
        },
        {
            name: "中国南方电网(东水供电所)",
            value: [115.182174, 24.262944, 2],
        },
        {
            name: "河源内莞供电所",
            value: [114.562882, 24.375973, 0.9],
        },
        {
            name: "中国南方电网河源北郊供电所",
            value: [114.690464, 23.750414, 2],
        },
        {
            name: "中国南方电网广东电网公司高埔供电所",
            value: [114.666246, 23.657898, 2],
        },
        {
            name: "中国南方电网(广东电网公司上坪供电所)",
            value: [114.602038, 24.490039, 0.4],
        },
        {
            name: "中国南方电网广东电网公司忠信供电所",
            value: [114.729952, 24.219338, 0.6],
        },
        {
            name: "中国南方电网(黄石营业厅)",
            value: [115.263965, 24.320778, 2],
        },
        {
            name: "广东电网公司河源东源供电局船塘农电所",
            value: [114.953685, 24.166729, 2],
        },
        {
            name: "广东电网充电站(紫金供电局义容营业厅)",
            value: [114.838777, 23.526025, 0.2],
        },
    ]

    var meizhoudata = [{
            name: "广东电网公司梅州供电局",
            value: [116.137289, 24.290574, 0.5],
        },
        {
            name: "广东电网梅州供电局",
            value: [116.132492, 24.332769, 1],
        },
        {
            name: "广东电网梅州供电局",
            value: [116.092248, 24.276083, 1],
        },
        {
            name: "中国南方电网广东电网公司梅州城区供电局",
            value: [116.133042, 24.305954, 0.4],
        },
        {
            name: "广东电网公司(梅县区供电局)",
            value: [116.085476, 24.291566, 1],
        },
        {
            name: "广东电网公司丰顺供电局",
            value: [116.192503, 23.746164, 1.4],
        },
        {
            name: "广东电网蕉岭供电局",
            value: [116.184867, 24.665043, 0.7],
        },
        {
            name: "广东电网平远供电局",
            value: [115.910717, 24.586973, 0.1],
        },
        {
            name: "广东电网大埔供电局",
            value: [116.700971, 24.356733, 0.5],
        },
        {
            name: "广东电网兴宁供电局",
            value: [115.736101, 24.134018, 2],
        },
        {
            name: "梅州安流供电所",
            value: [115.678974, 23.716299, 0.9],
        },
        {
            name: "广东电网公司(五华县供电局)",
            value: [115.783819, 23.927559, 2],
        },
        {
            name: "广东电网坭陂供电所",
            value: [115.826381, 24.086159, 2],
        },
        {
            name: "中国南方电网梅县区供电局(梅南供电所)",
            value: [116.093222, 24.157213, 0.4],
        },
        {
            name: "中国南方电网广东电网公司(汤西供电所)",
            value: [116.156754, 23.772216, 0.6],
        },
    ]

    var chaozhoudata = [{
            name: "广东电网潮州供电局",
            value: [116.633185, 23.676154, 0.5],
        },
        {
            name: "广东电网公司饶平供电局",
            value: [116.998844, 23.681158, 1],
        },
        {
            name: "广东电网潮安供电局",
            value: [116.690328, 23.476923, 1],
        },
        {
            name: "广东电网枫溪供电局",
            value: [116.601313, 23.661043, 0.1],
        },
        {
            name: "潮州所城供电局",
            value: [117.116983, 23.612386, 0.4],
        },
        {
            name: "广东电网湘桥供电局",
            value: [116.640431, 23.670807, 1],
        },
        {
            name: "广东电网公司凤凰供电所",
            value: [116.711759, 23.914457, 1.4],
        },
        {
            name: "中国南方电网江东供电所",
            value: [116.67913, 23.59578, 0.7],
        },
        {
            name: "广东电网饶平供电局柘林供电所",
            value: [117.099537, 23.583055, 0.1],
        },
        {
            name: "南方电网(文祠供电所)",
            value: [116.676758, 23.759461, 0.5],
        },
        {
            name: "潮州登塘供电所",
            value: [116.461681, 23.743768, 2],
        },
        {
            name: "中国南方电网广东电网公司(古巷供电所)",
            value: [116.579035, 23.664663, 0.9],
        },
        {
            name: "中国南方电网广东电网公司(庵埠供电所)",
            value: [116.684774, 23.471492, 2],
        },
        {
            name: "南方电网(联饶供电所)",
            value: [116.993486, 23.731522, 2],
        },
        {
            name: "广东电网(上饶供电所)",
            value: [116.917833, 24.154144, 0.4],
        },
        {
            name: "潮州海山供电所",
            value: [116.987152, 23.552825, 0.6],
        },
    ]

    var jieyangdata = [{
            name: "广东电网揭阳供电局",
            value: [116.381503, 23.544613, 0.5],
        },
        {
            name: "南方电网揭阳供电局",
            value: [116.336871, 23.55312, 1],
        },
        {
            name: "揭阳供电局(上砂供电所)",
            value: [115.707367, 23.468451, 1],
        },
        {
            name: "揭阳揭东供电局开发区供电所",
            value: [116.43537, 23.578811, 0.1],
        },
        {
            name: "广东电网公司揭阳揭东供电局",
            value: [116.419413, 23.580348, 0.4],
        },
        {
            name: "中国南方电网揭阳供电局大南山供电所",
            value: [116.095456, 23.014812, 1],
        },
        {
            name: "揭阳市榕城供电局榕东供电所",
            value: [116.411343, 23.547749, 1.4],
        },
        {
            name: "中国南方电网广东电网揭阳惠来葵潭供电所",
            value: [115.992892, 23.066383, 0.7],
        },
        {
            name: "中国南方电网(广东电网普宁供电局)",
            value: [116.159311, 23.304849, 0.1],
        },
        {
            name: "广东电网揭阳揭西供电局",
            value: [115.849341, 23.445116, 0.5],
        },
        {
            name: "广东电网榕城供电局",
            value: [116.350279, 23.55414, 2],
        },
        {
            name: "揭阳供电局地都供电所",
            value: [116.559083, 23.452362, 0.9],
        },
        {
            name: "中国南方电网揭阳供电局(普侨供电所)",
            value: [115.99925, 23.343302, 2],
        },
        {
            name: "揭东供电局龙尾供电所",
            value: [116.158951, 23.575799, 2],
        },
        {
            name: "中国南方电网广东电网公司惠来供电局",
            value: [116.312843, 23.036866, 0.4],
        },
        {
            name: "中国南方电网揭东供电局霖磐供电所",
            value: [116.249037, 23.556735, 0.6],
        },
        {
            name: "揭阳市榕城供电局渔湖供电所",
            value: [116.43223, 23.515988, 2],
        },
        {
            name: "中国南方电网普宁供电局赤岗供电所",
            value: [116.184104, 23.439308, 2],
        },
        {
            name: "广东电网公司棉湖供电所",
            value: [116.153211, 23.447887, 0.2],
        },
        {
            name: "广东电网公司梅塘供电所",
            value: [116.086335, 23.352482, 0.6],
        },
        {
            name: "广东电网公司白塔供电所",
            value: [116.207175, 23.566018, 2],
        },
        {
            name: "中国南方电网揭阳岐石供电所",
            value: [116.141179, 22.916943, 0],
        },
        {
            name: "中国南方电网河婆供电所",
            value: [115.841426, 23.429573, 1],
        },
        {
            name: "中国南方电网德东供电所",
            value: [116.276375, 23.567735, 1],
        },
        {
            name: "中国南方电网(揭西供电局上砂供电所)",
            value: [115.707648, 23.468054, 1],
        },
        {
            name: "中国南方电网(大池供电所)",
            value: [115.988686, 23.342672, 0.1],
        },
        {
            name: "广东电网公司广太供电所",
            value: [116.285505, 23.469195, 0.4],
        },
    ]

    var shantoudata = [{
            name: "中国南方电网汕头供电局",
            value: [116.710672, 23.372707, 0.5],
        },
        {
            name: "汕头供电局",
            value: [116.708636, 23.380592, 1],
        },
        {
            name: "广东电网汕头潮南供电局",
            value: [116.504029, 23.193675, 1],
        },
        {
            name: "中国南方电网广东电网公司汕头濠江供电局",
            value: [116.742072, 23.28684, 0.1],
        },
        {
            name: "汕头市金平区供电局",
            value: [116.707179, 23.372207, 0.4],
        },
        {
            name: "广东电网汕头潮阳供电局",
            value: [116.614455, 23.267414, 1],
        },
        {
            name: "中国南方电网广东电网汕头澄海供电局",
            value: [116.757986, 23.469542, 1.4],
        },
        {
            name: "广东电网公司汕头龙湖供电局",
            value: [116.751368, 23.386946, 0.7],
        },
        {
            name: "广东电网公司汕头凤翔供电局",
            value: [116.791668, 23.460185, 0.1],
        },
        {
            name: "汕头市南澳供电局长山尾",
            value: [116.953016, 23.436777, 0.5],
        },
        {
            name: "南澳县电力厂路1供电局",
            value: [117.03645, 23.424036, 2],
        },
        {
            name: "贵屿供电所",
            value: [116.369541, 23.323542, 0.9],
        },
        {
            name: "汕头濠江供电所",
            value: [116.741907, 23.28661, 2],
        },
        {
            name: "汕头井都供电所",
            value: [116.555864, 23.187434, 2],
        },
        {
            name: "汕头潮南供电局雷岭供电所",
            value: [116.379422, 23.090323, 0.4],
        },
        {
            name: "广东电网公司成田供电所",
            value: [116.493271, 23.190234, 0.6],
        },
        {
            name: "广东电网公司胪岗供电所",
            value: [116.456443, 23.211757, 2],
        },
        {
            name: "中国南方电网广东电网公司陈店供电所",
            value: [116.343333, 23.27658, 2],
        },
        {
            name: "广东电网陇田供电所",
            value: [116.531842, 23.149191, 0.2],
        },
        {
            name: "中国南方电网(谷饶供电所)",
            value: [116.408806, 23.349738, 0.6],
        },
        {
            name: "广东电网公司两英供电所",
            value: [116.376808, 23.232632, 2],
        },
        {
            name: "广东电网(河溪供电所)",
            value: [116.528504, 23.364924, 0],
        },
        {
            name: "中国南方电网广东电网公司棉北供电所",
            value: [116.612378, 23.277847, 1],
        },
        {
            name: "广东电网公司上华供电所",
            value: [116.741673, 23.519025, 1],
        },
    ]

    var shanweidata = [{
            name: "中国南方电网广东电网公司(汕尾供电局)",
            value: [115.383547, 22.792008, 0.5],
        },
        {
            name: "广东电网公司(汕尾城区供电局)",
            value: [115.369396, 22.780375, 1],
        },
        {
            name: "广东汕尾陆丰供电局",
            value: [115.641622, 22.952475, 1],
        },
        {
            name: "广东电网公司汕尾红海湾供电局",
            value: [115.510514, 22.727038, 0.1],
        },
        {
            name: "广东电网汕尾陆河供电局",
            value: [115.666702, 23.298957, 0.4],
        },
        {
            name: "深汕特别合作区供电局",
            value: [114.983018, 22.834259, 1],
        },
        {
            name: "中国南方电网(海丰县供电局)",
            value: [115.322568, 22.968443, 1.4],
        },
        {
            name: "深圳供电局有限公司(赤石供电分局)",
            value: [115.078027, 22.882837, 0.7],
        },
        {
            name: "汕尾内湖供电所",
            value: [115.846516, 22.972327, 0.1],
        },
        {
            name: "中国南方电网(汕尾南塘供电所)",
            value: [115.930842, 22.911486, 0.5],
        },
        {
            name: "汕尾河东供电所",
            value: [115.663187, 22.957531, 2],
        },
        {
            name: "汕尾供电局陶河供电所",
            value: [115.399794, 22.8998, 0.9],
        },
        {
            name: "汕尾大安供电所",
            value: [115.628809, 23.083172, 2],
        },
        {
            name: "广东电网城东供电所",
            value: [115.664571, 22.950786, 2],
        },
        {
            name: "广东电网桥冲供电所",
            value: [115.794175, 22.928218, 0.4],
        },
        {
            name: "中国南方电网汕尾供电局(河田供电所)",
            value: [115.673363, 23.309495, 0.6],
        },
        {
            name: "广东南方电网河西供电所",
            value: [115.609206, 22.959276, 2],
        },
        {
            name: "汕尾金厢供电所",
            value: [115.719607, 22.86351, 2],
        },
        {
            name: "汕尾东洲供电所",
            value: [115.537566, 22.717818, 0.2],
        },
        {
            name: "广东电网公司河东供电所",
            value: [115.663495, 22.957499, 0.6],
        },
        {
            name: "中国南方电网(碣石供电所)",
            value: [115.840124, 22.831978, 2],
        },
        {
            name: "汕尾捷胜供电所",
            value: [115.461264, 22.727936, 0],
        },
        {
            name: "中国南方电网(汕尾甲西供电所)",
            value: [116.066093, 22.880195, 1],
        },
        {
            name: "广东电网大湖供电所",
            value: [115.569922, 22.836005, 1],
        },
        {
            name: "汕尾大安供电所",
            value: [115.62869, 23.08325, 1],
        },
        {
            name: "中国南方电网广东电网(甲西供电所)",
            value: [116.070099, 22.880961, 0.1],
        },
        {
            name: "中国南方电网(潭西供电所)",
            value: [115.589565, 22.957715, 0.4],
        },
        {
            name: "中国南方电网广东电网公司(东海供电所)",
            value: [115.636605, 22.954859, 1],
        },
    ]
    
    var opt = {
        bgColor: '#013954', // 画布背景色
        mapName: '广东', // 地图名
        goDown: true, // 是否下钻
        // 下钻回调
        callback: function(name, option, instance) {
            console.log(name, option, instance);
            if (name == '广东') {
                option.series[0].data = convertData(gdDatas);
                option.series[1].data = gdDatas.map(function(dataItem) {
                    return {
                        name: dataItem[0].name,
                        value: gdGeoCoordMap[dataItem[0].name].concat([dataItem[0].value])
                    };
                });
                myChart.setOption(option, true);
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "东莞市") {
                option.series[0].data = convertData1(dongguandata);
                option.series[1].data = dongguandata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "佛山市") {
                option.series[0].data = convertData1(foshandata);
                option.series[1].data = foshandata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "广州市") {
                option.series[0].data = convertData1(guangzhoudata);
                option.series[1].data = guangzhoudata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "中山市") {
                option.series[0].data = convertData1(zhongshandata);
                option.series[1].data = zhongshandata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "珠海市") {
                option.series[0].data = convertData1(zhuhaidata);
                option.series[1].data = zhuhaidata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "江门市") {
                option.series[0].data = convertData1(jiangmendata);
                option.series[1].data = jiangmendata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "阳江市") {
                option.series[0].data = convertData1(yangjiangdata);
                option.series[1].data = yangjiangdata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "茂名市") {
                option.series[0].data = convertData1(maomingdata);
                option.series[1].data = maomingdata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "清远市") {
                option.series[0].data = convertData1(qingyuandata);
                option.series[1].data = qingyuandata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "湛江市") {
                option.series[0].data = convertData1(zhanjiangdata);
                option.series[1].data = zhanjiangdata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "云浮市") {
                option.series[0].data = convertData1(yunfudata);
                option.series[1].data = yunfudata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "肇庆市") {
                option.series[0].data = convertData1(zhaoqingdata);
                option.series[1].data = zhaoqingdata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "韶关市") {
                option.series[0].data = convertData1(shaoguandata);
                option.series[1].data = shaoguandata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "惠州市") {
                option.series[0].data = convertData1(huizhoudata);
                option.series[1].data = huizhoudata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "深圳市") {
                option.series[0].data = convertData1(shenzhendata);
                option.series[1].data = shenzhendata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "河源市") {
                option.series[0].data = convertData1(heyuandata);
                option.series[1].data = heyuandata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "梅州市") {
                option.series[0].data = convertData1(meizhoudata);
                option.series[1].data = meizhoudata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "潮州市") {
                option.series[0].data = convertData1(chaozhoudata);
                option.series[1].data = chaozhoudata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "揭阳市") {
                option.series[0].data = convertData1(jieyangdata);
                option.series[1].data = jieyangdata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == "汕头市") {
                option.series[0].data = convertData1(shantoudata);
                option.series[1].data = shantoudata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            } else if (name == '汕尾市') {
                option.series[0].data = convertData1(shanweidata);
                option.series[1].data = shanweidata;
                myChart.setOption(option, true); // 赋值后初始化
                setTimeout(() => { // 定时后启动飞线
                    myChart.setOption(option, true);
                }, 500)
            }
        },
        // 数据展示            	
        data: []
    };


    var levelColorMap = { // level颜色
        '1': '#f44336',
        '2': '#fc9700',
        '3': '#ffde00',
        '4': '#00eaff'
    };

    var defaultOpt = {
        mapName: 'china', // 地图展示
        goDown: false, // 是否下钻
        bgColor: '#013954', // 画布背景色
        activeArea: [], // 区域高亮,同echarts配置项
        data: [],
        // 下钻回调(点击的地图名、实例对象option、实例对象)
        callback: function(name, option, instance) {}
    };
    if (opt) {
        opt1 = $.extend(defaultOpt, opt);
    }

    // 层级索引
    var name = [opt1.mapName];
    var idx = 0;
    var pos = { //层级位置
        leftPlus: 55,
        leftCur: 50,
        left: 10,
        top: 10
    };

    var line = [ //箭头
        [0, 0],
        [8, 11],
        [0, 22]
    ];

    // style样式
    var style = {
        font: '18px "Microsoft YaHei", sans-serif',
        textColor: '#eee',
        lineColor: 'rgba(147, 235, 248, .8)'
    };


    var handleEvents = {
        /**
         * i 实例对象
         * o option
         * n 地图名
         **/
        resetOption: function(i, o, n) {
            console.log(i)
            console.log(o)
            console.log(n)
            var breadcrumb = this.createBreadcrumb(n);

            var j = name.indexOf(n);
            var l = o.graphic.length;
            if (j < 0) {
                console.log('jinru1')
                o.graphic.push(breadcrumb);
                o.graphic[0].children[0].shape.x2 = 195;
                o.graphic[0].children[1].shape.x2 = 195;
                if (o.graphic.length > 2) {
                    for (var x = 0; x < opt1.data.length; x++) {
                        if (n === opt1.data[x].name + '市') {
                            o.series[0].data = handleEvents.initSeriesData(opt1.data[x].data);
                            break;
                        } else o.series[0].data = [];
                    }
                }
                name.push(n);
                idx++;
            } else {
                console.log('jinru2', j)
                o.graphic.splice(j + 2, l);
                if (o.graphic.length <= 2) {
                    o.graphic[0].children[0].shape.x2 = 85;
                    o.graphic[0].children[1].shape.x2 = 85;
                    o.series[0].data = handleEvents.initSeriesData(gdDatas);
                }
                name.splice(j + 1, l);
                idx = j;
                pos.leftCur -= pos.leftPlus * (l - j - 1);
            }

            o.geo.map = n;
            o.geo.zoom = 1;
            i.clear();
            i.setOption(o);
            this.zoomAnimation();
            opt1.callback(n, o, i);
        },

        /**
         * name 地图名
         **/
        createBreadcrumb: function(name) {
            var cityToPinyin = {
                "广州市": "guangzhou",
                '东莞市': "dongguan",
                "中山市": "zhongshan",
                '云浮市': "yunfu",
                "佛山市": "foshan",
                "惠州市": "huizhou",
                "揭阳市": "jieyang",
                "梅州市": "meizhou",
                "汕头市": "shantou",
                "汕尾市": "shanwei",
                "江门市": "jiangmen",
                "河源市": "heyuan",
                "深圳市": "shenzhen",
                "清远市": "qingyuan",
                "湛江市": "zhanjiang",
                "潮州市": "chaozhou",
                "珠海市": "zhuhai",
                "肇庆市": "zhaoqing",
                "茂名市": "maoming",
                "阳江市": "yangjiang",
                "韶关市": "shaoguan"
            };
            var breadcrumb = {
                type: 'group',
                id: name,
                left: pos.leftCur + pos.leftPlus,
                top: pos.top + 3,
                children: [{
                    type: 'polyline',
                    left: -90,
                    top: -5,
                    shape: {
                        points: line
                    },
                    style: {
                        stroke: '#fff',
                        key: name,
                    },
                    onclick: function() {
                        var name = this.style.key;
                        handleEvents.resetOption(myChart, option, name);
                    }
                }, {
                    type: 'text',
                    left: -68,
                    top: 'middle',
                    style: {
                        text: name,
                        textAlign: 'center',
                        fill: style.textColor,
                        font: style.font
                    },
                    onclick: function() {
                        var name = this.style.text;
                        handleEvents.resetOption(myChart, option, name);
                    }
                }, {
                    type: 'text',
                    left: -68,
                    top: 10,
                    style: {

                        name: name,
                        text: cityToPinyin[name] ? cityToPinyin[name].toUpperCase() : '',
                        textAlign: 'center',
                        fill: style.textColor,
                        font: '12px "Microsoft YaHei", sans-serif',
                    },
                    onclick: function() {
                        // console.log(this.style);
                        var name = this.style.name;
                        handleEvents.resetOption(myChart, option, name);
                    }
                }]
            }

            pos.leftCur += pos.leftPlus;

            return breadcrumb;
        },

        // 设置effectscatter
        initSeriesData: function(data) {
            console.log(data, '22222222222')
            var temp = [];
            for (var i = 0; i < data.length; i++) {
                var geoCoord = gdGeoCoordMap[data[i].name];
                if (geoCoord) {
                    temp.push({
                        name: data[i].name,
                        value: geoCoord.concat(data[i].value, data[i].level)
                    });
                }
            }
            return temp;
        },

        zoomAnimation: function() {
            var count = null;
            var zoom = function(per) {
                if (!count) count = per;
                count = count + per;
                // console.log(per,count);
                myChart.setOption({
                    geo: {
                        zoom: count
                    }
                });
                if (count < 1) window.requestAnimationFrame(function() {
                    zoom(0.2);
                });
            };
            window.requestAnimationFrame(function() {
                zoom(0.2);
            });
        }
    };

    var convertData = function(data) {

        var res = [];
        for (var i = 0; i < data.length; i++) {
            var dataItem = data[i];
            var name = dataItem[0].name
            var fromCoord = gdGeoCoordMap[dataItem[0].name];
            var toCoord = [113.307649675, 23.1200491021]; //被攻击点坐标
            if (fromCoord && toCoord) {
                res.push([{
                    name: name,
                    coord: fromCoord,
                    value: dataItem[0].value
                }, {
                    coord: toCoord,
                }]);
            }
        }
        return res;
    };

    var convertData1 = function(data) {
        var res = [];
        for (var i = 0; i < data.length; i++) {
            var dataItem = data[i];
            var name = dataItem.name
            var fromCoord = data[0].value.slice(0, 2)
            var toCoord = dataItem.value.slice(0, 2)
            if (fromCoord && toCoord) {
                res.push([{
                    name: name,
                    coord: fromCoord,
                    value: dataItem.value[2],
                }, {
                    coord: toCoord,
                }]);
            }
        }
        return res;
    };

    var series = [];
    [
        ['广州市', gdDatas]
    ].forEach(function(item, i) {
        console.log(item)
        series.push({
                type: 'lines',
                zlevel: 1,
                effect: {
                    show: true,
                    period: 3, //箭头指向速度，值越小速度越快
                    trailLength: 0.7, //特效尾迹长度[0,1]值越大，尾迹越长重
                    color: '#fff', //箭头图标
                    symbolSize: 3, //图标大小
                },
                lineStyle: {
                    normal: {
                        width: 0.1, //尾迹线条宽度
                        opacity: 0.2, //尾迹线条透明度
                        curveness: 0.3 //尾迹线条曲直度
                    }
                },
                data: convertData(item[1])
            }, {
                type: 'effectScatter',
                coordinateSystem: 'geo',
                zlevel: 2,
                rippleEffect: { //涟漪特效
                    period: 4, //动画时间，值越小速度越快
                    brushType: 'stroke', //波纹绘制方式 stroke, fill
                    scale: 4 //波纹圆环最大限制，值越大波纹越大
                },
                label: {
                    normal: {
                        show: false,
                        position: 'right', //显示位置
                        offset: [5, 0], //偏移设置
                        formatter: function(params) { //圆环显示文字
                            return params.data.name;
                        },
                        fontSize: 19
                    },
                    emphasis: {
                        show: true
                    }
                },
                symbol: 'circle',
                symbolSize: function(val) {
                    return 10 + val[2] * 0; //圆环大小
                },
                itemStyle: {
                    normal: {
                        show: false,
                        color: '#f00'
                    }
                },
                data: item[1].map(function(dataItem) {
                    return {
                        name: dataItem[0].name,
                        value: gdGeoCoordMap[dataItem[0].name].concat([dataItem[0].value])
                    };
                }),
            },
            //被攻击点
            {
                type: 'scatter',
                coordinateSystem: 'geo',
                zlevel: 2,
                rippleEffect: {
                    period: 4,
                    brushType: 'stroke',
                    scale: 4
                },
                label: {
                    normal: {
                        show: false,
                        position: 'right',
                        //offset:[5, 0],
                        color: '#0f0',
                        formatter: '{b}',
                        textStyle: {
                            color: "#0f0"
                        }
                    },
                    emphasis: {
                        show: false,
                        color: "#f60"
                    }
                },
                // symbol: 'pin',
                // symbolSize: 50,
                // data: [{
                //     name: item[0],
                //     value: gdGeoCoordMap[item[0]].concat([10]),
                // }],
            }
        );
    });









    option = {
            "tooltip": {
                trigger: 'item',
                backgroundColor: 'rgba(0,0,0,0)',
                formatter: function(item) {
                    console.log(item, 'item!!!!')
                    if (item.componentSubType === 'lines') {
                        var tipHtml1 = '';
                        tipHtml1 = '<div style="background:#fff;border-radius:10px;padding-top:10px;box-shadow:0 0 10px #666">' +
                            '<div style="color:#fff;height:20px;border-radius:6px;font-size:12px;line-height:20px;background-color:#5861a2;text-align:center;margin:0 2px;">' + item.data.name + '</div>' +
                            '<div style="text-align:center;color:#494949;padding:8px 6px">' +
                            '<span style="font-size:18px;font-weight:bold;">' + '总测试设备：' + item.data.value + ' ' + '</span>' +
                            '</div>' + '</div>';
                        return tipHtml1;
                    } else if (item.componentSubType === 'effectScatter') {
                        var tipHtml2 = '';
                        tipHtml2 = '<div style="background:#fff;border-radius:10px;padding-top:10px;box-shadow:0 0 10px #666">' +
                            '<div style="color:#fff;height:20px;border-radius:6px;font-size:12px;line-height:20px;background-color:#5861a2;text-align:center;margin:0 2px;">' + item.data.name + '</div>' +
                            '<div style="text-align:center;color:#494949;padding:8px 6px">' +
                            '<span style="font-size:18px;font-weight:bold;">' + '总测试设备：' + item.data.value[2] + ' ' + '</span>' +
                            '</div>' + '</div>';
                        return tipHtml2;
                    } else if (item.componentSubType === 'scatter') {
                        var tipHtml3 = '';
                        tipHtml3 = '<div style="background:#fff;border-radius:10px;padding-top:10px;box-shadow:0 0 10px #666">' +
                            '<div style="color:#fff;height:20px;border-radius:6px;font-size:12px;line-height:20px;background-color:#5861a2;text-align:center;margin:0 2px;">' + item.data.name + '</div>' +
                            '<div style="text-align:center;color:#494949;padding:8px 6px">' +
                            '<span style="font-size:18px;font-weight:bold;">' + '总测试设备：' + item.data.value[2] + ' ' + '</span>' +
                            '</div>' + '</div>';
                        return tipHtml3;
                    }
                }
            },
            backgroundColor: "#013954",
            "graphic": [{
                type: 'group',
                left: pos.left,
                top: pos.top - 4,
                children: [{
                    type: 'line',
                    left: 0,
                    top: -20,
                    shape: {
                        x1: 0,
                        y1: 0,
                        x2: 85,
                        y2: 0
                    },
                    style: {
                        stroke: style.lineColor,
                    }
                }, {
                    type: 'line',
                    left: 0,
                    top: 20,
                    shape: {
                        x1: 0,
                        y1: 0,
                        x2: 85,
                        y2: 0
                    },
                    style: {
                        stroke: style.lineColor,
                    }
                }]
            }, {
                id: name[idx],
                type: 'group',
                left: pos.left + 2,
                top: pos.top,
                children: [{
                    type: 'polyline',
                    left: 90,
                    top: -12,
                    shape: {
                        points: line
                    },
                    style: {
                        stroke: 'transparent',
                        key: name[0]
                    },
                    onclick: function() {
                        var name = this.style.key;
                        console.log(name, '111111')
                        handleEvents.resetOption(myChart, option, name);
                    }
                }, {
                    type: 'text',
                    left: 0,
                    top: 'middle',
                    style: {
                        text: name[0] === '广东' ? '广东省' : name[0],
                        textAlign: 'center',
                        fill: style.textColor,
                        font: style.font
                    },
                    onclick: function() {
                        handleEvents.resetOption(myChart, option, '广东');
                    }
                }, {
                    type: 'text',
                    left: 0,
                    top: 10,
                    style: {
                        text: 'GUANGDONG',
                        textAlign: 'center',
                        fill: style.textColor,
                        font: '12px "Microsoft YaHei", sans-serif',
                    },
                    onclick: function() {
                        handleEvents.resetOption(myChart, option, '广东');
                    }
                }]
            }],
            visualMap: { //图例值控制
                min: 0,
                max: 1,
                calculable: true,
                show: false,
                color: ['#f44336', '#fc9700', '#ffde00', '#ffde00', '#00eaff'],
                textStyle: {
                    color: '#fff'
                }
            },
            "geo": {
                "map": "广东",
                "layoutCenter": ["55%", "50%"],
                "layoutSize": "109%",
                "label": {
                    "normal": {
                        "show": true,
                        "textStyle": {
                            "color": '#fff'
                        }
                    },
                    "emphasis": {
                        "textStyle": {
                            "color": '#fff'
                        }
                    }
                },
                "roam": true, //是否允许缩放
                "mapLocation": {
                    "width": "110%",
                    "height": "97%"
                },

                "itemStyle": {
                    "normal": {
                        borderColor: 'rgba(147, 235, 248, 1)',
                        borderWidth: 1,
                        areaColor: {
                            type: 'radial',
                            x: 0.5,
                            y: 0.5,
                            r: 0.8,
                            colorStops: [{
                                offset: 0,
                                color: 'rgba(147, 235, 248, 0)' // 0% 处的颜色
                            }, {
                                offset: 1,
                                color: 'rgba(147, 235, 248, .2)' // 100% 处的颜色
                            }],
                            globalCoord: false // 缺省为 false
                        },
                        shadowColor: 'rgba(128, 217, 248, 1)',
                        // shadowColor: 'rgba(255, 255, 255, 1)',
                        shadowOffsetX: -2,
                        shadowOffsetY: 2,
                        shadowBlur: 10
                    },
                    "emphasis": {
                        itemStyle: {
                            areaColor: '#FFD181',
                            borderColor: '#404a59',
                            borderWidth: 1
                        }
                    }
                }
            },
            series: series
        },
        myChart.setOption(option);
    myChart.on('click', function(params) {
        console.log(params)
        var _self = this;
        if (cityMap[params.name]) {
            var url = cityMap[params.name];
            $.get(url, function(response) {
                //console.log(response, 'res');
                curGeoJson = response;
                echarts.registerMap(params.name, response);
                handleEvents.resetOption(_self, option, params.name);
            });
        }
    });
});