option = {
    title: {
        text: '用电量'
    },
    tooltip: {
        trigger: 'axis'
    },
    legend: {
        data: ['2018', '2019']
    },
    grid: {
        left: '3%',
        right: '4%',
        bottom: '3%',
        containLabel: true
    },
    toolbox: {
        feature: {
            saveAsImage: {}
        }
    },
    xAxis: {
        type: 'category',
        boundaryGap: false,
        data: ['1月','2月','3月','4月','5月','6月','7月','8月','9月','10月','11月','12月']
    },
    yAxis: {
        type: 'value'
    },
    series: [
        {
            name: '2018',
            type: 'line',
            stack: '总量',
            data: [10557218550,6237417378,8997696931,8717345460,10361591990,8407849159,11982401492,12553245301,9222228020,7847842234,7436288967,9763988505]
        },
        {
            name: '2019',
            type: 'line',
            stack: '总量',
            data: [9589368107,5433753843,7458082674,8122048867,8291067885,7423225105,8929514380,11131429566,10601929587,10174675944,8819760003,10472460386]
        }
    ]
};
