const set = [
    ['品牌', '指标满意度', '指标提及率', '正面指标声量', '负面指标声量', '全部指标声量', '全部评论数'],
    ['云鲸', 99.38, 8.68, 2918, 8881, 8406, 12678],
    ['科沃斯', 96.37, 94.22, 447, 5741, 2270, 4288],
    ['iRobot', 95.03, 36.77, 1929, 2045, 2031, 2062],
    ['福维克', 92.73, 30, 6673, 4406, 2147, 2932],
    ['TAB-塔波尔', 92.27, 12.47, 2321, 6457, 5489, 10401],
    ['海尔', 82.89, 66.6, 7415, 5553, 8892, 17119],
    ['三星', 81.2, 26.29, 985, 7934, 6125, 8163],
    ['苏宁', 78.24, 32.35, 7170, 603, 1228, 1296],
    ['Neato', 76.33, 3.97, 1958, 4711, 6060, 8561],
    ['Dyson', 61.64, 90.41, 2106, 2576, 7259, 11834],
    ['惠而浦', 60.44, 54.98, 3321, 650, 2526, 4122],
    ['伊莱克斯', 53.43, 29.17, 8355, 3144, 3475, 3840],
    ['科语', 53.42, 14.73, 3197, 6011, 7934, 9659],
    ['Bobot', 52.55, 5.85, 8785, 1801, 3227, 3592],
    ['联想', 51.92, 6.72, 1588, 7715, 544, 1067],
    ['飞利浦', 50.71, 62.42, 2462, 3485, 5673, 6205],
    ['哇力', 49.25, 52.05, 4546, 8375, 1335, 1678],
    ['福玛特', 48.91, 23.33, 1714, 3632, 8143, 9546],
    ['斐纳', 48.63, 4.72, 695, 7612, 4270, 5505],
    ['浦桑尼克', 41.6, 63.08, 4370, 888, 3881, 3982],
    ['Roborock', 30.66, 49.95, 2068, 343, 7854, 12297],
    ['美的', 23.52, 19.63, 1625, 5489, 8561, 10906],
    ['松下', 22.13, 9.72, 1102, 1175, 5356, 5463],
    ['小米', 9.07, 72.16, 2186, 7180, 2596, 4404],
    ['iLife', 5.39, 9.57, 6450, 7256, 7731, 9930],
    ['小狗', 3.74, 55.73, 5618, 5409, 7540, 10806]
];

option = {
    // backgroundColor: '#fff',
    dataset: {
        source: set
    },
    grid: {
        left: 40,
        right: 48,
        top: 64,
        bottom: 40
    },
    dataZoom:{
        height:16,
        bottom:0
    },
    legend: {
        left: 0,
        top: 4,
        data:[ '指标满意度', '指标提及率', '正面指标声量', '负面指标声量', '全部指标声量', '全部评论数']
    },
    xAxis: {
        type: 'category'
    },
    yAxis: [{
        name: '比例（%）',
        type: 'value'
    }, {
        name: '数量',
        type: 'value'

    }],
    series: [
        {
            type: 'line',
            smooth: true,
            name:set[0][1],
            encode: {
                x: 0,
                y: 1
            }
        }, 
        {
            type: 'line',
            smooth: true,
            name:set[0][2],
            encode: {
                x: 0,
                y: 2
            }
        },
        {
            type:'bar',
            barWidth:'60%',
            stack:true,
            name:set[0][3],
            yAxisIndex:1,
            encode:{x:0,y:3}
        },
        {
            type:'bar',
            barWidth:'60%',
            stack:true,
            name:set[0][4],
            yAxisIndex:1,
            encode:{x:0,y:4}
        },
        {
            type:'line',
            smooth:true,
            name:set[0][5],
            yAxisIndex:1,
            encode:{x:0,y:5}
        },
        // {
        //     type:'line',
        //     smooth:true,
        //     name:set[0][6],
        //     yAxisIndex:1,
        //     encode:{x:0,y:6}
        // }
    ]
};
myChart.resize({
    width: 824,
    height: 224
})