var DATA = [
    ["北京市", 39, 39.929986, 116.395645],
    ["上海市", 27, 31.249162, 121.487899],
    ["广州市", 7, 23.120049, 113.30765],
    ["杭州市", 7, 30.259244, 120.219375],
    ["郑州市", 3, 34.75661, 113.649644],
    ["武汉市", 3, 30.581084, 114.3162],
    ["悉尼", 3, -33.860489, 151.163061],
    ["新加坡", 2, 26.258324, 105.961714],
    ["深圳市", 2, 22.546054, 114.025974],
    ["南京市", 2, 32.057236, 118.778074],
    ["成都市", 2, 30.679943, 104.067923],
    ["天津市", 2, 39.14393, 117.210813],
    ["Kingston", 2, 44.268447, -76.512442],
    ["合肥市", 2, 31.866942, 117.282699],
    ["上塞纳省", 1, 48.8399127, 2.100653],
    ["蔚山广域市", 1, 35.5622479, 129.2110695],
    ["阿姆斯特丹", 1, 28.797275, 121.164592],
    ["State College", 1, 40.866261, -77.836544],
    ["佛罗里达州 Coral Gables", 1, 25.6996615, -80.3433681],
    ["加利福尼亚州 洛杉矶", 2, 34.004127, -118.31304],
    ["马萨诸塞州 波士顿", 1, 42.356012, -71.119375],
    ["明尼苏达州 明尼阿波利斯", 1, 44.953389, -93.202599],
    ["纽约州 纽约", 1, 40.79617, -73.983747],
    ["田纳西州 Franklin", 1, 41.394644, -79.824889],
    ["瑞典 斯德哥尔摩", 1, 59.338882, 18.075865],
    ["英国 英格兰", 1, 53.005662, -1.158626],
    ["福建省 厦门市", 1, 24.489231, 118.103886],
    ["东莞市", 1, 23.043024, 113.763434],
    ["佛山市", 1, 23.035095, 113.134026],
    ["珠海市", 1, 22.256915, 113.562447],
    ["河北省 保定市", 1, 38.886565, 115.49481],
    ["河北省 石家庄市", 1, 38.048958, 114.522082],
    ["湖南省 长沙市", 1, 28.213478, 112.979353],
    ["南通市", 1, 32.014665, 120.873801],
    ["苏州市", 1, 31.317987, 120.619907],
    ["无锡市", 1, 31.570037, 120.305456],
    ["扬州市", 1, 32.408505, 119.427778],
    ["哈密地区", 1, 42.858596, 93.528355],
    ["昆明市", 1, 25.049153, 102.714601]
]




option = {
    backgroundColor: '#404a59',
    title: {
        text: 'Enroll distribution',
        subtext: 'From Excel',
        left: 'center',
        top: 'top',
        textStyle: {
            color: '#fff'
        }
    },
    tooltip: {
        trigger: 'item',
        formatter: function(params) {
            var value = (params.value + '').split('.');
            value = value[1].split(',')[1];
            return params.name;
        }
    },
    visualMap: {
        show: false,
        min: 0,
        max: 150,
        inRange: {
            symbolSize: [1, 100]
        }
    },
    geo: {
        name: 'Enroll distribution',
        type: 'map',
        map: 'world',
        roam: true,
        label: {
            emphasis: {
                show: false
            }
        },
        itemStyle: {
            normal: {
                areaColor: '#323c48',
                borderColor: '#111'
            },
            emphasis: {
                areaColor: '#2a333d'
            }
        }
    },
    series: [{
        type: 'scatter',
        coordinateSystem: 'geo',
        data: DATA.map(function(item) {
            return {
                name: item[0] + " : " + item[1] + "人",
                value: [
                    item[3],
                    item[2],
                    Math.sqrt(item[1]) * 10
                ],
                itemStyle: {
                    normal: {
                        color: "#fff"
                    }
                }
            };
        })
    }]
};