option = {
  "title": [
    {
        left:"center",
        text:"辅助用药用量分析",
      "show": true
    }
  ],
  "series": [
    {
      "nodeGap": 2,
      "axisLine": {
        "lineStyle": {
          "color": [
            [
              0.2,
              ""
            ],
            [
              0.8,
              ""
            ],
            [
              100,
              ""
            ]
          ]
        }
      },
      "detail": {
        "offsetCenter": [
          "0%",
          "40%"
        ],
        "fontFamily": "serif"
      },
      "symbolOffset": [
        0,
        0
      ],
      "center": [
        "50%",
        "50%"
      ],
      "name": "T",
      "type": "sankey",
      "encode": {
        "itemName": "",
        "value": "V",
        "x": "F",
        "y": "T",
        "z": ""
      },
      "data": [
        {
          "name": "消癌平注射液",
          "symbolSize": null
        },
        {
          "name": "肿瘤科",
          "symbolSize": null
        },
        {
          "name": "复方苦参注射液",
          "symbolSize": null
        },
        {
          "name": "注射用丹参多酚酸盐",
          "symbolSize": null
        },
        {
          "name": "心血管内科",
          "symbolSize": null
        },
        {
          "name": "醒脑静注射液",
          "symbolSize": null
        },
        {
          "name": "神经内科",
          "symbolSize": null
        },
        {
          "name": "脑苷肌肽注射液",
          "symbolSize": null
        },
        {
          "name": "内分泌科",
          "symbolSize": null
        },
        {
          "name": "小牛血清去蛋白注射液",
          "symbolSize": null
        },
        {
          "name": "血必净注射液",
          "symbolSize": null
        },
        {
          "name": "重症医学科",
          "symbolSize": null
        },
        {
          "name": "鸦胆子油乳注射液",
          "symbolSize": null
        },
        {
          "name": "谷红注射液",
          "symbolSize": null
        },
        {
          "name": "脾多肽注射液",
          "symbolSize": null
        },
        {
          "name": "胸腺五肽注射液",
          "symbolSize": null
        },
        {
          "name": "注射用二丁酰环磷腺苷钙",
          "symbolSize": null
        },
        {
          "name": "注射用胸腺五肽",
          "symbolSize": null
        },
        {
          "name": "曲克芦丁脑蛋白水解物注射液",
          "symbolSize": null
        },
        {
          "name": "神经外科",
          "symbolSize": null
        },
        {
          "name": "骨瓜提取物注射液",
          "symbolSize": null
        },
        {
          "name": "中医科",
          "symbolSize": null
        },
        {
          "name": "注射用磷酸肌酸钠",
          "symbolSize": null
        },
        {
          "name": "多种微量元素注射液",
          "symbolSize": null
        },
        {
          "name": "注射用脑蛋白水解物",
          "symbolSize": null
        },
        {
          "name": "康艾注射液",
          "symbolSize": null
        },
        {
          "name": "放射治疗科",
          "symbolSize": null
        },
        {
          "name": "转化糖电解质注射液",
          "symbolSize": null
        },
        {
          "name": "注射用复方三维B(Ⅱ)",
          "symbolSize": null
        },
        {
          "name": "肾康注射液",
          "symbolSize": null
        },
        {
          "name": "肾脏内科",
          "symbolSize": null
        },
        {
          "name": "脾氨肽口服冻干粉",
          "symbolSize": null
        },
        {
          "name": "丹红注射液",
          "symbolSize": null
        },
        {
          "name": "注射用丙氨酰谷氨酰胺",
          "symbolSize": null
        },
        {
          "name": "普通外科",
          "symbolSize": null
        },
        {
          "name": "参芎葡萄糖注射液",
          "symbolSize": null
        },
        {
          "name": "参麦注射液",
          "symbolSize": null
        },
        {
          "name": "疏血通注射液",
          "symbolSize": null
        },
        {
          "name": "瓜蒌皮注射液",
          "symbolSize": null
        },
        {
          "name": "干二科",
          "symbolSize": null
        },
        {
          "name": "注射用红花黄色素",
          "symbolSize": null
        },
        {
          "name": "注射用奥拉西坦",
          "symbolSize": null
        },
        {
          "name": "肝胆外科",
          "symbolSize": null
        },
        {
          "name": "参附注射液",
          "symbolSize": null
        },
        {
          "name": "奥拉西坦注射液",
          "symbolSize": null
        },
        {
          "name": "干一科",
          "symbolSize": null
        },
        {
          "name": "干三科",
          "symbolSize": null
        },
        {
          "name": "天麻素注射液",
          "symbolSize": null
        },
        {
          "name": "康莱特注射液",
          "symbolSize": null
        },
        {
          "name": "丹参川芎嗪注射液",
          "symbolSize": null
        },
        {
          "name": "舒肝宁注射液",
          "symbolSize": null
        },
        {
          "name": "注射用血栓通(冻干)",
          "symbolSize": null
        },
        {
          "name": "奥拉西坦胶囊",
          "symbolSize": null
        },
        {
          "name": "吸入用乙酰半胱氨酸溶液",
          "symbolSize": null
        },
        {
          "name": "焦医生",
          "symbolSize": null
        },
        {
          "name": "王医生",
          "symbolSize": null
        },
        {
          "name": "林医生",
          "symbolSize": null
        },
        {
          "name": "董医生",
          "symbolSize": null
        },
        {
          "name": "张医生",
          "symbolSize": null
        },
        {
          "name": "吕倩",
          "symbolSize": null
        },
        {
          "name": "吴林",
          "symbolSize": null
        },
        {
          "name": "侯权",
          "symbolSize": null
        },
        {
          "name": "侯医生",
          "symbolSize": null
        },
        {
          "name": "贺医生",
          "symbolSize": null
        },
        {
          "name": "胡胡",
          "symbolSize": null
        },
        {
          "name": "刘秀",
          "symbolSize": null
        },
        {
          "name": "侯波",
          "symbolSize": null
        },
        {
          "name": "谢伟",
          "symbolSize": null
        },
        {
          "name": "马俊",
          "symbolSize": null
        },
        {
          "name": "马志明",
          "symbolSize": null
        },
        {
          "name": "韩红伟",
          "symbolSize": null
        },
        {
          "name": "邹*浩",
          "symbolSize": null
        },
        {
          "name": "匡医生",
          "symbolSize": null
        },
        {
          "name": "韦*霞",
          "symbolSize": null
        },
        {
          "name": "杜*争",
          "symbolSize": null
        },
        {
          "name": "邹虹",
          "symbolSize": null
        },
        {
          "name": "宋向荣",
          "symbolSize": null
        },
        {
          "name": "夏*娟",
          "symbolSize": null
        },
        {
          "name": "李*峰",
          "symbolSize": null
        },
        {
          "name": "魏英",
          "symbolSize": null
        },
        {
          "name": "胡晓",
          "symbolSize": null
        },
        {
          "name": "李小芳",
          "symbolSize": null
        },
        {
          "name": "何小华",
          "symbolSize": null
        },
        {
          "name": "何大梅",
          "symbolSize": null
        },
        {
          "name": "逯医生",
          "symbolSize": null
        },
        {
          "name": "李梦",
          "symbolSize": null
        },
        {
          "name": "叶*君",
          "symbolSize": null
        },
        {
          "name": "王小巍",
          "symbolSize": null
        },
        {
          "name": "陈**",
          "symbolSize": null
        },
        {
          "name": "黄9辉",
          "symbolSize": null
        },
        {
          "name": "苟丽",
          "symbolSize": null
        },
        {
          "name": "徐丽",
          "symbolSize": null
        },
        {
          "name": "何雯",
          "symbolSize": null
        },
        {
          "name": "方哲",
          "symbolSize": null
        },
        {
          "name": "徐小宇",
          "symbolSize": null
        },
        {
          "name": "赵*伟",
          "symbolSize": null
        }
      ],
      "links": [
        {
          "T": "肿瘤科",
          "F": "消癌平注射液",
          "V": 1616855.09,
          "顺序": 1,
          "source": "消癌平注射液",
          "target": "肿瘤科",
          "value": 1616855.09
        },
        {
          "T": "肿瘤科",
          "F": "复方苦参注射液",
          "V": 1363264,
          "顺序": 2,
          "source": "复方苦参注射液",
          "target": "肿瘤科",
          "value": 1363264
        },
        {
          "T": "心血管内科",
          "F": "注射用丹参多酚酸盐",
          "V": 1345479,
          "顺序": 3,
          "source": "注射用丹参多酚酸盐",
          "target": "心血管内科",
          "value": 1345479
        },
        {
          "T": "神经内科",
          "F": "醒脑静注射液",
          "V": 1127401.6,
          "顺序": 4,
          "source": "醒脑静注射液",
          "target": "神经内科",
          "value": 1127401.6
        },
        {
          "T": "内分泌科",
          "F": "脑苷肌肽注射液",
          "V": 1112505.69,
          "顺序": 5,
          "source": "脑苷肌肽注射液",
          "target": "内分泌科",
          "value": 1112505.69
        },
        {
          "T": "内分泌科",
          "F": "小牛血清去蛋白注射液",
          "V": 1086348.5,
          "顺序": 6,
          "source": "小牛血清去蛋白注射液",
          "target": "内分泌科",
          "value": 1086348.5
        },
        {
          "T": "重症医学科",
          "F": "血必净注射液",
          "V": 1067432,
          "顺序": 7,
          "source": "血必净注射液",
          "target": "重症医学科",
          "value": 1067432
        },
        {
          "T": "肿瘤科",
          "F": "鸦胆子油乳注射液",
          "V": 991515,
          "顺序": 8,
          "source": "鸦胆子油乳注射液",
          "target": "肿瘤科",
          "value": 991515
        },
        {
          "T": "心血管内科",
          "F": "谷红注射液",
          "V": 983820,
          "顺序": 9,
          "source": "谷红注射液",
          "target": "心血管内科",
          "value": 983820
        },
        {
          "T": "重症医学科",
          "F": "脾多肽注射液",
          "V": 927047.5,
          "顺序": 10,
          "source": "脾多肽注射液",
          "target": "重症医学科",
          "value": 927047.5
        },
        {
          "T": "肿瘤科",
          "F": "胸腺五肽注射液",
          "V": 925287,
          "顺序": 11,
          "source": "胸腺五肽注射液",
          "target": "肿瘤科",
          "value": 925287
        },
        {
          "T": "血液科",
          "F": "脾多肽注射液",
          "V": 924760,
          "顺序": 12,
          "source": "脾多肽注射液",
          "target": "血液科",
          "value": 924760
        },
        {
          "T": "心血管内科",
          "F": "注射用二丁酰环磷腺苷钙",
          "V": 920907.83,
          "顺序": 13,
          "source": "注射用二丁酰环磷腺苷钙",
          "target": "心血管内科",
          "value": 920907.83
        },
        {
          "T": "肿瘤科",
          "F": "注射用胸腺五肽",
          "V": 871164,
          "顺序": 14,
          "source": "注射用胸腺五肽",
          "target": "肿瘤科",
          "value": 871164
        },
        {
          "T": "内分泌科",
          "F": "曲克芦丁脑蛋白水解物注射液",
          "V": 860740.96,
          "顺序": 15,
          "source": "曲克芦丁脑蛋白水解物注射液",
          "target": "内分泌科",
          "value": 860740.96
        },
        {
          "T": "神经外科",
          "F": "醒脑静注射液",
          "V": 749939.2,
          "顺序": 16,
          "source": "醒脑静注射液",
          "target": "神经外科",
          "value": 749939.2
        },
        {
          "T": "中医科",
          "F": "骨瓜提取物注射液",
          "V": 705499.2,
          "顺序": 17,
          "source": "骨瓜提取物注射液",
          "target": "中医科",
          "value": 705499.2
        },
        {
          "T": "心血管内科",
          "F": "注射用磷酸肌酸钠",
          "V": 699307.18,
          "顺序": 18,
          "source": "注射用磷酸肌酸钠",
          "target": "心血管内科",
          "value": 699307.18
        },
        {
          "T": "神经外科",
          "F": "脑苷肌肽注射液",
          "V": 697126.15,
          "顺序": 19,
          "source": "脑苷肌肽注射液",
          "target": "神经外科",
          "value": 697126.15
        },
        {
          "T": "消化内科",
          "F": "多种微量元素注射液",
          "V": 674958.88,
          "顺序": 21,
          "source": "多种微量元素注射液",
          "target": "消化内科",
          "value": 674958.88
        },
        {
          "T": "神经内科",
          "F": "注射用脑蛋白水解物",
          "V": 648263.1,
          "顺序": 22,
          "source": "注射用脑蛋白水解物",
          "target": "神经内科",
          "value": 648263.1
        },
        {
          "T": "肿瘤科",
          "F": "康艾注射液",
          "V": 644427.52,
          "顺序": 23,
          "source": "康艾注射液",
          "target": "肿瘤科",
          "value": 644427.52
        },
        {
          "T": "放射治疗科",
          "F": "消癌平注射液",
          "V": 640000.55,
          "顺序": 24,
          "source": "消癌平注射液",
          "target": "放射治疗科",
          "value": 640000.55
        },
        {
          "T": "泌尿外科",
          "F": "转化糖电解质注射液",
          "V": 625489.6,
          "顺序": 25,
          "source": "转化糖电解质注射液",
          "target": "泌尿外科",
          "value": 625489.6
        },
        {
          "T": "耳鼻喉科",
          "F": "注射用复方三维B(Ⅱ)",
          "V": 558981,
          "顺序": 26,
          "source": "注射用复方三维B(Ⅱ)",
          "target": "耳鼻喉科",
          "value": 558981
        },
        {
          "T": "肾脏内科",
          "F": "肾康注射液",
          "V": 557091.54,
          "顺序": 27,
          "source": "肾康注射液",
          "target": "肾脏内科",
          "value": 557091.54
        },
        {
          "T": "呼吸科",
          "F": "脾氨肽口服冻干粉",
          "V": 523834.87,
          "顺序": 28,
          "source": "脾氨肽口服冻干粉",
          "target": "呼吸科",
          "value": 523834.87
        },
        {
          "T": "心血管内科",
          "F": "丹红注射液",
          "V": 520831.89,
          "顺序": 29,
          "source": "丹红注射液",
          "target": "心血管内科",
          "value": 520831.89
        },
        {
          "T": "肿瘤科",
          "F": "脾多肽注射液",
          "V": 518500,
          "顺序": 30,
          "source": "脾多肽注射液",
          "target": "肿瘤科",
          "value": 518500
        },
        {
          "T": "普通外科",
          "F": "注射用丙氨酰谷氨酰胺",
          "V": 508246.2,
          "顺序": 31,
          "source": "注射用丙氨酰谷氨酰胺",
          "target": "普通外科",
          "value": 508246.2
        },
        {
          "T": "普通外科",
          "F": "多种微量元素注射液",
          "V": 488543.91,
          "顺序": 32,
          "source": "多种微量元素注射液",
          "target": "普通外科",
          "value": 488543.91
        },
        {
          "T": "神经内科",
          "F": "参芎葡萄糖注射液",
          "V": 474781.2,
          "顺序": 33,
          "source": "参芎葡萄糖注射液",
          "target": "神经内科",
          "value": 474781.2
        },
        {
          "T": "肿瘤科",
          "F": "参麦注射液",
          "V": 465856,
          "顺序": 34,
          "source": "参麦注射液",
          "target": "肿瘤科",
          "value": 465856
        },
        {
          "T": "消化内科",
          "F": "注射用丙氨酰谷氨酰胺",
          "V": 463854.6,
          "顺序": 35,
          "source": "注射用丙氨酰谷氨酰胺",
          "target": "消化内科",
          "value": 463854.6
        },
        {
          "T": "肿瘤科",
          "F": "脑苷肌肽注射液",
          "V": 452920.24,
          "顺序": 36,
          "source": "脑苷肌肽注射液",
          "target": "肿瘤科",
          "value": 452920.24
        },
        {
          "T": "中医科",
          "F": "疏血通注射液",
          "V": 440817.7,
          "顺序": 37,
          "source": "疏血通注射液",
          "target": "中医科",
          "value": 440817.7
        },
        {
          "T": "干二科",
          "F": "瓜蒌皮注射液",
          "V": 440302.2,
          "顺序": 38,
          "source": "瓜蒌皮注射液",
          "target": "干二科",
          "value": 440302.2
        },
        {
          "T": "重症医学科",
          "F": "脑苷肌肽注射液",
          "V": 436668.06,
          "顺序": 39,
          "source": "脑苷肌肽注射液",
          "target": "重症医学科",
          "value": 436668.06
        },
        {
          "T": "心血管内科",
          "F": "注射用红花黄色素",
          "V": 435280.95,
          "顺序": 40,
          "source": "注射用红花黄色素",
          "target": "心血管内科",
          "value": 435280.95
        },
        {
          "T": "神经内科",
          "F": "注射用奥拉西坦",
          "V": 430782,
          "顺序": 41,
          "source": "注射用奥拉西坦",
          "target": "神经内科",
          "value": 430782
        },
        {
          "T": "肝胆外科",
          "F": "转化糖电解质注射液",
          "V": 423657.98,
          "顺序": 42,
          "source": "转化糖电解质注射液",
          "target": "肝胆外科",
          "value": 423657.98
        },
        {
          "T": "重症医学科",
          "F": "参附注射液",
          "V": 423529,
          "顺序": 43,
          "source": "参附注射液",
          "target": "重症医学科",
          "value": 423529
        },
        {
          "T": "中医科",
          "F": "注射用红花黄色素",
          "V": 414587.76,
          "顺序": 44,
          "source": "注射用红花黄色素",
          "target": "中医科",
          "value": 414587.76
        },
        {
          "T": "肝胆外科",
          "F": "注射用复方三维B(Ⅱ)",
          "V": 410558,
          "顺序": 45,
          "source": "注射用复方三维B(Ⅱ)",
          "target": "肝胆外科",
          "value": 410558
        },
        {
          "T": "普通外科",
          "F": "转化糖电解质注射液",
          "V": 409189.2,
          "顺序": 46,
          "source": "转化糖电解质注射液",
          "target": "普通外科",
          "value": 409189.2
        },
        {
          "T": "干五科",
          "F": "注射用丹参多酚酸盐",
          "V": 394796.4,
          "顺序": 47,
          "source": "注射用丹参多酚酸盐",
          "target": "干五科",
          "value": 394796.4
        },
        {
          "T": "神经内科",
          "F": "奥拉西坦注射液",
          "V": 392797.92,
          "顺序": 48,
          "source": "奥拉西坦注射液",
          "target": "神经内科",
          "value": 392797.92
        },
        {
          "T": "肿瘤科",
          "F": "脾氨肽口服冻干粉",
          "V": 392038.76,
          "顺序": 49,
          "source": "脾氨肽口服冻干粉",
          "target": "肿瘤科",
          "value": 392038.76
        },
        {
          "T": "干一科",
          "F": "注射用丹参多酚酸盐",
          "V": 380319,
          "顺序": 50,
          "source": "注射用丹参多酚酸盐",
          "target": "干一科",
          "value": 380319
        },
        {
          "T": "血液科",
          "F": "注射用复方三维B(Ⅱ)",
          "V": 378319,
          "顺序": 51,
          "source": "注射用复方三维B(Ⅱ)",
          "target": "血液科",
          "value": 378319
        },
        {
          "T": "中医科",
          "F": "参芎葡萄糖注射液",
          "V": 369631.8,
          "顺序": 52,
          "source": "参芎葡萄糖注射液",
          "target": "中医科",
          "value": 369631.8
        },
        {
          "T": "干三科",
          "F": "注射用奥拉西坦",
          "V": 356310,
          "顺序": 53,
          "source": "注射用奥拉西坦",
          "target": "干三科",
          "value": 356310
        },
        {
          "T": "干二科",
          "F": "血必净注射液",
          "V": 352086.25,
          "顺序": 54,
          "source": "血必净注射液",
          "target": "干二科",
          "value": 352086.25
        },
        {
          "T": "妇产科",
          "F": "转化糖电解质注射液",
          "V": 337969.38,
          "顺序": 55,
          "source": "转化糖电解质注射液",
          "target": "妇产科",
          "value": 337969.38
        },
        {
          "T": "心血管内科",
          "F": "天麻素注射液",
          "V": 332789.77,
          "顺序": 56,
          "source": "天麻素注射液",
          "target": "心血管内科",
          "value": 332789.77
        },
        {
          "T": "神经外科",
          "F": "小牛血清去蛋白注射液",
          "V": 326509.5,
          "顺序": 57,
          "source": "小牛血清去蛋白注射液",
          "target": "神经外科",
          "value": 326509.5
        },
        {
          "T": "普通外科",
          "F": "康莱特注射液",
          "V": 321030,
          "顺序": 58,
          "source": "康莱特注射液",
          "target": "普通外科",
          "value": 321030
        },
        {
          "T": "神经内科",
          "F": "丹参川芎嗪注射液",
          "V": 313562.5,
          "顺序": 59,
          "source": "丹参川芎嗪注射液",
          "target": "神经内科",
          "value": 313562.5
        },
        {
          "T": "干五科",
          "F": "注射用奥拉西坦",
          "V": 310567.5,
          "顺序": 60,
          "source": "注射用奥拉西坦",
          "target": "干五科",
          "value": 310567.5
        },
        {
          "T": "神经内科",
          "F": "小牛血清去蛋白注射液",
          "V": 297406.5,
          "顺序": 61,
          "source": "小牛血清去蛋白注射液",
          "target": "神经内科",
          "value": 297406.5
        },
        {
          "T": "干三科",
          "F": "丹红注射液",
          "V": 296470.99,
          "顺序": 62,
          "source": "丹红注射液",
          "target": "干三科",
          "value": 296470.99
        },
        {
          "T": "肝胆外科",
          "F": "舒肝宁注射液",
          "V": 287280,
          "顺序": 63,
          "source": "舒肝宁注射液",
          "target": "肝胆外科",
          "value": 287280
        },
        {
          "T": "消化内科",
          "F": "丹参川芎嗪注射液",
          "V": 286937,
          "顺序": 64,
          "source": "丹参川芎嗪注射液",
          "target": "消化内科",
          "value": 286937
        },
        {
          "T": "消化内科",
          "F": "转化糖电解质注射液",
          "V": 279866,
          "顺序": 65,
          "source": "转化糖电解质注射液",
          "target": "消化内科",
          "value": 279866
        },
        {
          "T": "颌面外科",
          "F": "注射用复方三维B(Ⅱ)",
          "V": 270066,
          "顺序": 66,
          "source": "注射用复方三维B(Ⅱ)",
          "target": "颌面外科",
          "value": 270066
        },
        {
          "T": "心血管内科",
          "F": "参芎葡萄糖注射液",
          "V": 266558.4,
          "顺序": 67,
          "source": "参芎葡萄糖注射液",
          "target": "心血管内科",
          "value": 266558.4
        },
        {
          "T": "神经外科",
          "F": "注射用奥拉西坦",
          "V": 263969,
          "顺序": 68,
          "source": "注射用奥拉西坦",
          "target": "神经外科",
          "value": 263969
        },
        {
          "T": "心胸外科",
          "F": "注射用磷酸肌酸钠",
          "V": 263383.12,
          "顺序": 69,
          "source": "注射用磷酸肌酸钠",
          "target": "心胸外科",
          "value": 263383.12
        },
        {
          "T": "重症医学科",
          "F": "注射用二丁酰环磷腺苷钙",
          "V": 262952.76,
          "顺序": 70,
          "source": "注射用二丁酰环磷腺苷钙",
          "target": "重症医学科",
          "value": 262952.76
        },
        {
          "T": "神经外科",
          "F": "转化糖电解质注射液",
          "V": 251559.6,
          "顺序": 72,
          "source": "转化糖电解质注射液",
          "target": "神经外科",
          "value": 251559.6
        },
        {
          "T": "放射治疗科",
          "F": "康莱特注射液",
          "V": 250038,
          "顺序": 73,
          "source": "康莱特注射液",
          "target": "放射治疗科",
          "value": 250038
        },
        {
          "T": "放射治疗科",
          "F": "注射用胸腺五肽",
          "V": 235746,
          "顺序": 74,
          "source": "注射用胸腺五肽",
          "target": "放射治疗科",
          "value": 235746
        },
        {
          "T": "放射治疗科",
          "F": "参麦注射液",
          "V": 232870,
          "顺序": 75,
          "source": "参麦注射液",
          "target": "放射治疗科",
          "value": 232870
        },
        {
          "T": "消化内科",
          "F": "舒肝宁注射液",
          "V": 222705,
          "顺序": 76,
          "source": "舒肝宁注射液",
          "target": "消化内科",
          "value": 222705
        },
        {
          "T": "颌面外科",
          "F": "注射用血栓通(冻干)",
          "V": 222528.42,
          "顺序": 77,
          "source": "注射用血栓通(冻干)",
          "target": "颌面外科",
          "value": 222528.42
        },
        {
          "T": "心胸外科",
          "F": "消癌平注射液",
          "V": 214361.63,
          "顺序": 79,
          "source": "消癌平注射液",
          "target": "心胸外科",
          "value": 214361.63
        },
        {
          "T": "重症医学科",
          "F": "瓜蒌皮注射液",
          "V": 213111.6,
          "顺序": 80,
          "source": "瓜蒌皮注射液",
          "target": "重症医学科",
          "value": 213111.6
        },
        {
          "T": "儿科",
          "F": "脾氨肽口服冻干粉",
          "V": 210230.66,
          "顺序": 81,
          "source": "脾氨肽口服冻干粉",
          "target": "儿科",
          "value": 210230.66
        },
        {
          "T": "干二科",
          "F": "曲克芦丁脑蛋白水解物注射液",
          "V": 209576,
          "顺序": 82,
          "source": "曲克芦丁脑蛋白水解物注射液",
          "target": "干二科",
          "value": 209576
        },
        {
          "T": "干三科",
          "F": "瓜蒌皮注射液",
          "V": 204960.6,
          "顺序": 83,
          "source": "瓜蒌皮注射液",
          "target": "干三科",
          "value": 204960.6
        },
        {
          "T": "干二科",
          "F": "注射用奥拉西坦",
          "V": 202176.5,
          "顺序": 84,
          "source": "注射用奥拉西坦",
          "target": "干二科",
          "value": 202176.5
        },
        {
          "T": "放射治疗科",
          "F": "脾氨肽口服冻干粉",
          "V": 201196.92,
          "顺序": 85,
          "source": "脾氨肽口服冻干粉",
          "target": "放射治疗科",
          "value": 201196.92
        },
        {
          "T": "神经内科",
          "F": "天麻素注射液",
          "V": 196813.56,
          "顺序": 86,
          "source": "天麻素注射液",
          "target": "神经内科",
          "value": 196813.56
        },
        {
          "T": "普通外科",
          "F": "鸦胆子油乳注射液",
          "V": 195168,
          "顺序": 87,
          "source": "鸦胆子油乳注射液",
          "target": "普通外科",
          "value": 195168
        },
        {
          "T": "普通外科",
          "F": "康艾注射液",
          "V": 194654.32,
          "顺序": 88,
          "source": "康艾注射液",
          "target": "普通外科",
          "value": 194654.32
        },
        {
          "T": "放射治疗科",
          "F": "复方苦参注射液",
          "V": 194016,
          "顺序": 89,
          "source": "复方苦参注射液",
          "target": "放射治疗科",
          "value": 194016
        },
        {
          "T": "干五科",
          "F": "丹参川芎嗪注射液",
          "V": 192121.5,
          "顺序": 90,
          "source": "丹参川芎嗪注射液",
          "target": "干五科",
          "value": 192121.5
        },
        {
          "T": "骨科",
          "F": "转化糖电解质注射液",
          "V": 189785.18,
          "顺序": 91,
          "source": "转化糖电解质注射液",
          "target": "骨科",
          "value": 189785.18
        },
        {
          "T": "神经内科",
          "F": "脑苷肌肽注射液",
          "V": 187936.1,
          "顺序": 92,
          "source": "脑苷肌肽注射液",
          "target": "神经内科",
          "value": 187936.1
        },
        {
          "T": "放射治疗科",
          "F": "鸦胆子油乳注射液",
          "V": 187929,
          "顺序": 93,
          "source": "鸦胆子油乳注射液",
          "target": "放射治疗科",
          "value": 187929
        },
        {
          "T": "干二科",
          "F": "丹红注射液",
          "V": 186939.82,
          "顺序": 94,
          "source": "丹红注射液",
          "target": "干二科",
          "value": 186939.82
        },
        {
          "T": "干三科",
          "F": "注射用丹参多酚酸盐",
          "V": 185678.4,
          "顺序": 95,
          "source": "注射用丹参多酚酸盐",
          "target": "干三科",
          "value": 185678.4
        },
        {
          "T": "干三科",
          "F": "注射用磷酸肌酸钠",
          "V": 185565.38,
          "顺序": 96,
          "source": "注射用磷酸肌酸钠",
          "target": "干三科",
          "value": 185565.38
        },
        {
          "T": "神经内科",
          "F": "奥拉西坦胶囊",
          "V": 185321.42,
          "顺序": 97,
          "source": "奥拉西坦胶囊",
          "target": "神经内科",
          "value": 185321.42
        },
        {
          "T": "中医科",
          "F": "注射用血栓通(冻干)",
          "V": 184005.3,
          "顺序": 98,
          "source": "注射用血栓通(冻干)",
          "target": "中医科",
          "value": 184005.3
        },
        {
          "T": "干二科",
          "F": "注射用脑蛋白水解物",
          "V": 180445.2,
          "顺序": 99,
          "source": "注射用脑蛋白水解物",
          "target": "干二科",
          "value": 180445.2
        },
        {
          "T": "烧伤整形科",
          "F": "小牛血清去蛋白注射液",
          "V": 178705.5,
          "顺序": 100,
          "source": "小牛血清去蛋白注射液",
          "target": "烧伤整形科",
          "value": 178705.5
        },
        {
          "T": "重症医学科",
          "F": "肾康注射液",
          "V": 177345.3,
          "顺序": 101,
          "source": "肾康注射液",
          "target": "重症医学科",
          "value": 177345.3
        },
       {
          "T": "普通外科",
          "F": "注射用磷酸肌酸钠",
          "V": 167212.76,
          "顺序": 103,
          "source": "注射用磷酸肌酸钠",
          "target": "普通外科",
          "value": 167212.76
        },
        {
          "T": "普通外科",
          "F": "参芎葡萄糖注射液",
          "V": 165976.2,
          "顺序": 104,
          "source": "参芎葡萄糖注射液",
          "target": "普通外科",
          "value": 165976.2
        },
        {
          "T": "神经外科",
          "F": "注射用脑蛋白水解物",
          "V": 163040.9,
          "顺序": 105,
          "source": "注射用脑蛋白水解物",
          "target": "神经外科",
          "value": 163040.9
        },
        {
          "T": "神经外科",
          "F": "吸入用乙酰半胱氨酸溶液",
          "V": 162703.53,
          "顺序": 106,
          "source": "吸入用乙酰半胱氨酸溶液",
          "target": "神经外科",
          "value": 162703.53
        },
        {
          "T": "消化内科",
          "F": "鸦胆子油乳注射液",
          "V": 161766,
          "顺序": 107,
          "source": "鸦胆子油乳注射液",
          "target": "消化内科",
          "value": 161766
        },
        {
          "T": "重症医学科",
          "F": "注射用丙氨酰谷氨酰胺",
          "V": 159007.2,
          "顺序": 108,
          "source": "注射用丙氨酰谷氨酰胺",
          "target": "重症医学科",
          "value": 159007.2
        },
        {
          "T": "儿科",
          "F": "注射用磷酸肌酸钠",
          "V": 157937.78,
          "顺序": 109,
          "source": "注射用磷酸肌酸钠",
          "target": "儿科",
          "value": 157937.78
        },
        {
          "T": "重症医学科",
          "F": "吸入用乙酰半胱氨酸溶液",
          "V": 157433.4,
          "顺序": 110,
          "source": "吸入用乙酰半胱氨酸溶液",
          "target": "重症医学科",
          "value": 157433.4
        },
        {
          "T": "呼吸科",
          "F": "转化糖电解质注射液",
          "V": 155542.3,
          "顺序": 111,
          "source": "转化糖电解质注射液",
          "target": "呼吸科",
          "value": 155542.3
        },
        {
          "T": "内分泌科",
          "F": "瓜蒌皮注射液",
          "V": 154128,
          "顺序": 112,
          "source": "瓜蒌皮注射液",
          "target": "内分泌科",
          "value": 154128
        },
        {
          "T": "耳鼻喉科",
          "F": "转化糖电解质注射液",
          "V": 152977.96,
          "顺序": 114,
          "source": "转化糖电解质注射液",
          "target": "耳鼻喉科",
          "value": 152977.96
        },
        {
          "T": "普通外科",
          "F": "注射用胸腺五肽",
          "V": 151074,
          "顺序": 116,
          "source": "注射用胸腺五肽",
          "target": "普通外科",
          "value": 151074
        },
        {
          "T": "焦医生",
          "F": "重症医学科",
          "V": 1420102.71,
          "顺序": 1,
          "source": "重症医学科",
          "target": "焦医生",
          "value": 1420102.71
        },
        {
          "T": "王医生",
          "F": "肿瘤科",
          "V": 1375437.6,
          "顺序": 2,
          "source": "肿瘤科",
          "target": "王医生",
          "value": 1375437.6
        },
        {
          "T": "林医生",
          "F": "普通外科",
          "V": 1265381.12,
          "顺序": 3,
          "source": "普通外科",
          "target": "林医生",
          "value": 1265381.12
        },
        {
          "T": "董医生",
          "F": "肿瘤科",
          "V": 1211749.67,
          "顺序": 4,
          "source": "肿瘤科",
          "target": "董医生",
          "value": 1211749.67
        },
        {
          "T": "张医生",
          "F": "肿瘤科",
          "V": 1193450.49,
          "顺序": 5,
          "source": "肿瘤科",
          "target": "张医生",
          "value": 1193450.49
        },
        {
          "T": "吕倩",
          "F": "内分泌科",
          "V": 1169428.79,
          "顺序": 6,
          "source": "内分泌科",
          "target": "吕倩",
          "value": 1169428.79
        },
        {
          "T": "吴林",
          "F": "肿瘤科",
          "V": 1156872.41,
          "顺序": 7,
          "source": "肿瘤科",
          "target": "吴林",
          "value": 1156872.41
        },
        {
          "T": "侯权",
          "F": "重症医学科",
          "V": 1006664.41,
          "顺序": 8,
          "source": "重症医学科",
          "target": "侯权",
          "value": 1006664.41
        },
        {
          "T": "侯医生",
          "F": "肿瘤科",
          "V": 943303.79,
          "顺序": 9,
          "source": "肿瘤科",
          "target": "侯医生",
          "value": 943303.79
        },
        {
          "T": "贺医生",
          "F": "普通外科",
          "V": 935007.76,
          "顺序": 10,
          "source": "普通外科",
          "target": "贺医生",
          "value": 935007.76
        },
        {
          "T": "胡胡",
          "F": "中医科",
          "V": 889009.5,
          "顺序": 11,
          "source": "中医科",
          "target": "胡胡",
          "value": 889009.5
        },
        {
          "T": "刘秀",
          "F": "干二科",
          "V": 887542.87,
          "顺序": 12,
          "source": "干二科",
          "target": "刘秀",
          "value": 887542.87
        },
        {
          "T": "侯波",
          "F": "重症医学科",
          "V": 794416.72,
          "顺序": 13,
          "source": "重症医学科",
          "target": "侯波",
          "value": 794416.72
        },
        {
          "T": "谢伟",
          "F": "肿瘤科",
          "V": 785567.56,
          "顺序": 14,
          "source": "肿瘤科",
          "target": "谢伟",
          "value": 785567.56
        },
        {
          "T": "马俊",
          "F": "神经外科",
          "V": 779797.3,
          "顺序": 15,
          "source": "神经外科",
          "target": "马俊",
          "value": 779797.3
        },
        {
          "T": "马志明",
          "F": "神经外科",
          "V": 740373.15,
          "顺序": 16,
          "source": "神经外科",
          "target": "马志明",
          "value": 740373.15
        },
        {
          "T": "韩红伟",
          "F": "重症医学科",
          "V": 726555.28,
          "顺序": 17,
          "source": "重症医学科",
          "target": "韩红伟",
          "value": 726555.28
        },
        {
          "T": "邹*浩",
          "F": "神经外科",
          "V": 710208.96,
          "顺序": 18,
          "source": "神经外科",
          "target": "邹*浩",
          "value": 710208.96
        },
        {
          "T": "匡医生",
          "F": "心血管内科",
          "V": 705018.41,
          "顺序": 19,
          "source": "心血管内科",
          "target": "匡医生",
          "value": 705018.41
        },
        {
          "T": "韦*霞",
          "F": "内分泌科",
          "V": 681963.83,
          "顺序": 20,
          "source": "内分泌科",
          "target": "韦*霞",
          "value": 681963.83
        },
        {
          "T": "杜*争",
          "F": "心血管内科",
          "V": 675863.51,
          "顺序": 21,
          "source": "心血管内科",
          "target": "杜*争",
          "value": 675863.51
        },
        {
          "T": "邹虹",
          "F": "放射治疗科",
          "V": 675489.73,
          "顺序": 22,
          "source": "放射治疗科",
          "target": "邹虹",
          "value": 675489.73
        },
        {
          "T": "宋向荣",
          "F": "肾脏内科",
          "V": 675238.12,
          "顺序": 23,
          "source": "肾脏内科",
          "target": "宋向荣",
          "value": 675238.12
        },
        {
          "T": "夏*娟",
          "F": "放射治疗科",
          "V": 649777.12,
          "顺序": 24,
          "source": "放射治疗科",
          "target": "夏*娟",
          "value": 649777.12
        },
        {
          "T": "李*峰",
          "F": "肿瘤科",
          "V": 632354.87,
          "顺序": 25,
          "source": "肿瘤科",
          "target": "李*峰",
          "value": 632354.87
        },
        {
          "T": "魏英",
          "F": "重症医学科",
          "V": 631832.6,
          "顺序": 26,
          "source": "重症医学科",
          "target": "魏英",
          "value": 631832.6
        },
        {
          "T": "胡晓",
          "F": "干三科",
          "V": 631061.14,
          "顺序": 27,
          "source": "干三科",
          "target": "胡晓",
          "value": 631061.14
        },
        {
          "T": "李小芳",
          "F": "干二科",
          "V": 613389.69,
          "顺序": 28,
          "source": "干二科",
          "target": "李小芳",
          "value": 613389.69
        },
        {
          "T": "何小华",
          "F": "内分泌科",
          "V": 611930.25,
          "顺序": 29,
          "source": "内分泌科",
          "target": "何小华",
          "value": 611930.25
        },
        {
          "T": "何大梅",
          "F": "干一科",
          "V": 598611.76,
          "顺序": 30,
          "source": "干一科",
          "target": "何大梅",
          "value": 598611.76
        },
        {
          "T": "逯医生",
          "F": "肝胆外科",
          "V": 591894.95,
          "顺序": 31,
          "source": "肝胆外科",
          "target": "逯医生",
          "value": 591894.95
        },
        {
          "T": "李梦",
          "F": "心血管内科",
          "V": 588308.2,
          "顺序": 32,
          "source": "心血管内科",
          "target": "李梦",
          "value": 2588308.2
        },
        {
          "T": "叶*君",
          "F": "神经内科",
          "V": 12576386.81,
          "顺序": 33,
          "source": "神经内科",
          "target": "叶*君",
          "value": 3576386.81
        },
        {
          "T": "王小巍",
          "F": "心血管内科",
          "V": 569898.63,
          "顺序": 34,
          "source": "心血管内科",
          "target": "王小巍",
          "value": 569898.63
        },
        {
          "T": "陈**",
          "F": "肿瘤科",
          "V": 536618.93,
          "顺序": 35,
          "source": "肿瘤科",
          "target": "陈**",
          "value": 536618.93
        },
        {
          "T": "黄9辉",
          "F": "心血管内科",
          "V": 531784.63,
          "顺序": 36,
          "source": "心血管内科",
          "target": "黄9辉",
          "value": 531784.63
        },
        {
          "T": "苟丽",
          "F": "心血管内科",
          "V": 528761.61,
          "顺序": 37,
          "source": "心血管内科",
          "target": "苟丽",
          "value": 528761.61
        },
        {
          "T": "徐丽",
          "F": "放射治疗科",
          "V": 527934.33,
          "顺序": 38,
          "source": "放射治疗科",
          "target": "徐丽",
          "value": 527934.33
        },
        {
          "T": "何雯",
          "F": "神经内科",
          "V": 523936.78,
          "顺序": 39,
          "source": "神经内科",
          "target": "何雯",
          "value": 523936.78
        },
        {
          "T": "方哲",
          "F": "神经内科",
          "V": 518099.99,
          "顺序": 40,
          "source": "神经内科",
          "target": "方哲",
          "value": 518099.99
        },
        {
          "T": "徐小宇",
          "F": "内分泌科",
          "V": 515842.19,
          "顺序": 41,
          "source": "内分泌科",
          "target": "徐小宇",
          "value": 515842.19
        },
        {
          "T": "赵*伟",
          "F": "肿瘤科",
          "V": 510625.45,
          "顺序": 42,
          "source": "肿瘤科",
          "target": "赵*伟",
          "value": 510625.45
        }
      ],
      "categories": []
    }
  ],
  "jsonText": "",
  "type": "json",
  "dataset": [],
  "textStyle": {
    "fontSize": 18
  }
}