const set = [
    ['sku', '店铺数量', '价格趋势'],
    ['店铺3', 291, '最高'],
    ['店铺7', 291, '降价'],
    ['店铺22', 290, '最高'],
    ['店铺4', 272, '最低'],
    ['店铺13', 271, '降价'],
    ['店铺9', 257, '最低'],
    ['店铺2', 255, '降价'],
    ['店铺1', 248, '涨价'],
    ['店铺21', 247, '降价'],
    ['店铺12', 234, '最高'],
    ['店铺10', 232, '缺货等'],
    ['店铺26', 232, '不变'],
    ['店铺18', 217, '最高'],
    ['店铺25', 210, '最高'],
    ['店铺24', 208, '缺货等'],
    ['店铺15', 203, '最高'],
    ['店铺5', 199, '缺货等'],
    ['店铺19', 194, '降价'],
    ['店铺11', 185, '不变'],
    ['店铺20', 185, '最高'],
    ['店铺14', 158, '缺货等'],
    ['店铺16', 147, '最高'],
    ['店铺8', 136, '最高'],
    ['店铺23', 135, '最低'],
    ['店铺17', 116, '降价'],
    ['店铺6', 111, '涨价']
];

option = {
    // backgroundColor: '#fff',
    grid: [{
        left: 80,
        right: 56,
        top: 64,
        bottom: 24
    }],
    dataset: {
        source: set
    },
    visualMap:{
        type:'piecewise',
        orient:'horizontal',
        categories:['涨价', '降价', '最高', '最低', '不变', '缺货等'],
        color:['#D5D5D5','#E9CCC8','#C6EEDE','#D96969','#15B374','#61799B'],
        left:32,
        top:0,
        dimension:2
        
    },
    yAxis: {
        name: '价格',
    },
    xAxis: {
        name: 'SKU',
        type:'category'
        
    },
    series: [{
        type: 'bar',
        barWidth:'50%',
        encode: {
            x: '最高到手价',
            y: '商品'
        },
    }]
};

myChart.resize({
    width: 1112,
    height: 320
})