				var option = {
					tooltip: {
						show: true
					},
					legend: {
						data: ['销量']
					},
					xAxis: [{
						type: 'category',
						data: ["衬衫", "羊毛衫","1","2","3","4","5","1", "雪纺衫", "裤子", "高跟鞋", "袜子","1","2","3","4","5","1","2","3","4","5","1","2","3","4","5","1","2","3","4","5","1","2","3","4","5","1","2","3","4","5"]
					}],
					yAxis: [{
						type: 'value'
					}],
					series: [{
						"name": "销量",
						"type": "bar",
						"data": [5, 20, 40, 10, 10, 20,10,10,13,18,19,20,10,10,13,18,19,10,10,13,18,19,10,10,13,18,19,10,10,10,13,18,19,10,10,10,13,18,19,19,19,19,19,19],
						itemStyle: {
							normal: {
								label: {
									show: true, //开启显示
									position: 'top', //在上方显示
									textStyle: { //数值样式
										color: 'black',
										fontSize: 16
									}
								}
							}
						},
					}]

}