option = {
    backgroundColor: "rgba(0,0,0,0)",
    toolbox: {
        iconStyle: {
            normal: {
                borderColor: "#fff"
            },
            emphasis: {
                borderColor: "#b1e4ff"
            }
        }
    },
    brush: {
        brushStyle: {
            borderWidth: 2,
            color: "rgba(255,0,0,0.2)",
            borderColor: "rgba(0,0,0,0.5)"
        },
        seriesIndex: [0, 1],
        throttleType: "fixRate",
        throttleDelay: 300,
        geoIndex: 0
    },
    geo: {
        map: "world",
        roam: true,
        label: {
            show: true
        },
        itemStyle: {
            normal: {
                areaColor: {
                    type: "linear",
                    x: 0,
                    y: 0,
                    x2: 0,
                    y2: 1,
                    colorStops: [{
                            offset: 0,
                            color: "rgba(3, 56, 135, 1)" // 0% 处的颜色
                        },
                        {
                            offset: 1,
                            color: "rgba(1, 15, 37, 1)" // 100% 处的颜色
                        }
                    ]
                },
                borderColor: "#4e7bb7" //描边颜色
            }
        }
    },
    series: [{
        type: "scatter",
        id: "geoScatter",
        coordinateSystem: "geo",
        itemStyle: {
            normal: {
                opacity: 1,
                shadowBlur: 5,
                shadowColor: "rgba(0, 0, 0, 0.5)"
            }
        },
        data: [
            [150.53, -33.55, 0, "澳大利亚", 24772247],
            [-106.346771, 56.130366, 0, "加拿大", 36953765],
            [104.195397, 35.86166, 0, "中国", 1400050000],
            [10.451526, 51.165691, 0, "德国", 82293457],
            [9.501785, 56.26392, 0, "丹麦", 5754356],
            [-3.74922, 40.463667, 0, "西班牙", 46397452],
            [25.748151, 61.92411, 0, "芬兰", 5542517],
            [2.213749, 46.227638, 0, "法国", 65233271],
            [-3.435973, 55.378051, 0, "英国", 66573504],
            [21.824312, 39.074208, 0, "希腊", 11142161],
            [34.851612, 31.046051, 0, "以色列", 8452841],
            [12.56738, 41.87194, 0, "意大利", 60482200],
            [138.252924, 36.204824, 0, "日本", 127185332],
            [127.766922, 35.907757, 0, "韩国", 51269185],
            [-102.552784, 23.634501, 0, "墨西哥", 130759074],
            [5.291266, 52.132633, 0, "荷兰", 17084459],
            [19.145136, 51.919438, 0, "波兰", 38104832],
            [105.318756, 61.52401, 0, "俄罗斯", 143964709],
            [103.819836, 1.352083, 0, "新加坡", 5791901],
            [18.643501, 60.128161, 0, "瑞典", 9982709],
            [100.66471, 13.82031, 0, "泰国", 69183173],
            [-95.712891, 37.09024, 0, "美国", 326766748],
            [72.59242, 18.532938, 0, "印度", 1354051854]
        ],
        symbolSize: 15,
    }]
};