const set1 = [
    ['指标', '指标满意度', '相关销量（评论数）', '销量增长率', '指标正面声量', '指标负面声量'],
    ['指标1', 0.37, 169, -0.43, 151, 256],
    ['指标2', 0.39, 195, -0.88, 196, 304],
    ['指标3', 0.37, 318, -1.18, 157, 266],
    ['指标4', 0.32, 415, -2.61, 106, 223],
    ['指标5', 0.61, 250, 0.17, 313, 204],
    ['指标6', 0.62, 107, 0.65, 348, 211],
    ['指标7', 0.55, 375, -2.02, 310, 255],
    ['指标8', 0.68, 439, -1.17, 251, 120],
    ['指标9', 0.58, 172, 0.48, 258, 185],
    ['指标10', 0.63, 445, -2.68, 386, 225],
    ['指标11', 0.62, 378, 0.03, 278, 174],
    ['指标12', 0.45, 223, 0.35, 199, 239]
];

option = {
    // backgroundColor:'#fff',
    dataset: {
        source: set1
    },
    // legend:{
    //     top:4,
    //     left:16
    // },
    grid: {
        left: 48,
        top: 32,
        right: 48,
        bottom: 32,
    },
    xAxis: {
        name:'相关\n销量'
    },
    yAxis: {
        name:'指标满意度'
    },
    series: [{
        type: 'scatter',
        encode:{
            x:1,
            y:2
        }
    }, ]
};
myChart.resize({
    width: 536,
    height: 320
})