app.title = '世界人口总量 - 条形图';

option = {
    title: {
        text: '贪污金额',
        subtext: '数据来自网络'
    },
    tooltip: {
        trigger: 'axis',
        axisPointer: {
            type: 'shadow'
        }
    },
    legend: {
        data: ['', '2012年']
    },
    grid: {
        left: '3%',
        right: '4%',
        bottom: '3%',
        containLabel: true
    },
    xAxis: {
        type: 'value',
        boundaryGap: [0, 0.01]
    },
    yAxis: {
        type: 'category',
        data: ['李春城','刘铁男','倪发科','郭永祥','王素毅','李达球','蒋洁敏','季建业','廖少华','陈柏槐','郭有明','陈安众','李东生','杨刚','李崇禧','冀文林','祝作利','金道铭','沈培平','姚木根','申维辰','毛小兵','谭栖伟','阳宝华','杜善学','令政策','万庆良','谭力','韩先聪','武长顺','陈铁新','陈川平','聂春玉','白云','白恩培','潘逸阳','秦玉海','何家成','梁滨','隋凤富','朱明国','王敏','韩学键','孙鸿志','杨卫泽','陆武成','斯鑫良','苑世军','景春华','栗智','仇和','徐建一','徐钢','余远辉','肖天','乐大克','奚晓明','周本顺','张力军','赵黎平','谷春立','杨栋梁','白雪山','艾宝俊','吕锡文','龚清概','王保安','刘志庚','卢子跃','王阳','苏宏章','杨鲁豫','李成云','张越','杨振超']
    },
    series: [
        {
            name: '2011年',
            type: 'bar',
            data: [3979, 3558 , 1296 , 4347 , 1073 , 1095 , 2881 , 1132 , 1324 , 283 , 2379 , 810 , 2198 , 1379 , 1109 , 2046 , 854 , 12300 , 1615 , 2300 , 9542 , 10480 , 1143 , 1356 , 8900 , 1600 , 11125 , 8625 , 22235 , 52700 , 2195 , 91 , 4458 , 1782 , 24700 , 8601 , 2086 , 710 , 557 , 1044 , 23200 , 1805 , 1686 , 3579 , 1643 , 1626 , 1955 , 14700 , 1319 , 2443 , 1219 , 1977 , 901 , 796 , 1873 , 11400 , 4002 , 242 , 2368 , 4365 , 2849 , 3887 , 4320 , 1879 , 2303 , 5352 , 15428 , 9817 , 15000 , 6291 , 1996 , 2328 , 636 , 15700 , 8200]
        },
        
    ]
};
